{
  "scraped_date": "2026-03-01",
  "source": "hacker_news",
  "total_scraped": 129,
  "nontech_count": 26,
  "posts": [
    {
      "id": "47163885",
      "title": "Tell HN: YC companies scrape GitHub activity, send spam emails to users",
      "link": "https://news.ycombinator.com/item?id=47163885",
      "domain": "news.ycombinator.com",
      "author": "miki123211",
      "score": 671,
      "comment_count": 256,
      "created_ts": 1772098508,
      "is_internal": true,
      "post_text": "Hi HN,<p>I recently noticed that an YC company (Run ANywhere, W26) sent me the following email:<p>From: Aditya &lt;aditya@buildrunanywhere.org&gt;<p>Subject: Mikołaj, think you&#x27;d like this<p>[snip]<p>Hi Mikołaj,<p>I found your GitHub and thought you might like what we&#x27;re building.<p>[snip]<p>I have also received a deluge of similar emails from another AI company, Voice.AI (doesn&#x27;t seem to be YC affiliated). These emails indicate that those companies scrape people&#x27;s Github activity, and if they notice users contributing to repos in their field of business, send marketing emails to those users without receiving their consent. My guess is that they use commit metadata for this purpose. This includes recipients under the GDPR (AKA me).<p>I&#x27;ve sent complaints to both organizations, no response so far.<p>I have just contacted both Github and YC Ethics on this issue, I&#x27;ll update here if I get a response.",
      "is_ask_hn": false,
      "matched_keywords": [
        "purpose"
      ],
      "comments": [
        {
          "top": "Martin from GitHub here.  This type of behaviour is explicitly against the GitHub terms of service, when we catch the accounts doing this we can (and do) take action against those accounts including banning the accounts. It's a game of whack-a-mole for sure, and it's not just start-ups that take part in this sketchy behaviour to be honest. I've been plenty of examples in my time across the board.\nThe fundamental nature of Git makes this pretty easy for folks to scrape data from open source repositories.  It's against our terms of service and those folks might want to talk with some lawyers about doing it - but as every Git commit contains your name and email address in the commit data it's not technically difficult even if it is unethical.\nFrom the early days we've added features to help users anonymise their email addresses for commits posted to GitHub.  Basically, you configure your local Git client to use your 'no-reply' email address in commits and that still links back to your GitHub account when you push: \nhttps://docs.github.com/en/account-and-profile/reference/ema...\nI think that's still probably the best route. We want to keep open source data as open as possible, so I don't think locking down API's etc is the right route. We do throttle API requests and scraping traffic, but then again there have been plenty of posts here over the years from people annoyed at hitting those limits so it's definitely a balancing act. Love to know what folks here think though.",
          "author": "martinwoodward",
          "replies": [
            {
              "text": "> when we catch the accounts doing this we can (and do) take action against those accounts including banning the accounts.\nThis isn't my experience. I requested that you looked into a spammer in July 2025, you ignored my reply and the account is still active.\n----\nThank you so much for the report. We're sorry to hear you're receiving unwanted emails, but it's always a possibility when your public contact information is listed on the web. You can keep your email address private if you wish by following the steps here:\nSetting your commit email address\nWe do expect our users to comply with our Terms of Service, which prohibits transmitting using information from the GitHub (whether scraped, collected through our API, or obtained otherwise) for spamming purposes. I'm happy to look into it further to see if we can contact the reported user and let them know that this type of activity is not allowed.\nPlease let us know if you have any other questions or concerns.\n----\nMy reply which was ignored:\n----\nI understand it will happen from time to time. I'd rather be contactable (I've received legitimate emails today because my email is on my profile).\nPlease take further action. My email is public with the expectation that the ToS will be enforced. If GitHub isn't discouraging spammers then it makes it much harder to justify being contactable.\nAll the best,\nDavid",
              "author": "david_allison",
              "depth": 1
            },
            {
              "text": "I reported spammers ~5 times to GH, and every time the account went down in a couple of hours. Obviously mileage may vary, but I don't want the whole HN to think this process is completely broken.\nPlease keep reporting spammers, usually it works.",
              "author": "gettingoverit",
              "depth": 2
            },
            {
              "text": "To confirm: is this email spammers, or spam on GitHub?\nI've had decent success with on-GitHub action (I'd wager ~80% action taken), but the effort to report email spammers doesn't seem worthwhile.",
              "author": "david_allison",
              "depth": 3
            },
            {
              "text": "It's impossible for them to stop if you list your email on there. They could make it harder of course. But if you put your email out there for a human to find, then a script or bot or also find it.\nAnd yes of course they can also stop a specific spammer. But that spammer may pick up another account and email.",
              "author": "tom_m",
              "depth": 2
            },
            {
              "text": "The grandparent post wasn't asking for them to do the impossible and stop all spamming, only to take action against the particular user that spammed them.",
              "author": "angoragoats",
              "depth": 3
            }
          ]
        },
        {
          "top": "YC is a proud investor in Flock, what YC Ethics thing are you talking about?",
          "author": "scottydelta",
          "replies": [
            {
              "text": "And that Optifye.ai demo with the sweatshop surveillance software",
              "author": "otherayden",
              "depth": 1
            },
            {
              "text": "And Cluely",
              "author": "cassonmars",
              "depth": 1
            },
            {
              "text": "Cluely is not YC.",
              "author": "tasn",
              "depth": 2
            },
            {
              "text": "he might be thinking of chadIDE \"the first brainrot ide\"",
              "author": "fantasizr",
              "depth": 3
            },
            {
              "text": "the same Cluely that's on IG? I thought that was a fictional satire.",
              "author": "insane_dreamer",
              "depth": 2
            }
          ]
        },
        {
          "top": "I've spent a lot of my career marketing to developers, and spamming their GitHub account might be top 1 or 2 worst marketing tactics you can use.\nCold emailing rarely works by itself. Cold emailing \ndevelopers\n via emails you pulled from their GitHub accounts? At that point, you're actively harming your brand, and may as well just send them spam diet pill ads.",
          "author": "keiferski",
          "replies": [
            {
              "text": "If someone took the time to look through my GitHub contributions then pitched me with a job relevant to that work I would absolutely consider them. That's \nexactly\n the kind of recruiter I would like to work with.\nIf it's obviously just a bot scraping emails and sending generic job requests, that's very different.",
              "author": "RandallBrown",
              "depth": 1
            },
            {
              "text": "> If it's obviously just a bot scraping emails and sending generic job requests, that's very different.\nIt's not even that nice. They scrape emails and send cold calls to try to get you to purchase their services.",
              "author": "devmor",
              "depth": 2
            },
            {
              "text": "Yeah this - I got one of these emails someone sniffing around my GitHub not that long ago and it wasn't immediately obvious that it was a scammy recruiter, so I responded to sound out if they were actually interested in one of my projects. Got the same generic response about let's work together on something so I didn't respond.",
              "author": "jamesfinlayson",
              "depth": 2
            },
            {
              "text": "Yeah I mean as a marketing tactic to sell your product. An employer / recruiter offering you work this way is different.",
              "author": "keiferski",
              "depth": 2
            },
            {
              "text": "Find everyone who starred this repo and did a PR against these 10 repos is within reach of all marketers now. I just told them how.",
              "author": "genxy",
              "depth": 2
            }
          ]
        },
        {
          "top": "Ever wonder why YC has the \"Describe a time you most successfully hacked some system to your advantage\" question? It's because they select for founders that are willing to take advantage of legal gray areas. Airbnb repeatedly violated Craigslist terms of service and called it \"growth hacking.\" Reddit stole content from Digg and faked users. OpenAI trains their models on copyrighted content.",
          "author": "an0malous",
          "replies": []
        },
        {
          "top": "I also had unsolicited spam from Vincent Jiang of Aden, another YC company.\n    Hi Daniel,\n\n    I just came across your profile on social media and wondered if you'd be interested in joining our Discord community for AI agent development. Currently, we see that agents break, loop, get lost, hallucinate, and cost a fortune, and therefore built a space where developers can share challenges and insights.",
          "author": "unfunco",
          "replies": [
            {
              "text": "…and more from Backdrop.\n    Hi Daniel, I found your GitHub profile while searching for anthropic projects, and got your email from your profile.\n\n    I'm part of an online program for builders called Backdrop Build, and I think that program would be a great fit given what you are building. We have a track for builders in AI like you, it's fully online/remote and costs nothing to participate. It also works if you have a day job, it's light on time and perfect for side projects!\n\n\nAnd then another after I marked the first one as spam and ignored it.\n    Checking in one last time to see if you have any questions about the program or the application. If it's not for you, all good - just ignore the email because I won't be pinging you again :)\n\n   Joey from Backdrop\n\n\nBoth companies have guaranteed that I won't use their services nor procure them for any organisation I work for.",
              "author": "unfunco",
              "depth": 1
            },
            {
              "text": "Hey it's Joey checking in again. We noticed you mentioned our company, let me know if you have any questions about our (free!) program. I'll go ahead and email you some more info, just in case.",
              "author": "agmater",
              "depth": 2
            },
            {
              "text": "I had a similar one from that guy asking me to make open source PRs to some repo of theirs for, err, $25-50/hour. I replied explaining that senior software engineers in the UK aren’t \nquite\n as desperately poor as that, and got a canned response saying that they were looking forward to reviewing my PRs :D",
              "author": "foldr",
              "depth": 1
            },
            {
              "text": "Blows my mind that you guys are so expensive lol.",
              "author": "shunia_huang",
              "depth": 2
            },
            {
              "text": "SWE salaries in the UK are fairly unsurprising as they tend to be more or less in the range of other professional salaries. If they’re high from a worldwide point of view that’s just because most of us are in London and London is a high cost of living city.",
              "author": "foldr",
              "depth": 3
            }
          ]
        }
      ]
    },
    {
      "id": "47181380",
      "title": "The Pentagon is making a mistake by threatening Anthropic",
      "link": "https://www.understandingai.org/p/the-pentagon-is-making-a-mistake",
      "domain": "www.understandingai.org",
      "author": "speckx",
      "score": 253,
      "comment_count": 226,
      "created_ts": 1772204909,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "mistake"
      ],
      "comments": [
        {
          "top": "Use of the DPA can be litigated, and surely would be. Designation as a supply chain risk surely would be as well.\nThese court cases would produce bad outcomes either way. If the court finds for Anthropic, future DoD leadership will find itself constrained or at least chilled. Or if the court finds for the government, an expansive permissive view of the DPA might encourage future administrations to compel tech companies to make AIs break the law in other ways, for example by suppressing certain political points of view in output.\nNational defense is strongest if the military is extremely powerful but carefully judicious in the application of that power. That gives us the highest “top end” capability of performance. If military leadership insists on acting recklessly, then eventually guardrails are installed, with the result of a diminished ability to respond effectively to low-probability, high risk moments. One of many nuances and paradoxes the current political leadership does not seem to understand.",
          "author": "snowwrestler",
          "replies": [
            {
              "text": "> \nIf the court finds for Anthropic, future DoD leadership will find itself constrained or at least chilled\nSeems like a good outcome? The government should not be able to arbitrarily decide to make private citizens do things they aren't willing to do, whether the  government thinks the action is legal or not, and its especially egregious when the government knew about those limits ahead of time, spelled out in a fucking contract.",
              "author": "magicalist",
              "depth": 1
            },
            {
              "text": "The problem in this case is in fact the best part of our military. The civilian control. This isn't a general or admiral going insane. This is a politically motivated and appropriately assigned civilian. And that's the good part.\nThe bad part is the failure of the citizenry to elect moral and ethical politicians.",
              "author": "halJordan",
              "depth": 1
            }
          ]
        },
        {
          "top": "What’s interesting is Anthropic being singled out here.  That either means:\n1- OpenAI, Microsoft, Google, Amazon, etc have no problem with their products being used to kill people so no need to bully them.\n2- These other products are so terrible at the task that the clown shoe wearing SecDef is forced to try to bully Anthropic.",
          "author": "Eggpants",
          "replies": [
            {
              "text": "It's not either of those. Anthropic put a lot of effort into getting FedRAMP approved so the DOD could use them; they are now being punished for that, and the government at present has no other good options. Other options could of course be developed, but other vendors may question how unreliable and untrustworthy the current DOD leadership is as as customer.",
              "author": "mediaman",
              "depth": 1
            },
            {
              "text": "Seems like Microsoft/OpenAI [0] and Google [1] both have FedRAMP approval.\n[0] \nhttps://devblogs.microsoft.com/azuregov/azure-openai-fedramp...\n[1] \nhttps://cloud.google.com/blog/topics/public-sector/gemini-in...",
              "author": "ksymph",
              "depth": 2
            },
            {
              "text": "> untrustworthy the current DOD leadership is as as customer.\nLess than a year left on this clock.",
              "author": "SecretDreams",
              "depth": 2
            },
            {
              "text": "That seems quite optimistic. Or am I just that pessimistic?",
              "author": "dylan604",
              "depth": 3
            },
            {
              "text": "No, you are not overly pessimistic.\nTrump was impeached before and nothing happened.  He can continue to ignore congress.  I wouldn't be surprised if at this point he abolishes congress, and even jokes at a press conference saying \"I am the Senate\".",
              "author": "FrustratedMonky",
              "depth": 4
            }
          ]
        },
        {
          "top": "On the one hand it's fantastic that people are resisting and, if nothing else, raising awareness and buying time.\nOn the other hand, is autonomous war not obviously the endgame, given how quickly capabilities are increasing and that it simply does not require much intelligence (relatively speaking) to build something that points a gun at something and pulls a trigger?\nIt just needs one player to do it, so everyone has to be able to do it. I'd love to hear about different scenarios scenario.",
          "author": "jstummbillig",
          "replies": [
            {
              "text": "It's not that hard. DoD could find a contractor to do it. But Anthropic wants no part of it, and I get why.",
              "author": "ACCount37",
              "depth": 1
            },
            {
              "text": "I absolutely do get it, but if you assume that eventually (and by that I mean: very, very soon) somebody else will do it, in how far is this line of action simply opting out of having some say in all of it and taking responsibility for situation that you instrumented?\nAnd I am honestly not sure.\nIf your stance is \"well, this is something that should just not happen\" and also believe that is absolutely will happen, then what are you doing by saying \"but it won't be us, it will instead be other people (who were enabled and inspired by our work in unsurprising ways)\".\nOn the other hand, just the act of resisting could tip the scale in some incalculable and hopefully positive way.",
              "author": "jstummbillig",
              "depth": 2
            },
            {
              "text": "Yes - Anthropic _does_ incur business risk if their products are misused and this becomes a scandal. Legally the government may be in the clear to use the product, but that doesn’t mean Anthropic’s business is protected. Moral concerns aside, it’s their prerogative to decide not to take on a customer that may misuse their product in a way that might incur reputational harm.\nOr it was their prerogative, until the Trump administration. Now even private companies must bend the knee.",
              "author": "fcarraldo",
              "depth": 2
            },
            {
              "text": "> It just needs one player to do it, so everyone has to be able to do it.\nBusinesses stay out of potentially profitable market segments for various reasons, so I don't think everyone \nhas to\n be able to do it to survive.",
              "author": "stronglikedan",
              "depth": 1
            },
            {
              "text": "We are constantly told how the board has a fiduciary responsibility to make investors money to overrule these \nvarious\n reasons.",
              "author": "dylan604",
              "depth": 2
            }
          ]
        },
        {
          "top": "> Dario Amodei published an essay warning about potential dangers from powerful AI — including domestic mass surveillance (which he brands “entirely illegitimate”)\nWhy is only domestic surveillance by an AI dangerous? I guess Europeans are not worth protecting from the dangers of AI?",
          "author": "CrossVR",
          "replies": [
            {
              "text": "Shouldn't this be decided by the domestic populations in europe or elsewhere?",
              "author": "627467",
              "depth": 1
            }
          ]
        },
        {
          "top": "Related ongoing thread:\nStatement from Dario Amodei on our discussions with the Department of War\n - \nhttps://news.ycombinator.com/item?id=47173121\n - Feb 2026 (1405 comments)",
          "author": "dang",
          "replies": []
        }
      ]
    },
    {
      "id": "47182387",
      "title": "Show HN: Claude-File-Recovery, recover files from your ~/.claude sessions",
      "link": "https://github.com/hjtenklooster/claude-file-recovery",
      "domain": "github.com",
      "author": "rikk3rt",
      "score": 93,
      "comment_count": 39,
      "created_ts": 1772209582,
      "is_internal": false,
      "post_text": "Claude Code deleted my research and plan markdown files and informed me: “I accidentally rm -rf&#x27;d real directories in my Obsidian vault through a symlink it didn&#x27;t realize was there: I made a mistake. “<p>Unfortunately the backup of my documentation accidentally hadn’t run for a month. So I built claude-file-recovery, a CLI-tool and TUI that is able to extract your files from your ~&#x2F;.claude session history and thankfully I was able to recover my files. It&#x27;s able to extract any file that Claude Code ever read, edited or wrote. I hope you will never need it, but you can find it on my GitHub and pip. Note: It can recover an earlier version of a file at a certain point in time.<p>pip install claude-file-recovery",
      "is_ask_hn": false,
      "matched_keywords": [
        "pip",
        "mistake"
      ],
      "comments": [
        {
          "top": "Claude Code by default auto-deletes local chat/session logs after 30 days, so the claim that this tool can recover \"any file Claude Code ever read/edited/wrote\" is only true within that retention window unless you've explicitly changed the settings (\"cleanupPeriodDays\", see [1])\nSpeaking as someone who's derived a lot of value from these logs, it's a bit shocking that the default is to wipe them automatically!\n[1] \nhttps://simonwillison.net/2025/Oct/22/claude-code-logs/",
          "author": "aragonite",
          "replies": [
            {
              "text": "good to know. im thinking about making an mcp tool/skill for searching them, and i guess that same tool should be archiving them properly too",
              "author": "8note",
              "depth": 1
            },
            {
              "text": "Yes, as soon as I noticed that I changed that setting to 9999 days. Luckily enough I still was in that 30 day window. But true, the retention window is a factor for chances of recovery indeed.",
              "author": "rikk3rt",
              "depth": 1
            },
            {
              "text": "Wow I had been trying to find an old session for quite some time, thanks for this.",
              "author": "hrimfaxi",
              "depth": 1
            }
          ]
        },
        {
          "top": "I had this happen yesterday to me, and Claude itself was able to recover it via the other conversations... I just had to tell it that it did the work and to find it in its other conversations.",
          "author": "gkoberger",
          "replies": [
            {
              "text": "I considered doing that, but my 80+ files were scattered in over 20 large conversations, It would've been too annoying to keep track of which file was extracted, and probably would have exhausted the context window of a chat in no-time.",
              "author": "rikk3rt",
              "depth": 1
            }
          ]
        },
        {
          "top": "Starred.\nI am looking to that exact concept - for a different mean - to develop my agent orchestration hobby project.\nLLM working in a «feature folder» where it stores change-logs, documentation, summaries, requirements, attachments, and so on. What I will be looking into very soon, is also storing the session id, for summarisation, history context, and so on.\nI will definitely steal some concept from your project.",
          "author": "tacone",
          "replies": [
            {
              "text": "Glad it might be of use to you, but for your project, that case, a project from someone else (\nhttps://github.com/matt1398/claude-devtools\n) might be able to give you even more for inspiration :). Good luck with your project!",
              "author": "rikk3rt",
              "depth": 1
            }
          ]
        },
        {
          "top": "Warning; Self Promo\nWe posted show the same day to solve the similar problems.\nMy solution \nhttps://news.ycombinator.com/item?id=47172238\n (unfucked.ai) works with any agent and any file in the folder whether it's edited by the agent or anyone by tracking all file writes.\nAmazing how this problem was top of mind for all of us at the same time!",
          "author": "cyrusradfar",
          "replies": [
            {
              "text": "That same concept utilizing a cow filesystem would be neat I think, you'd be able to skip your hashing and replace the sqlite with hardlinks, effectively versioning passively whenever something was written to\nBut now that I think about it, its too obvious not to exist already. Probably just dont know about it yet •́     ‿   , •̀",
              "author": "ffsm8",
              "depth": 1
            },
            {
              "text": "Sweet, that’s a funny timing indeed. Do I read correctly that you will need to have unf running before an ‘accidental removal’ happens?",
              "author": "rikk3rt",
              "depth": 1
            },
            {
              "text": "Good project, nice presentation, absolutely terrible name and branding",
              "author": "altmanaltman",
              "depth": 1
            }
          ]
        },
        {
          "top": "Could snapshots via tmutil be used to protect against this kind of thing on MacOS?\nhttps://derflounder.wordpress.com/2019/05/08/creating-managi...",
          "author": "TheKnack",
          "replies": [
            {
              "text": "Probably, claude-file-recovery can also help you if you did not set it up, as sort of a last resort. But it's often a good idea to have your files backed up one way or another yes, I was just unaware that my backup hadn't run in a while.",
              "author": "rikk3rt",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47201629",
      "title": "HN is drowning in AI comments",
      "link": "https://news.ycombinator.com/item?id=47201629",
      "domain": "news.ycombinator.com",
      "author": "waygtdai",
      "score": 57,
      "comment_count": 47,
      "created_ts": 1772321219,
      "is_internal": true,
      "post_text": "Dang, any updates on how you and the team were thinking of tackling this? It’s getting ridiculous. Last week was sort of okay but it’s much worse this weekend.<p>Edit: This spiked on front page and now it’s completely gone. What is going on?<p>Great. Flagged.",
      "is_ask_hn": false,
      "matched_keywords": [
        "team"
      ],
      "comments": [
        {
          "top": "I've read HN almost everyday for about 10 years. Maybe I'm naive, but I don't see it. I see way more folks complaining that comments are AI generated.",
          "author": "Hnrobert42",
          "replies": [
            {
              "text": "Yeah, the up/down voting mechanism seems to be doing it's job for me too. Don't think I've noticed a degradation in, say, the top third of comments. That's where I try to live anyway.\n/newest is chock full of submissions that were written by AI, though. That's another, broader problem.",
              "author": "kylecazar",
              "depth": 1
            },
            {
              "text": "To add to the collection of anecdata, your experience is similar to mine.  I have been more exhausted recently by the complaints of AI submissions and pseudo analysis of AI comments than exhausted by the supposed AI generated comments themselves.",
              "author": "brg",
              "depth": 1
            },
            {
              "text": "I've been using HN since 2008 when I created my first account[1] and I use HN differently than most people. I have a group of bookmarked searches that I visit almost daily that relate to technologies that interest me, such as Emacs.\nIn the past year, the searches I perform that relate to web development show a horrifying increase in the amount of Show HN posts that are posted by new accounts, include AI generated descriptions and point to AI generated projects on GitHub.\nIn 2024, there were 17,661 Show HN posts.[2] In the past year, there have been over 448,000 Show HN posts![3] And of course, most of these posts are AI generated.\nAlso, if you check the new accounts posting all this AI slop, you'll see that some of them also post AI generated comments in other threads, which is the main problem.\nBut for me, what is even more annoying is the enormous increase in new accounts created by nontechnical vibecoders who now think of themselves as technologists and who post worthless, ignorant comments that actually get upvoted, presumably by similar folks who have unfortunately been creating accounts at HN in the past 10 years or so.\nAs a result, 2026 is the first year in which I visit HN about once a week instead of about once a day.\n[1] \nhttps://news.ycombinator.com/user?id=zartan\n[2] \nhttps://hn.algolia.com/?query=%22Show+HN%22&dateRange=custom...\n[3] \nhttps://hn.algolia.com/?query=%22Show+HN%22&dateRange=pastYe...",
              "author": "subsection1h",
              "depth": 1
            },
            {
              "text": "The fact that this discussion was flagged might be the final nail in the coffin for me. The huge increase in AI generated comments and posts at HN is a topic that has been discussed on other forums for months now. Complaints include \"Orange Reddit\", \"Orange LinkedIn\", etc. But when the topic comes up at HN, it gets flagged. Fuck this.",
              "author": "subsection1h",
              "depth": 2
            },
            {
              "text": "There are a lot, but they tend to get heavily downvoted and end up hidden",
              "author": "AstroBen",
              "depth": 1
            }
          ]
        },
        {
          "top": "No, not HN, the internet at large.\nNow, I'm on vacation this week and not been paying too much attention,  but whenever you have a geopolitical event like the little extravaganza in Iran the number of bot like posts tends to explode as influence operators make their moves.",
          "author": "pixl97",
          "replies": [
            {
              "text": "The public facing internet is done. HN has been fairly resilient (I think) but even it is beginning to buckle. It’s been sliding for a while but LLMs are the death knell.\nIt was a fun 2 decades. Time to stick to private discords and real life friends from here on out, though.",
              "author": "WD-42",
              "depth": 1
            },
            {
              "text": "I don’t think HN is any more resilient. The new account captcha is fairly tame and, while I’m sure they have proxy detectors and other things in place, it doesn’t stop new accounts from posting and getting traction.\nSomeone suggested earlier this week that an invite system should be implemented (I think lobsters has it?) I doubt it would fly here, but yeah.",
              "author": "waygtdai",
              "depth": 2
            },
            {
              "text": "It's the community moderation that keeps HN resilient, i.e. many-humans-in-the-loop",
              "author": "verdverm",
              "depth": 3
            }
          ]
        },
        {
          "top": "I wonder what the breakdown is between AI-generated comments and AI-assisted comments. If I write anything substantial, I run it through the following prompt: \"Please rewrite the following message for clarity, spelling, and grammar, but only return the revised text without any additional commentary.\"",
          "author": "schappim",
          "replies": [
            {
              "text": "Articulateness is a decent (not perfect) signal for intelligence, which is a decent (not perfect) signal for sound ideas. In a sea of online garbage, it was a quick and easy way to discard that not worth reading. Nowadays, a whiff of AI's brand of articulateness tells me the author couldn't manage on their own, either due to skill or discipline. In either case, the result is the same: close tab / scroll past.",
              "author": "000ooo000",
              "depth": 1
            },
            {
              "text": "Use a local model such as Gemma3 with a prompt such as \n\"strictly limit changes only to spelling issues, syntactical errors, and punctuation.\"\nThat way, it's basically functioning like Grammarly on steroids. Asking an LLM for a \"rewrite\" is basically dissolving your writing style into the homogenized gloop.",
              "author": "vunderba",
              "depth": 1
            },
            {
              "text": "I understand this if you’re not a native speaker. But if you are, I think this will generally make you sound wooden.",
              "author": "WoodenChair",
              "depth": 1
            },
            {
              "text": "To be fair, comments here are graded on kindness, civility, curiosity, intellectual gravity, technical merit, novelty, thoughtfulness, substantiveness, objective fact, not fulminating, not cross examining, steelmanning vs strawmanning, not containing memes, not containing humor, not expressing positive emotion, not expressing negative emotion, not being snarky, sneering, overly cynical, not cynical enough, being \"curmudgeonly\", class bias, political bias, religious bias, cultural bias, not using \"flamewar style\" and many other heuristics.\nIf you followed all of the guidelines for comments to the letter, you would wind up sounding wooden, if not entirely like an AI.",
              "author": "krapp",
              "depth": 2
            },
            {
              "text": "Perplexity did this to your response. I'm not sure that correcting grammar and changing one word makes it sound wooden.\n\"I understand this if you’re not a native speaker, but if you are, it will generally make you sound a bit unnatural.\"",
              "author": "readthenotes1",
              "depth": 2
            }
          ]
        },
        {
          "top": "Can you point out any that you feel were written by LLM? I can't say I've noticed anything out of the ordinary lately.",
          "author": "A_D_E_P_T",
          "replies": [
            {
              "text": "There was a bot trying to sell beds I saw the other day.\nLikely flagged quickly but they might show up in these stats.\nhttps://news.ycombinator.com/from?site=dreamhomestore.co.uk",
              "author": "ZeroGravitas",
              "depth": 1
            },
            {
              "text": "I agree. Looks like spam with many posts. Dang/tomhow would love to get an email about it hn@ycombinator.com",
              "author": "gus_massa",
              "depth": 2
            },
            {
              "text": "You can find some on pretty much every article by turning on showdead and scrolling to the bottom of the page.   I can't see how those are a problem though.",
              "author": "bryanlarsen",
              "depth": 1
            },
            {
              "text": "check out Show HN, in particular /shownew, though they are starting to make non-show posts now",
              "author": "verdverm",
              "depth": 1
            }
          ]
        },
        {
          "top": "For a better chance of reply email hn@ycombinator.com.",
          "author": "Bender",
          "replies": []
        }
      ]
    },
    {
      "id": "47153207",
      "title": "Ask HN: Who Is Using XMPP?",
      "link": "https://news.ycombinator.com/item?id=47153207",
      "domain": "news.ycombinator.com",
      "author": "nunobrito",
      "score": 23,
      "comment_count": 11,
      "created_ts": 1772034821,
      "is_internal": true,
      "post_text": "Hello,<p>Are you using XMPP?<p>If so, what are your favorite servers to connect?",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "I was I heavy XMPP user back in the 00s. But on the whole it never really took off, and when Google killed XMPP support in their chat it was a severe blow. As for why it didn’t reach a larger userbase, I think the reasons that Moxie described in \nThe ecosystem is moving\n[0] are spot on.\n[0] \nhttps://signal.org/blog/the-ecosystem-is-moving/",
          "author": "cpach",
          "replies": []
        },
        {
          "top": "I use JMP.chat[0] for my primary phone number.  Being able to text from my PC with a real keyboard is very convenient.  If I ever bite the bullet and use Discord I want to set up Slidcord[1] so that I don't have to use a separate app.  I'm still figuring out how to migrate people to XMPP natively.\n[0]: \nhttps://jmp.chat\n\n[1]: \nhttps://slidge.im/docs/slidcord/main",
          "author": "MarsIronPI",
          "replies": [
            {
              "text": "Doesn't Discord require every user to create a new account, even if they're already using Discord in some other community?  So when they say \"a Discord server\", they really mean it--they're like droplets running independent deployments or whatever (albeit managed/hosted instances run by and upgraded by Discord the company); not like subreddits, right?\nSo isn't the best way to migrate people to XMPP to prop up a Discord clone that's as close a copy as the Discord-clone community can manage, and then tell all the people \"Join my Discord server\", with the trick being that it's really \nyour\n server, not Discord's, and that server is powered by XMPP?",
              "author": "pwdisswordfishy",
              "depth": 1
            },
            {
              "text": "> Doesn't Discord require every user to create a new account, even if they're already using Discord in some other community? So when they say \"a Discord server\", they really mean it--they're like droplets running independent deployments or whatever (albeit managed/hosted instances run by and upgraded by Discord the company); not like subreddits, right?\nNo, it works exactly like subreddits.  One of the major lock-ins Discord has is that all the communities are there, and people access them all with one account and one app.  It's very convenient, which, as RMS says, is a bad thing when it comes to proprietary software.",
              "author": "MarsIronPI",
              "depth": 2
            },
            {
              "text": ">Doesn't Discord require every user to create a new account, even if they're already using Discord in some other community?\nNo, the same account is used. You get prompted to choose a nickname each time you join a server though.\n>So when they say \"a Discord server\", they really mean it--they're like droplets running independent deployments or whatever\nNo, they're probably all run on the same compute. The \"official\" name for a discord server from the API documentation is actually a \"discord guild\" and it works pretty much like a subreddit.",
              "author": "ycombinatrix",
              "depth": 2
            }
          ]
        },
        {
          "top": "Last week I selfhosted Snikket: \nhttps://snikket.org\n, me and my partner use it to text. It has been smooth, everything works without issue: read receipts, audio/video calls, status.",
          "author": "0x5FC3",
          "replies": []
        },
        {
          "top": "Several years ago I put up an XMPP server (Prosody) to chat with some friends in a private group, and it's still going strong. Years ago we used to have a mailing-list to keep in touch, but that eventually went quiet. I had run an XMPP server ~10 years ago (ejabberd), but that was before mobile chat utterly displaced everything else, it never took hold among my friends, and I stopped using it when Google Talk stopped federating, cutting me off from most of the people I had been occassionally chatting with.\nThe modern chat experience is all about the clients, and the mobile clients in particular, especially push notification support and seamless setup, so direct comparisons with XMPP to Matrix, et al, kinda misses the point, IMO. Conversations is a really amazing Android client. Our one iPhone member is content with Modal (I use the desktop version sometimes, but it's clearly designed for the iPhone). A new member uses, I think, Gajim on Windows; they don't want the distraction of chatting on their phone.\nI host a bunch of other services on OpenBSD, all using the integrated base daemons--httpd, OpenSMTPD, NSD, etc--that sandbox themselves. I was hesitant to run a daemon like Prosody that didn't integrate OpenBSD security features, so I wrote my own module (mod_unveil) that uses pledge and unveil to sandbox Prosody: \nhttps://github.com/wahern/prosody-openbsd\n Most Prosody users host on Linux, and many of them seem to use Docker containers, which presumably offers some isolation, but I can't really speak to it.\nThe only non-private, large group chat I've joined recently has been the Prosody support MUC. I'm not a chat power user, but it seems to work just as well as any large chatroom. I've was content with ntalk and IRC back in the day, so I don't really get all the chat protocol bike shedding. In any event, I expect XMPP momentum (such as it is) to outlast all the interest in Discord, Matrix, etc.",
          "author": "wahern",
          "replies": []
        },
        {
          "top": "I use Gajim which is a linux desktop implementation of XMPP.",
          "author": "ekjhgkejhgk",
          "replies": []
        }
      ]
    },
    {
      "id": "47160641",
      "title": "Ask HN: What's it like working in big tech recently with all the AI tools?",
      "link": "https://news.ycombinator.com/item?id=47160641",
      "domain": "news.ycombinator.com",
      "author": "ex-aws-dude",
      "score": 22,
      "comment_count": 11,
      "created_ts": 1772069350,
      "is_internal": true,
      "post_text": "Curious to hear how have things changed day-to-day with the recent push to use AI coding tools.<p>Have you noticed faster pace of development?<p>Have you seen changes to code quality or code review?<p>Do teammates that use these tools complete sprint tasks faster than those who don&#x27;t?",
      "is_ask_hn": true,
      "matched_keywords": [
        "big tech"
      ],
      "comments": [
        {
          "top": "Working in big tech right now feels like being a pilot on autopilot. AI tools like Copilot and Cursor have definitely removed the \"syntax friction,\" but they’ve added a massive \"architectural burden.\" We are spending less time writing boilerplate and much more time debugging complex RAG pipelines and agentic workflows.\n The real challenge isn't the code generation itself; it's the integration and knowing where the AI's \"hallucination boundary\" lies. I’ve noticed that engineers who don’t master the underlying ecosystems (especially the Python/AI stack) are the ones struggling most with the transition.\n I recently did a deep dive into why Python’s ecosystem is still the critical \"glue\" for AI innovation in 2026, despite the rise of newer languages. It might add some context to this discussion: \nhttps://codebit-daily.hashnode.dev/why-python-is-still-the-k...",
          "author": "CodeBit26",
          "replies": []
        },
        {
          "top": "i recently joined a new company.\nusing ai coding assistants has allowed me to onboard faster because i can take a new ticket and ask the agent to help orient me in the codebase about where to start looking.\nBUT the downside is that i'm much slower at building a cohesive mental model of the codebase. this has two problems:\n- it encourages continued dependence on the ai tools because its hard to fall back on my own knowledge\n- imposter syndrome is magnified 100x",
          "author": "parpfish",
          "replies": []
        },
        {
          "top": "I work for a $20 billion tech company (not a big tech company, but not a small one either). Our company strongly encourages us to incorporate agentic tools like Claude Code and Codex into our daily routines. Management has made it easy to use Anthropic and OpenAI products with an enterprise subscription. I can sense that our business leaders want us to move more swiftly and be more productive to avoid falling behind in the AI race.\nMy team has adopted Claude Code extensively, and the number of daily and weekly PRs we have closed has increased significantly. I’ve noticed that we’re also more willing to commit to more projects. My team benefits from most of our code being written in TypeScript. However, some other teams with legacy code bases seem to have a bit of a harder time using these tools compared to us.\nOne thing that surprises me with a AI is you can have people working on the same code base. Some can be very effective with AI, yet there are others working on the exact same code base who cannot get good results. Some people don’t really seem to be taking the time to get good at writing prompts and plans before having agents execute on them.",
          "author": "cebert",
          "replies": [
            {
              "text": "Your experiences reflect mine.\nMy employer has a slack channel where we can share prompts, tips about how to use AI outside of coding, Q&A. I've learned a lot from my coworkers there.",
              "author": "rithdmc",
              "depth": 1
            }
          ]
        },
        {
          "top": "I work for a $50B+ company (is this big tech? idk), but I’ll answer this because we are fully embracing AI (Cursor, Claude Code, cloud agents, AI reviews, you name it)\n> Have you noticed faster pace of development?\nYes, our org has had a 50% increase in PRs since Opus 4.5 released.\n> Have you seen changes to code quality or code review?\nYes, significantly more bugs (no exact number), but consider it maybe 3-4x in volume. However, nothing catastrophic and everyone just uses AI for fast-follow fixes anyways. The company as a whole is embracing this style of development for better or worse.\n> Do teammates that use these tools complete sprint tasks faster than those who don't?\nYes, but my entire team uses them. I’d say the ones who use it more effectively (crazy skill setups, better tooling/commands, better scaffolding) finish much faster. Probably 80% of my team still uses Cursor in the one-shot way with very vague requirements, and don’t have the AI connected to github, jira, slack, etc which can actually feed really important context into decision making.\nIf I do something more than once a day, I write a custom slash command for it. This has personally 2x’d my pace.",
          "author": "with",
          "replies": []
        },
        {
          "top": "I work in big-tech and we’re only allowed to use our companies internal tools that mimic Claude Code etc. There is certainly a push to use it, and I’ve noticed a significant increase in bugs that have come along. There are so many PRs now that no one reviews them and just slaps a LGTM. Specifically with junior or less strong engineers. It’s like they don’t code anymore and push everything on the AI and say ship it without a second thought. I’ve watched engineers push AI code with a nasty NPE and then they also had it write unit tests where the AI caught the NPE and passed the test. Literally if anyone spent the time reading the code you’d see it was a ticking bomb. We went from production breakages every couple of months to every couple of days.\n It’s so bad but no one is saying the hard thing that less strong engineers need to be restricted on their use of these tools.",
          "author": "aeriose",
          "replies": []
        }
      ]
    },
    {
      "id": "47196263",
      "title": "Is GitHub Copilot still relevant in the enterprise?",
      "link": "https://news.ycombinator.com/item?id=47196263",
      "domain": "news.ycombinator.com",
      "author": "AznHisoka",
      "score": 21,
      "comment_count": 22,
      "created_ts": 1772291708,
      "is_internal": true,
      "post_text": "It used to be the default choice for companies a few years ago, and now I dont hear many people using it. Does anyone still use it here or have you gone over to Claude Code&#x2F;Codex&#x2F;devin&#x2F;cursor?",
      "is_ask_hn": false,
      "matched_keywords": [
        "enterprise"
      ],
      "comments": [
        {
          "top": "GitHub Copilot is the only AI we’re allowed to use where I work.\nI don’t use it heavily. I had to turn off the auto-suggestions, because they were almost always wrong, and the hijack the tab key, which makes writing my hand painful (having to hit escape before every tab). I tried looking for a way to change the keybinding a year ago, but it didn’t seem possible.\nI will occasionally use the Ask sidebar to see if it gives me some good options or for a quick syntax lookup. That’s about it.\nIt got Agent mode recently, which it defaults to. When this first happened, I went to ask a question and the agent just started doing stuff and destroyed my code in a way that undo didn’t fix. I had to go back to the commit history and make some manual changes to get back to where I was. I never used the agent again.\nThere has been some talk about getting Claude Code, but the problem is that it takes so long to make these enterprise deals and get something rolled out, that there is something new by the time we get the last new thing deployed. The pace of evolution in this space is faster than the enterprise moves.\nI can only assume that when the next model releases, people will say the current Claude Code isn’t very good… so I’m probably not missing much in real terms. It kind of reminds me of video game graphics. The bleeding edge of the current-gen is always talked about as if its photo realistic and so amazing… then looking back at the same game 10 years later, and it looks like trash compared to the new bleeding edge. So maybe it’s not worth getting so worked up.",
          "author": "al_borland",
          "replies": [
            {
              "text": "Yeah, this is exactly why you see all these surveys saying that AI hasn't given any increase in productivity. Especially when GitHub Copilot is still the #1 AI coding tool.\nPeople were sold a spoon, get a spork, and end up eating with their hands.",
              "author": "muzani",
              "depth": 1
            },
            {
              "text": "Skill issue\nThere is actually Claude code integrated into gh copilot.\nYou can also access opus 4.6 and codex 5.3 in it, which work pretty well in agentic mode.",
              "author": "kken",
              "depth": 1
            },
            {
              "text": "No, those are the models. They are NOT the same as Claude code/codex.\nGitHub copilot agent mode is quite bad, and advanced premium models like opus4.6/codex 5.3 are making it barely usable.\nClaude code and codex are night and day comparatively.\nAdditionally, GitHub copilot admins can enable/disable models. Each model has different ToS, so perhaps their admin has not turned it on.\nI would suggest you not immediately insult people with ad hominem attacks.",
              "author": "Atotalnoob",
              "depth": 2
            },
            {
              "text": "Copliot is quite bad out of the box, but it does work with opencode, which I found to be as good a harness as claude code, and a better tool overall.",
              "author": "lbreakjai",
              "depth": 3
            },
            {
              "text": "Wait really? I thought the models were basically the same with a wrapper.\nWhat about warp, is that also just a wrapper?",
              "author": "taurath",
              "depth": 3
            }
          ]
        },
        {
          "top": "Copilot is definitely still relevant, but the \"honeymoon phase\" where we just accepted every suggestion is over. In an enterprise setting, it’s becoming more of a boilerplate killer than a logic generator. The real value now is how these tools integrate with existing libraries. If you're not deeply familiar with the core stack (like the Python/AI libraries we use daily), Copilot can actually lead you into some pretty expensive technical debt. I did a deep dive on why Python’s dominance in AI is what actually makes these tools useful in the first place: \nhttps://codebit-daily.hashnode.dev/why-python-is-still-the-k...",
          "author": "CodeBit26",
          "replies": []
        },
        {
          "top": "It has the best integration with Visual Studio, and it is incredible value for money on the $10/mo plan. I used it for all my legacy WinForms app work.",
          "author": "qingcharles",
          "replies": []
        },
        {
          "top": "At my work we can use only copilot. The rest of the tools is currently in pilot stage and under review. And no github cloud copilot.\nIn the recent rise of agents orchestration we're looking into moving towards more automated agentic setup. But while waiting, I decided to take max out of the copilot. Turned out, both copilot cli and VSCode one were lacking in agentic capabilities.\nFortunately OpenCode exists and it allows to officially connect to copilot account. So we were allowed to use it. OpenCode allows more granular control over what is available to the model, what specific model to use, etc. It filled missing gaps so we're now experimenting creating agentic flows.\nAdditionally, you can connect a local model in OpenCode. So if you have a beefy mac or pc, Qwen Coder may be interesting for you.",
          "author": "zihotki",
          "replies": []
        },
        {
          "top": "We still use it. Its integration in VSCode makes it very easy to use. We can select which model to use, and Claude’s are the best in my opinion.",
          "author": "acadavid79",
          "replies": [
            {
              "text": "I think I’m seeing fallout of Microsoft’s notoriously horrific branding and marketing, again?\nSome people seem to be talking about the VS(C) extension/feature, the paid llm service from GitHub, or both?\n“X bone X \nis\n your PC!” vibes, anyone?",
              "author": "dd8601fn",
              "depth": 1
            },
            {
              "text": "Or are we talking about Microsoft Word?",
              "author": "idontwantthis",
              "depth": 2
            }
          ]
        }
      ]
    },
    {
      "id": "47199917",
      "title": "Tell HN: My daily game won a Players Choice Award",
      "link": "https://news.ycombinator.com/item?id=47199917",
      "domain": "news.ycombinator.com",
      "author": "paulhebert",
      "score": 12,
      "comment_count": 2,
      "created_ts": 1772310714,
      "is_internal": true,
      "post_text": "I&#x27;ve shared my game Tiled Words a few times in &quot;What are you working on&quot; threads and as a Show HN.<p>I wanted to share with y&#x27;all that today it won the Players&#x27; Choice Award at the 2025 Playlin Daily Game Awards!<p>It was also runner up for Best Word Game and a finalist for Best Classic Game Reimagined and Best Visual Design.<p>Thanks to everyone herewho commented or played. Your feedback and encouragement has made Tiled Words the game it is today. I designed and developed the game and make the puzzles with my wife. We would have stopped long ago if not for the positive feedback from the community.<p>Playlin is a really cool organization and all of the winners are fantastic games that you should try: https:&#x2F;&#x2F;playlin.io&#x2F;awards&#x2F;winners<p>And if you haven&#x27;t played Tiled Words yet, give it a try here: https:&#x2F;&#x2F;\ntiledwords.com",
      "is_ask_hn": false,
      "matched_keywords": [
        "feedback"
      ],
      "comments": [
        {
          "top": "Congratulations! Well deserved. I typically loathe daily puzzle games (I don’t want to have to come back every day, I just want to play a few rounds; you at least have the backlog always accessible) but Tiled Words kept me coming back for a while and I shared it with friends. The game is fun and the interaction is delightful, which was a big part of what made it stick for me.",
          "author": "latexr",
          "replies": [
            {
              "text": "Thanks! I’m glad you like it.\nIt’s funny: I didn’t originally plan to make a daily game (or a word game for that matter.) But after prototyping a few different game concepts this was the game and format that worked best! So here I am with a daily word game haha",
              "author": "paulhebert",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47178029",
      "title": "36yo: Career at home vs. Simple life abroad?",
      "link": "https://news.ycombinator.com/item?id=47178029",
      "domain": "news.ycombinator.com",
      "author": "Slaboli",
      "score": 12,
      "comment_count": 34,
      "created_ts": 1772180700,
      "is_internal": true,
      "post_text": "I am 36 years old, single, and currently unemployed, living with my parents in my home country. I am at a point that might define the next decade of my life. I am struggling with a choice between two paths that offer completely different types of security.<p>Option A: Relocating to Southern Europe (Portugal)<p>The Income: A low-skill remote role (Content Analysis) with night shifts (PST hours), paying ~1100 EUR. I also have some passive income to supplement this.<p>The Lifestyle: Living in a studio or small apartmentin in smallish Portuguese town. For around 800 EUR.<p>The Perspective: The move isn&#x27;t about a specific career goal or a passport; it’s about the higher life standards, safety, and the stable social environment of Western Europe.<p>The Trade-off: I would be far from my aging parents. I would be working an unskilled job that doesn&#x27;t build professional equity, potentially living in studio at 36, which might be isolating during night shifts.<p>Option B: Staying in my Home Country (Ankara, Turkey)<p>The Job &amp; Security: A Finance&#x2F;Accounting role for a SME. I own my apartment here, so I have no housing costs.<p>The Professional Play: Pursuing a CPA-equivalent certification. This is a 3-year commitment of internships and exams, leading to legal signing authority and the ability to open my own practice later on with adaquate experience and networks.<p>The Context: Turkey is facing economic instability, high inflation, and politically unsettling.<p>The Trade-off: While I would be near my parents and building a protected professional title, I would be staying in a high-stress, unpredictable environment.<p>The Financial Weight:<p>I have already spent roughly 10k EUR on the relocation process for Option A (visas, consultants, etc.).<p>The Dilemma:<p>One path offers a prestigious, recession-proof career in a struggling, unstable country. The other offers a simple, comfortable life with &#x27;okay&#x27; standards in a stable country, but with no professional growth.<p>At 36, is it wiser to invest 3 years in a professional license to root myself, or to take the jump for a better quality of life even if the work is menial?<p>What would you do?<p>THANK YOU!",
      "is_ask_hn": false,
      "matched_keywords": [
        "equity",
        "career",
        "remote"
      ],
      "comments": [
        {
          "top": "These kinds of multivariate decisions are extremely hard and what decision support systems were designed to work with. Typically you construct a model with all the qualitative questions, and a process which weighs each of them against each other drives something like a weighted centroid outcome.\nThe problem with asking strangers is the lack of investment and consequences to decisions. So if I say Portugal it has zero context to how your emotions will cope with e.g. sudden deterioration of your parents health, or racism, or language issues. If I say turkey it's based on outsider sense of place as a visitor with no exposure to the political risk.\nDecision support is part of operations research. A good oversight (obviously they push their own model but they explain a lot of the systems)\nhttps://www.1000minds.com/decision-making/what-is-mcdm-mcda\nfor context I made the decision to up sticks and move to another economy in my late 20s almost 4 decades ago and have never regretted it but it does carry bitter pills, breaking of links, parental death and related family tensions, emotional turmoil. Nothing is easy, but my path was easier than yours given the same language both points of my migration journey, and a different world economy",
          "author": "ggm",
          "replies": [
            {
              "text": "Thank you for the perspective. You’re right that strangers lack the emotional context. I think my paralysis comes from over-optimizing the variables and ignoring the 'bitter pills' you mentioned. I am currently trying to build an MCDM model as you suggested, but I find myself biased toward weighting 'safety' vs 'career stability' differently every day. Did you find that your priorities changed once you actually arrived at your new destination, or did your initial weighting hold true over the decades?",
              "author": "Slaboli",
              "depth": 1
            },
            {
              "text": "My priorities changed massively, as I partnered up with a local.\nMy weightings definitely changed. One thing to bear in mind is that legalisms in migration often penalise age. It is possible your window to migrate is closing.\nAlso, your asset in Turkey may be an income stream. AirBnB?",
              "author": "ggm",
              "depth": 2
            },
            {
              "text": "Yeah, I receive rent from the apartment in Turkey. I also have some savings and similar income streams. They’re not amounts that make me rich, but they make me more or less comfortable. I live above average in my hometown. I worked in humanitarian aid NGOs for years, but with funding cuts, jobs are extinct.\nI also want to start my own family (by finding someone first lol), so I have lots of conflicting criteria, which makes it difficult to come to a decision. Trying Portugal seems logical at first, but then again I ask myself how many years I would live with such (entry level basic) job opportunities and whether I would regret not being a CPA at age 50, for example. Thank you man!",
              "author": "Slaboli",
              "depth": 3
            }
          ]
        },
        {
          "top": "I wouldn't do the Portugal option unless you have a path toward it growing in the future. Otherwise you may find yourself at age 46, making 1500 euros a month, and basically unable to actually set yourself up for a life.\nMaybe that means getting citizenship in 5-7 years, then moving elsewhere in the EU. Maybe it means something else.\nIn your situation, I would probably stay in Turkey and build up a career / wealth, with the specific point of picking something that's portable. Not sure if Turkish CPA requirements are portable, or how well they convert to EU/USA/etc. standards. Then in 5-10 years, think about moving to the West, if you still desire to do so.\nThe money you've invested now is a sunk cost and is irrelevant in the long term.",
          "author": "keiferski",
          "replies": [
            {
              "text": "Thanks for your comment! You’re right that Portugal is full of \"maybes.\" On one hand, having a job offer makes it feel within reach, but I worry about spending months with no professional or financial growth. However, I’m confused because I know millions in Turkey would love to be in my position.\nRegarding my career, my CPA technical capacity is portable. I can convert it to US or UK equivalents with just a couple of written exams.\nI definitely do not want to be 46 years old, holding onto a menial job or worse, being laid off and forced into call center work in Portugal.",
              "author": "Slaboli",
              "depth": 1
            }
          ]
        },
        {
          "top": "Can you take advantage of the Portuguese educational system to train for a professional career while you are living and working there? If so, I think that might tilt things in favor of Portugal especially if the prospect of obtaining an EU passport is there.",
          "author": "gcheong",
          "replies": []
        },
        {
          "top": "It’s wiser to invest in independence of any external circumstances. To get some valuable skill, for example. To be flexible enough to relocate.\nAlso you don’t go to another country for a “better living standards”.\nYou go there to get out of your comfort zone, to grind, to prove yourself, to learn etc. unless you’re already rich you’re going to struggle in one way or another for a while. Only your kids born there will be able truly and fully enjoy all the “standards”. That’s the brutal truth.",
          "author": "aristofun",
          "replies": [
            {
              "text": "> Also you don’t go to another country for a “better living standards”.\nWhy not?",
              "author": "yodsanklai",
              "depth": 1
            },
            {
              "text": "Something about the grass being greener on the other side.\nMany of the former colonial superpowers collapsed but never found their way back up again. The core problem might not be fixed.\nBut people still evaluate them as if they own half the world. In terms of GDP (per capita), quality of life, healthcare, they're not much better than the countries they once colonized.\nThen again, Turkey is one of those countries, so OP might have better luck elsewhere.",
              "author": "muzani",
              "depth": 2
            },
            {
              "text": "Thanks for your input! I think I overvalued the prospect of Portugal from the start. I see now that it’s an ideal place for wealthy Western retirees who want to enjoy the weather, beaches, and EU mobility. For someone like me who isn't poor but isn't wealthy either it doesn't offer much in terms of career growth.Even for the Portuguese themselves.\nWhen you say \"better luck elsewhere\" I assume you mean both Portugal and Turkey?",
              "author": "Slaboli",
              "depth": 3
            },
            {
              "text": "I mean some people overvalue places like Turkey too. Chances are you're not going from an undervalued place to an overvalued place to end up disappointed.",
              "author": "muzani",
              "depth": 4
            },
            {
              "text": "Because as a foreigner you start from scratch, no social network, no connections, no understanding of culture, mentality etc. You know, basic stuff, obviously.",
              "author": "aristofun",
              "depth": 2
            }
          ]
        },
        {
          "top": "It's interesting that you frame the question as what is wiser. Here is a quote from Naval about making decisions, I hope it would bring more clarity.\nDecisions:\n- If you can’t decide, the answer is no.\n- If two equally difficult paths, choose the one more painful in the short term (pain avoidance is creating an illusion of equality).\n- Choose the path that leaves you more equanimous in the long term.\nAlso, never outsource decision making to anyone who doesn't bear the consequences of the decision.",
          "author": "haute_cuisine",
          "replies": [
            {
              "text": "My real struggle is deciding which battle is worth fighting. I need to choose the path that is painful now but will compound into greater value, stability or status in 5 years.\nIs it the pain of career building (Turkey) or the pain of geographic isolation (Portugal)? Your insight forces me to ask: which pain is more likely to yield the best long-term return?\nTHANK YOU!",
              "author": "Slaboli",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47175746",
      "title": "Ask HN: How do you handle duplicate side effects when jobs, workflows retry?",
      "link": "https://news.ycombinator.com/item?id=47175746",
      "domain": "news.ycombinator.com",
      "author": "shineDaPoker",
      "score": 10,
      "comment_count": 9,
      "created_ts": 1772160302,
      "is_internal": true,
      "post_text": "Quick context: I&#x27;m building background job automation and keep hitting this pattern:<p>1. Job calls external API (Stripe, SendGrid, AWS)\n2. API call succeeds\n3. Job crashes before recording success\n4. Job retries → calls API again → duplicate<p>Example: process refund, send email notification, crash. Retry does both again. Customer gets duplicate refund email (or worse, duplicate refund).<p>I see a few approaches:<p>Option A: Store processed IDs in database\nProblem: Race between &quot;check DB&quot; and &quot;call API&quot; can still duplicate<p>Option B: Use API idempotency keys (Stripe supports this)\nProblem: Not all APIs support it (legacy systems, third-party)<p>Option C: Build deduplication layer that checks external system first\nProblem: Extra latency, extra complexity<p>What do you do in production? Accept some duplicates? Only use APIs \nwith idempotency? Something else?<p>(I built something for Option C, but trying to understand if this is actually a common-enough problem or if I&#x27;m over-engineering.)",
      "is_ask_hn": true,
      "matched_keywords": [
        "success"
      ],
      "comments": [
        {
          "top": "This is one of those problems that gets significantly harder when your system spans multiple runtimes or platforms.\nA few patterns that have worked well in practice:\n1. Idempotency keys at the API boundary — every side-effecting call gets a client-generated UUID, and the receiver deduplicates. Simple, but think carefully about the TTL of your dedup window.\n2. Outbox pattern — instead of directly calling the external service, write the intent to a local \"outbox\" table in the same transaction as your state change. A separate process polls the outbox and delivers. Debezium + CDC makes this quite clean.\n3. For cross-system workflows: treat the saga orchestrator as the single source of truth for step completion. Each step checks its completion status before executing, so steps must be idempotent OR the orchestrator tracks state.\nIn practice, designing for at-least-once delivery + idempotent receivers is more reliable than trying to achieve exactly-once through distributed coordination. Exactly-once across system boundaries is effectively a myth outside of systems that support two-phase commit (and even then it's fragile).",
          "author": "jnbridge",
          "replies": []
        },
        {
          "top": "Idempotency is the only sustainable answer here. Whether it's at the database level using unique constraints or implementing idempotency keys in your API headers, you have to design for the 'at-least-once' delivery reality. I usually implement a 'processed_requests' table that stores the unique ID of the job. Before the worker executes any side effect (like a payment or email), it checks if that ID exists. If it does, it skips the execution and returns the previous result. It adds a bit of latency, but it's much cheaper than dealing with double-billing or corrupted data",
          "author": "codebitdaily",
          "replies": []
        },
        {
          "top": "Use something like Temporal",
          "author": "babelfish",
          "replies": [
            {
              "text": "I actually talked to someone in temporal about this recently. Temporal gives you the primitives to handle it (activities, configure retries, interceptors), but you still have to implement the deduplication logic yourself for each external integration.\nHis advice was: Temporal solves orchestration, but making the external API calls idempotent is on you. For simple cases, write observe activities manually. For complex cases, build abstraction.\nThat's what led me down this path - trying to figure out if the abstraction is worth building or if manual is good enough.\nHave you used Temporal for this? How do you handle the idempotency of external calls?",
              "author": "shineDaPoker",
              "depth": 1
            }
          ]
        },
        {
          "top": "You proxy those api calls yourself and have idempotency to cover you for those APIs that don’t have it. If you architect it right you won’t have more than a ms latency addition. You can avoid the race condition issues by using atomic records so if something else tries they’d see it’s in progress and exit.",
          "author": "moomoo11",
          "replies": [
            {
              "text": "This is exactly the approach I took. Proxy layer that:\n- Uses atomic records (fence tokens) to prevent concurrent execution\n- Checks external system first before retrying (the retrieval step)\n- Records result for future lookups\nThe atomic records part is critical - I learned the hard way that just checking a DB flag isn't enough (process can freeze between check and execute, lease expires, another process takes over, both execute).\nHow do you handle the case where:\n1. Process acquires atomic lock\n2. Calls external API successfully  \n3. Process freezes before releasing lock\n4. Lock expires, new process acquires it\n5. New process calls API again → duplicate\nDo you just accept this edge case (rare but possible)? Or is there a mitigation I'm missing?",
              "author": "shineDaPoker",
              "depth": 1
            },
            {
              "text": "yeah, this is a common edge case in this scenario and as you say it will be rare but possible.\nhowever i don't think its that complicated (idk your system obv, so I could be off base) but i think your best bet is to not retry blindly and instead just query to see if already happened. If it already happened you're good and if not you handle it appropriately.\nconsidering it will be rare i don't think handling it how i suggest it will affect you that badly. keep it simple should be your priority imo with these kinds of operations.",
              "author": "moomoo11",
              "depth": 2
            }
          ]
        },
        {
          "top": "I think the answer is probably like most things: it depends.\n- If the external service supports idempotent operations, use that option.\n- If the external service \ndoesn't\n, but has a \"retrieval\" feature (i.e. lookup if the thing already exists, e.g fetch refunds on a given payment), use that first.\n- If the system has neither, assess how critical it is to avoid duplicates.",
          "author": "stephenr",
          "replies": [
            {
              "text": "This matches my thinking. The retrieval/lookup approach is exactly what I built - basically Option C with an observe-before-act pattern.\nFor APIs that support idempotency keys (Stripe, etc.), I use those. For ones that don't but have retrieval (most do), I check first before retrying.\nThe question I'm wrestling with: is the extra round-trip for the lookup worth it? Or should I just accept the edge cases where it duplicates?\nWhat's your threshold for \"critical enough to avoid duplicates\"? Payments obviously yes, but what about notifications, reporting, analytics events?",
              "author": "shineDaPoker",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47146212",
      "title": "New Claude Code Feature \"Remote Control\"",
      "link": "https://news.ycombinator.com/item?id=47146212",
      "domain": "news.ycombinator.com",
      "author": "rob",
      "score": 10,
      "comment_count": 0,
      "created_ts": 1771983624,
      "is_internal": true,
      "post_text": "No more tmux&#x2F;Tailscale-type stuff needed now?",
      "is_ask_hn": false,
      "matched_keywords": [
        "remote"
      ],
      "comments": []
    },
    {
      "id": "47152724",
      "title": "Ask HN: Starting a New Role with Ada",
      "link": "https://news.ycombinator.com/item?id=47152724",
      "domain": "news.ycombinator.com",
      "author": "NoNameHaveI",
      "score": 10,
      "comment_count": 5,
      "created_ts": 1772032859,
      "is_internal": true,
      "post_text": "So, good news. After a unexpectedly long absence from employment, I am 95% certain that I will receive an offer for a contract job as a product owner. This position will largely involve supervising the development&#x2F;maintenance of code written in Ada. Even though I have over a decade of experience with C&#x2F;C++&#x2F;Assembly, I have ZERO experience with Ada. I doubt I will be writing much Ada myself, but I believe I will need to learn Ada.<p>So here are my questions:<p>1. Reading code is usually pretty straightforward. However, all software requires domain knowledge. When starting a new role, how do you bring yourself up on domain knowledge quickly?<p>2. If you know Ada, what resources to learn Ada do you recommend?<p>3. What Ada pitfalls do you advise to look out for?",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Coming from more mainstream languages, the first thing you’ll notice about Ada is that the compiler is your most rigorous code reviewer. My advice: lean into the type system early. Don't try to fight the constraints; they are there because Ada is designed for systems where failure isn't an option.\n Focus on understanding 'Packages' and 'Tasking' models, as they handle concurrency much more safely than the primitive threading models in C. Also, keep the 'Reference Manual' (ARM) handy. It’s dense, but it’s the ultimate source of truth. Starting with Ada in 2026 is actually a great career move—as system complexity grows, the industry is rediscovering the value of languages that prioritize safety by design.",
          "author": "CodeBit26",
          "replies": []
        },
        {
          "top": "1. Ask questions, and write down the answers in a way that you will find them again. Anki and spaced repetition is useful to learn the terminology or any info that isn't intuitive.\n2. \nhttps://github.com/ohenley/awesome-ada\n has links to pretty much every Ada topic and resource; if you want to try Ada using open source tools, the best starting point is \nhttps://alire.ada.dev/docs/\n3. Compared to C/C++ I can't really think of any pitfalls. It requires more discipline and formal reasoning, but you will get used to it (and appreciate the lack of footguns, at least I did).\nCongrats and good luck.",
          "author": "phba",
          "replies": [
            {
              "text": "Just need to check if it's plain Ada or one specific profile or  SPARK",
              "author": "Davidbrcz",
              "depth": 1
            }
          ]
        },
        {
          "top": "I would try Claude Code with an Ada LSP server. Use AI to get the high-level architecture diagrams, question the codebase. You can write a new skill with all your findings about Ada best practices. Also try CodeRabbit if it already supports Ada. Congratulations on the new job, best of luck.",
          "author": "ezulabs",
          "replies": []
        },
        {
          "top": "I learned Ada in 1990. It looks like it was based on Pascal. I used Janus Ada for DOS. There is a free Learn Ada ebook here: \nhttps://learn.adacore.com/pdf_books/courses/intro-to-ada.pdf",
          "author": "orionblastar",
          "replies": []
        }
      ]
    },
    {
      "id": "47160050",
      "title": "Ask HN: Could you create a competitor to your company at 10% of the cost?",
      "link": "https://news.ycombinator.com/item?id=47160050",
      "domain": "news.ycombinator.com",
      "author": "TheAlchemist",
      "score": 9,
      "comment_count": 14,
      "created_ts": 1772064960,
      "is_internal": true,
      "post_text": "I&#x27;m trying to wrap my mind about the AI tools, and while I believe there is way too much hype, I&#x27;m quite impressed with the progress.<p>The current mood seem to be that big companies will automate away many white collar jobs and just get bigger profits. My question is - what if it&#x27;s the other way around ? Could said white collar workers just spin off competitors much more easily than before ? Obviously this mostly apply to software, but I&#x27;m curious what people think about it in all industries.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Technically speaking? Sure, most of the companies I've worked at aren't exactly doing rocket science. Creating media websites and doing work for clients as a marketing company are things that have a very low barrier to entry.\nThe challenge is that in most of these cases, success is based on trust and long-term reputation building rather than pure technical skill. And doing a good job in either industry requires a lot more time, resources and effort than a single person may be able to provide.\nSo, while I could definitely spin up some very similar sites, creating the actual content at a level of quality that people would even bother to read would be a chore, as would finding an audience in general.",
          "author": "CM30",
          "replies": []
        },
        {
          "top": "Technically? Probably. But the 10% cost isn't where the battle is. It's the 90% trust and 'organizational gravity' that legacy companies hold. You can replicate the stack with AI agents in a weekend, but you can't replicate the compliance, the sales relationships, and the 'nobody ever got fired for buying IBM' safety net. AI has lowered the floor for entry, but it hasn't lowered the ceiling for enterprise trust.",
          "author": "CodeBit26",
          "replies": []
        },
        {
          "top": "A toy-version MVP might be cheap. What happens when you need to deploy it, scale it, secure it, support it, upgrade it, market it, etc.\nA large company is more than a single GitHub repo.",
          "author": "al_borland",
          "replies": [
            {
              "text": "Exactly. This is like the greenfield vs brownfield or 'Twitter clone in a weekend' arguments. Cost and complexity grow drastically with success and scale.",
              "author": "radioshakeshack",
              "depth": 1
            },
            {
              "text": "I know that, that's why I'm asking the question. But if cost and complexity grow drastically with scale, my question is even more relevant, isn't it ? \nIf it's easy to spin up a competitor, we should rather see more small companies, not less.",
              "author": "TheAlchemist",
              "depth": 2
            },
            {
              "text": "From a pure numbers standpoint, absolutely. We're already seeing a wave of folks shipping more PoC products with AI tools. The distinction is that most of these aren't true \"competitors\" to established companies, more filling gaps and niches if they aren't just a toy clone.\nThat's the more interesting angle here to me. Rather than building a direct competitor at 10% the cost, agent assisted tooling could make it individually profitable to target small cap, cottage industry type problems that have too much nuance for a one size product. Areas where someone already has deep business insight that provides the value proposition moreso than the labor around coding. Not competitors at 10% the cost, but filling niches that wouldn't have been profitable otherwise.\nThe danger is that if agents get more capable, the niche markets start to erode. If a generic solution agent can acquire domain knowledge and coordinate with customers, even these 'competitors' become risky again.",
              "author": "radioshakeshack",
              "depth": 3
            },
            {
              "text": "There have always been a million small POC clones of popular apps. Twitter, Trello, <insert popular todo app>, etc.\nDoing a subset of what a market leader is doing, but worse, with no path to scale or support, isn’t going to go anywhere.\nYesterday someone vibe coded a password manager in 20 minutes and posted it here. Should anyone use it? Absolutely not. It’s a security nightmare, won’t get support, and the architecture is complete trash, requiring the use to run a local server the background that the app and browser extension talk to. Not to mention it will likely never see an update.\nSuccessful competitors do something new. A lazy vibe coded clone doesn’t nothing new, and they don’t even do all the basics.",
              "author": "al_borland",
              "depth": 3
            }
          ]
        },
        {
          "top": "As a former JavaScript developer yes I could reduce costs by 99%, but it’s not what business wants. They want the able to hire/fire people and not train them, so there are your inefficiencies: a bunch of lower confidence people that need a lot of hand holding.",
          "author": "austin-cheney",
          "replies": []
        },
        {
          "top": "I think you're onto something.  I started my own firm on a shoe-string compared to my boss' existing company and have been doing quite well.  The hardest thing may be lead generation, but I poached a bunch of those too.",
          "author": "Eaglo",
          "replies": []
        }
      ]
    },
    {
      "id": "47173773",
      "title": "Ask HN: My competitor wants to buy us out, recommend a lawyer?",
      "link": "https://news.ycombinator.com/item?id=47173773",
      "domain": "news.ycombinator.com",
      "author": "VladVladikoff",
      "score": 7,
      "comment_count": 8,
      "created_ts": 1772148564,
      "is_internal": true,
      "post_text": "My tech company has grown to the point where has become a significant threat to the industry leader. They have reacted by asking if we are open to acquisition. I’m looking for suggestions of lawyers who are experienced with this type of transaction, as this is significantly outside of my wheelhouse.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Before you think about lawyers, I would say be careful dealing with industry leaders because they may just be sniffing and not really serious. There are plenty of cases where a larger industry leader reaches out in disguise of acquisition and then gets the details and does it on their own. Not saying it is the case necessarily here but just be careful of that.\nFor example, ask yourself why they really need to buy you out. Why can't they build it themselves ? Is it really your customer base they want ? Is it your technology ? Do they just want you (acquihire) ? What is the moat here that they want to acquire you ? If you cannot answer that clearly, they may not be serious.\nIn terms of finding a lawyer, you need to find a lawyer who has experience in tech acquisitions especially in your jurisdiction/area (for example, in US, even the state of residence will come into play). Selling a business involves various things including whether it will be asset vs stock sale (you will need to learn the difference),what will be the terms (all cash upfront vs earn out/equity etc).\nBe ready to spend $1000s or even $10,000+ on lawyers and the deal may still fall through. So are you ready to spend your own cash ($10,000+ or higher) and still be ready for the fact that deal falls ?\nJust some things to keep in mind.",
          "author": "codegeek",
          "replies": []
        },
        {
          "top": "Congratulations on being approached—that is a major milestone. Beyond a standard lawyer, you specifically need an M&A (Mergers & Acquisitions) attorney who understands IP tech transfers. General corporate lawyers often miss the nuances of 'Earn-out' clauses and post-acquisition liability. Also, ensure your data room is audit-ready before the due diligence starts. Good luck with the negotiations!",
          "author": "CodeBit26",
          "replies": []
        },
        {
          "top": "Definitely get a lawyer who has handled founder-side acquisitions, not just general corporate work. The structure, earn-outs, and control terms matter a lot more than people expect. A good lawyer can easily change the outcome of the deal.",
          "author": "allinonetools_",
          "replies": []
        },
        {
          "top": "In what jurisdiction are you and they domiciled?",
          "author": "joefarish",
          "replies": [
            {
              "text": "We are based in Canada but do business throughout North America. They are based in USA and want the Canadian market, but they have failed to break into it.",
              "author": "VladVladikoff",
              "depth": 1
            }
          ]
        },
        {
          "top": "We've sold off what we call \"Verticals\" of our company to a competitor in the past. A competitor that previously we had helped co-found and had very horrible interactions with. So we had zero trust in dealing with them and wanted the contracts to be rock solid. The process took forever to agree on a contract, the payment process, putting the money in escrow, etc.... Part of us didn't want to have anything to do with selling something to this company because we despised them. But business is business and their offer was higher than what we could get from anyone else.\nLong story short, the process went fine. We ended up selling another vertical to them, and then another. All 3 sales went through fine.\nThis is the lawyer we used and he also happened to be local.\nhttps://www.gregorprivate.com/",
          "author": "johng",
          "replies": [
            {
              "text": "If selling, you can get away with bad buyers as long as the deal is mostly cash upfront. However, I would highly advise against buying from a seller you cannot trust. Imagine they already showed you during the deal process when they have an incentive to be nicer. Once you wire the money, you are in for a lot more surprises. I would never buy from a seller who gave me bad vibes. Regardless of how good the deal sounds.\nSource: I have bought 3 smaller projects (one for 500k so i guess not indie but still small) and in all 3 cases, the sellers were incredible genuine and truly cared about their company/product. Just because of how trustworthy and helpful they were, I closed the deals quickly after fair negotiations.\nI declined 1 deal where the product was a great fit to my exiting business and it would have been a great transition but the seller was too arrogant and I just couldn't trust him. I backed out after exchanging a couple of messages with him.",
              "author": "codegeek",
              "depth": 1
            },
            {
              "text": "I can see that. We were the sellers and the deals were all cash, after the handoff with the money in escrow prior and a binding arbitration clause if there were disagreements on the hand off. We had zero issues though.",
              "author": "johng",
              "depth": 2
            }
          ]
        }
      ]
    },
    {
      "id": "47159394",
      "title": "Ask HN: What will happen with Anthropics ultimatum?",
      "link": "https://news.ycombinator.com/item?id=47159394",
      "domain": "news.ycombinator.com",
      "author": "maniacwhat",
      "score": 7,
      "comment_count": 4,
      "created_ts": 1772061179,
      "is_internal": true,
      "post_text": "As we are all aware, anthropic has it&#x27;s ultimatum from the US government: drop their anti-killing TOS or else get in trouble this Friday.<p>I&#x27;m sure whatever happens it&#x27;ll seem much more obvious that that&#x27;s what was always going to happen, in hindsight, than it does now.<p>So as an experiment, I&#x27;m curious to hear from the hn community, in advance of Friday, what we think will happen.<p>Will they concede? Will they ignore and suffer the consequences (and what might those be)? Will we even find out or will it be shrouded in mystery for the foreseeable future?...<p>This is admittedly somewhat sensationalist so I&#x27;m not sure whether it fits with hn guidelines, but as one of the best places I know of for genuine online discussion, I think it would be interesting to hear reasoned predictions.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "It looks like their contract was canceled and given to OpenAI. OpenAI agreed to roughly the same red lines, but I guess for emotional purposes they chose to switch.",
          "author": "muzani",
          "replies": []
        },
        {
          "top": "Situations like this usually end in some kind of quiet compromise. Companies rarely take a hard public stance if it risks access to key infrastructure or partnerships. What we’ll probably see is subtle policy changes rather than a dramatic announcement.",
          "author": "allinonetools_",
          "replies": []
        },
        {
          "top": "no one knows, just wait until the real news hits, the story will be on the front, it's all speculation until then (and can happen sooner, Friday is the deadline)",
          "author": "verdverm",
          "replies": []
        },
        {
          "top": "Is this a prediction on Kalshi yet ?\nI see currently: \"Will the Pentagon designate Anthropic a supply chain risk? \"\nI would bet $$ they \"cave\", morals and ethics be damned.\nNext up on Kalshi: Where will the next genocide be accomplished ? Cuba ?  Nicaragua ? Who will be the US proxy ? Blackwater ?",
          "author": "DivingForGold",
          "replies": []
        }
      ]
    },
    {
      "id": "47188684",
      "title": "Super Editor – Atomic file editor with automatic backups (Python and Go)",
      "link": "https://news.ycombinator.com/item?id=47188684",
      "domain": "news.ycombinator.com",
      "author": "larryste",
      "score": 6,
      "comment_count": 1,
      "created_ts": 1772241522,
      "is_internal": true,
      "post_text": "I built this after getting frustrated with unsafe file operations in automation workflows.<p><pre><code>       Key features:\n      • Atomic writes (no partial&#x2F;corrupted files)\n      • Automatic ZIP backups before every change\n      • Regex and AST-based text replacement\n      • 1,050 automated tests with 100% pass rate\n      • Dual implementation (Python + Go, Go is 20x faster)\n      \n      Use cases:\n      • CI&#x2F;CD pipelines that modify config files\n      • Automated refactoring scripts\n      • Any workflow where file corruption would be catastrophic\n      \n      PyPI: https:&#x2F;&#x2F;pypi.org&#x2F;project&#x2F;super-editor&#x2F;\n      GitHub: https:&#x2F;&#x2F;github.com&#x2F;larryste1&#x2F;super-editor\n      Would love feedback from the HN community!</code></pre>",
      "is_ask_hn": false,
      "matched_keywords": [
        "feedback"
      ],
      "comments": [
        {
          "top": "The choice of Go for the backend logic and Python for the scripting flexibility is a solid architectural decision for an editor. I’m particularly interested in how you handle the 'atomic' part during high-frequency writes to prevent file corruption. Does it use a WAL (Write-Ahead Logging) approach or simple temporary file swapping? Great to see more local-first tools being built with robustness in mind.",
          "author": "codebitdaily",
          "replies": []
        }
      ]
    },
    {
      "id": "47161616",
      "title": "LazyGravity – I made my phone control Antigravity so I never leave bed",
      "link": "https://news.ycombinator.com/item?id=47161616",
      "domain": "news.ycombinator.com",
      "author": "masaTokyo",
      "score": 6,
      "comment_count": 3,
      "created_ts": 1772078012,
      "is_internal": true,
      "post_text": "<p><pre><code>  I get my best coding ideas when I&#x27;m nowhere near my desk — usually right\n  as I&#x27;m falling asleep. I got tired of losing that momentum, so I built\n  LazyGravity.\n\n  It&#x27;s a local Discord bot that hooks up Antigravity to your phone. I can\n  ship fixes, kick off long implementation tasks, or start whole features\n  from bed, the train, wherever. Send a message in Discord, Antigravity\n  executes it on your home PC, results come back as rich embeds you can\n  reply to for follow-up instructions.\n\n  How it works: it drives the Antigravity UI directly via Chrome DevTools\n  Protocol over WebSocket (Runtime.evaluate on the Electron shell&#x27;s DOM).\n  No private API hacking — no risk of account bans like with tools that\n  reverse-engineer proprietary APIs.\n\n  A few things I care about:\n\n  - Local-first: your code never leaves your machine. No exposed ports,\n    no cloud relays, no intermediate server.\n  - Secure: whitelist-based access — only your Discord ID can trigger\n    commands. (I recommend a dedicated server to keep things private.)\n  - Context threading: reply to any result embed to continue the\n    conversation with full context preserved.\n\n  What you can actually do from your phone:\n\n  - Route local projects to Discord categories, sessions to channels\n    — automatic workspace management\n  - Toggle LLM models or modes (Plan&#x2F;Code&#x2F;Architect) with &#x2F;model and &#x2F;mode\n  - &#x2F;screenshot to see exactly what&#x27;s happening on your desktop in real-time\n  - One-click prompt templates for common tasks\n  - Auto-detect and approve&#x2F;deny file change dialogs from Discord\n\n  Still early alpha (v0.1.0), but it&#x27;s been a game-changer for my own\n  workflow. Looking for folks to try it out, roast the architecture,\n  , add new features and help squash bugs.\n\n    npm install -g lazy-gravity\n    lazy-gravity setup\n  Demo video in Readme:\n  https:&#x2F;&#x2F;github.com&#x2F;tokyoweb3&#x2F;LazyGravity</code></pre>",
      "is_ask_hn": false,
      "matched_keywords": [
        "management"
      ],
      "comments": [
        {
          "top": "One thing that doesn't get discussed enough: the gap between people who can use AI tools effectively and those who can't is widening fast.\nThe engineers who thrive are the ones who understand how the underlying models actually work. They know when to trust the output, when to add constraints, and how to structure prompts for reliable results across different contexts.\nThe ones struggling tend to treat LLMs as magic boxes. They get inconsistent results and don't know why.\nThis is creating a real challenge for hiring managers. Standard coding interviews do not surface which category a candidate falls into at all.",
          "author": "lunaprompts_hn",
          "replies": [
            {
              "text": "The best way I can describe it is not that different from explaining how to effectively use a search engine in the past.",
              "author": "CSSer",
              "depth": 1
            }
          ]
        },
        {
          "top": "Well great idea. CDP over WebSocket to drive the Electron shell is a clean approach, no reverse engineering needed and you stay within supported boundaries.",
          "author": "TomKwon",
          "replies": []
        }
      ]
    },
    {
      "id": "47200535",
      "title": "Ask HN: Article to share with a technical manager about modern AI coding tools?",
      "link": "https://news.ycombinator.com/item?id=47200535",
      "domain": "news.ycombinator.com",
      "author": "killmill",
      "score": 5,
      "comment_count": 2,
      "created_ts": 1772314538,
      "is_internal": true,
      "post_text": "I’m on an IT team, and my manager uses ChatGPT’s chat interface for some tasks, (IAC) so he’s generally aware of AI.<p>However, he’s not familiar with more advanced tools like Claude Code, Codex, or other development tools.<p>I’m looking for a, balanced article that explains:<p>What these tools can realistically do today<p>Where they still struggle or fall short<p>Any recommendations?",
      "is_ask_hn": true,
      "matched_keywords": [
        "team",
        "manager"
      ],
      "comments": [
        {
          "top": "Pointing to internet articles are slightly tricky today, due to the too many of them. I would break this into broadly two categories:\n1. Chat Interface based - All General Purpose. All questions are good questions. However, each of these Chat GPT, Grok, Gemini, and Claude have personality. One more resonate more with someone than other. \n2. Claude Code, Co pilot - Here you want to talk to the tool in fairly closed context based.  These are called RAG Based. You can ask #1 about it. \n3. LLM Direct - you already are deep into coding, and u want to leverage the power of LLMs, like Open AI, Opus, Sonnet, Grok etc.\nShort answer, there is single path, key lies in asking open ended questions and Chat Interface provides very good path forward. They are very good in directing about itself or even other chat interface. Hope this helps",
          "author": "aisreal0",
          "replies": []
        },
        {
          "top": "Honestly, the biggest challenge with AI tools isn't just picking one, it's explaining to management that they don't replace the need for deep architectural knowledge. Most managers think Copilot means 2x speed, but they forget about the \"review debt\" it creates. I’ve found that focusing on the ecosystem rather than just the syntax is the only way to stay ahead. I actually wrote a breakdown on why the Python ecosystem remains the backbone of this shift, which might be exactly what your manager needs to see to understand the bigger picture: \nhttps://codebit-daily.hashnode.dev/why-python-is-still-the-k...",
          "author": "CodeBit26",
          "replies": []
        }
      ]
    },
    {
      "id": "47200827",
      "title": "Ask HN: Builder.ai ($1B Microsoft-backed AI company) who's lookin at the assets?",
      "link": "https://news.ycombinator.com/item?id=47200827",
      "domain": "news.ycombinator.com",
      "author": "gamelock",
      "score": 4,
      "comment_count": 0,
      "created_ts": 1772316617,
      "is_internal": true,
      "post_text": "Builder.ai raised $450M from Microsoft and \nthe Qatar Investment Authority. Peak \nvaluation $1B+. Filed insolvency May 2025.<p>Administrator: Alvarez &amp; Marsal (Jul 2025)<p>Assets available:\n- builder.ai domain ($50K-$200K est.)\n- Natasha AI platform ($100K-$500K est.)\n- Full source code ($500K-$5M est.)\n- Enterprise clients: NBCUniversal, Fujitsu, \n  Virgin Unite ($50K-$300K est.)<p>Total estimated: $830K-$6.65M+<p>Full intelligence report available covering \ncollapse timeline, assets, administrator \ncontacts, acquisition guide.<p>Report: selar.com&#x2F;s2121g2629",
      "is_ask_hn": true,
      "matched_keywords": [
        "enterprise"
      ],
      "comments": []
    },
    {
      "id": "47196746",
      "title": "Garbage In, Garbage Out: The Degradation of Human Requirements in the LLM Era",
      "link": "https://news.ycombinator.com/item?id=47196746",
      "domain": "news.ycombinator.com",
      "author": "waylake",
      "score": 4,
      "comment_count": 2,
      "created_ts": 1772293887,
      "is_internal": true,
      "post_text": "The LLM Paradox: We’re Forgetting How to Speak to Humans<p>The longer we use LLM services, the more I see a specific kind of &quot;psychosis&quot; spreading in the workplace. LLMs are so good at hallucinating a coherent answer from a vague prompt that people have started to believe their vague prompts were actually coherent.<p>LLMs Are Not Humans\nIt sounds obvious, but we are losing our grip on this fact. People are beginning to treat their colleagues like a black-box LLM. They’ve forgotten that human communication requires precision, shared context, and accountability. In the pre-LLM era, &quot;make it pop&quot; was a phrase reserved for clueless clients. Now, it’s becoming the standard operating procedure inside engineering teams.<p>The &quot;Do It Well, You Figure It Out&quot; Fallacy\nI see managers—even those with engineering backgrounds—who are terrified of being held accountable for their own bad ideas. They hide behind vagueness. They use tools like Claude Code as a shield to bypass technical debt discussions.<p>When an engineer spends days fixing a half-baked requirement and managing technical constraints, the feedback isn&#x27;t &quot;Thank you for the due diligence.&quot; Instead, it’s: &quot;See? It was possible after all. Why did you push back so hard? LLMs could&#x27;ve done it in seconds.&quot; This is gaslighting. They want the output of a senior engineer while providing the input of a garbage prompt.<p>The Death of Articulation\nLLMs accept &quot;garbage in&quot; and provide &quot;plausible out.&quot; This has become a drug. People are losing the ability to articulate their own thoughts. They throw a mess of words at you and expect a miracle. If this continues, we aren&#x27;t just looking at bad software; we’re looking at a breakdown of professional sanity.<p>I’ve felt the symptoms myself. Lately, I’ve caught myself thinking, &quot;Explaining this to my team is a waste of &#x27;communication cost.&#x27; I’d rather just pay for more API tokens and do it myself.&quot;<p>But we must remember: A high-functioning team is not a collection of prompt engineers. True teamwork is exponentially more efficient than a lone developer with an LLM. We cannot afford to lose the art of talking to each other.",
      "is_ask_hn": false,
      "matched_keywords": [
        "teamwork",
        "team",
        "communication",
        "feedback",
        "senior"
      ],
      "comments": [
        {
          "top": "None of this is new.  Developers have always been given ambiguous requirements, and questions about them have always been furiously rejected.  Then they guess what was meant, or should have been meant, and that is what is deployed.",
          "author": "FrankWilhoit",
          "replies": []
        },
        {
          "top": "We have dealt with this in the political realm for decades. Vague word salads are being passed off as coherent policy arguments every where we turn.\nAfter spewing some vague policy position, a politician's worst fear is that a reporter might ask \"What do you mean by that?\" Or \"How would that work in real life?\"",
          "author": "didgetmaster",
          "replies": []
        }
      ]
    }
  ]
}