{
  "scraped_date": "2026-03-02",
  "source": "hacker_news",
  "total_scraped": 129,
  "nontech_count": 29,
  "posts": [
    {
      "id": "47163885",
      "title": "Tell HN: YC companies scrape GitHub activity, send spam emails to users",
      "link": "https://news.ycombinator.com/item?id=47163885",
      "domain": "news.ycombinator.com",
      "author": "miki123211",
      "score": 677,
      "comment_count": 256,
      "created_ts": 1772098508,
      "is_internal": true,
      "post_text": "Hi HN,<p>I recently noticed that an YC company (Run ANywhere, W26) sent me the following email:<p>From: Aditya &lt;aditya@buildrunanywhere.org&gt;<p>Subject: Mikołaj, think you&#x27;d like this<p>[snip]<p>Hi Mikołaj,<p>I found your GitHub and thought you might like what we&#x27;re building.<p>[snip]<p>I have also received a deluge of similar emails from another AI company, Voice.AI (doesn&#x27;t seem to be YC affiliated). These emails indicate that those companies scrape people&#x27;s Github activity, and if they notice users contributing to repos in their field of business, send marketing emails to those users without receiving their consent. My guess is that they use commit metadata for this purpose. This includes recipients under the GDPR (AKA me).<p>I&#x27;ve sent complaints to both organizations, no response so far.<p>I have just contacted both Github and YC Ethics on this issue, I&#x27;ll update here if I get a response.",
      "is_ask_hn": false,
      "matched_keywords": [
        "purpose"
      ],
      "comments": [
        {
          "top": "Martin from GitHub here.  This type of behaviour is explicitly against the GitHub terms of service, when we catch the accounts doing this we can (and do) take action against those accounts including banning the accounts. It's a game of whack-a-mole for sure, and it's not just start-ups that take part in this sketchy behaviour to be honest. I've been plenty of examples in my time across the board.\nThe fundamental nature of Git makes this pretty easy for folks to scrape data from open source repositories.  It's against our terms of service and those folks might want to talk with some lawyers about doing it - but as every Git commit contains your name and email address in the commit data it's not technically difficult even if it is unethical.\nFrom the early days we've added features to help users anonymise their email addresses for commits posted to GitHub.  Basically, you configure your local Git client to use your 'no-reply' email address in commits and that still links back to your GitHub account when you push: \nhttps://docs.github.com/en/account-and-profile/reference/ema...\nI think that's still probably the best route. We want to keep open source data as open as possible, so I don't think locking down API's etc is the right route. We do throttle API requests and scraping traffic, but then again there have been plenty of posts here over the years from people annoyed at hitting those limits so it's definitely a balancing act. Love to know what folks here think though.",
          "author": "martinwoodward",
          "replies": [
            {
              "text": "> when we catch the accounts doing this we can (and do) take action against those accounts including banning the accounts.\nThis isn't my experience. I requested that you looked into a spammer in July 2025, you ignored my reply and the account is still active.\n----\nThank you so much for the report. We're sorry to hear you're receiving unwanted emails, but it's always a possibility when your public contact information is listed on the web. You can keep your email address private if you wish by following the steps here:\nSetting your commit email address\nWe do expect our users to comply with our Terms of Service, which prohibits transmitting using information from the GitHub (whether scraped, collected through our API, or obtained otherwise) for spamming purposes. I'm happy to look into it further to see if we can contact the reported user and let them know that this type of activity is not allowed.\nPlease let us know if you have any other questions or concerns.\n----\nMy reply which was ignored:\n----\nI understand it will happen from time to time. I'd rather be contactable (I've received legitimate emails today because my email is on my profile).\nPlease take further action. My email is public with the expectation that the ToS will be enforced. If GitHub isn't discouraging spammers then it makes it much harder to justify being contactable.\nAll the best,\nDavid",
              "author": "david_allison",
              "depth": 1
            },
            {
              "text": "I reported spammers ~5 times to GH, and every time the account went down in a couple of hours. Obviously mileage may vary, but I don't want the whole HN to think this process is completely broken.\nPlease keep reporting spammers, usually it works.",
              "author": "gettingoverit",
              "depth": 2
            },
            {
              "text": "To confirm: is this email spammers, or spam on GitHub?\nI've had decent success with on-GitHub action (I'd wager ~80% action taken), but the effort to report email spammers doesn't seem worthwhile.",
              "author": "david_allison",
              "depth": 3
            },
            {
              "text": "It's impossible for them to stop if you list your email on there. They could make it harder of course. But if you put your email out there for a human to find, then a script or bot or also find it.\nAnd yes of course they can also stop a specific spammer. But that spammer may pick up another account and email.",
              "author": "tom_m",
              "depth": 2
            },
            {
              "text": "The grandparent post wasn't asking for them to do the impossible and stop all spamming, only to take action against the particular user that spammed them.",
              "author": "angoragoats",
              "depth": 3
            }
          ]
        },
        {
          "top": "YC is a proud investor in Flock, what YC Ethics thing are you talking about?",
          "author": "scottydelta",
          "replies": [
            {
              "text": "And that Optifye.ai demo with the sweatshop surveillance software",
              "author": "otherayden",
              "depth": 1
            },
            {
              "text": "And Cluely",
              "author": "cassonmars",
              "depth": 1
            },
            {
              "text": "Cluely is not YC.",
              "author": "tasn",
              "depth": 2
            },
            {
              "text": "he might be thinking of chadIDE \"the first brainrot ide\"",
              "author": "fantasizr",
              "depth": 3
            },
            {
              "text": "the same Cluely that's on IG? I thought that was a fictional satire.",
              "author": "insane_dreamer",
              "depth": 2
            }
          ]
        },
        {
          "top": "I've spent a lot of my career marketing to developers, and spamming their GitHub account might be top 1 or 2 worst marketing tactics you can use.\nCold emailing rarely works by itself. Cold emailing \ndevelopers\n via emails you pulled from their GitHub accounts? At that point, you're actively harming your brand, and may as well just send them spam diet pill ads.",
          "author": "keiferski",
          "replies": [
            {
              "text": "If someone took the time to look through my GitHub contributions then pitched me with a job relevant to that work I would absolutely consider them. That's \nexactly\n the kind of recruiter I would like to work with.\nIf it's obviously just a bot scraping emails and sending generic job requests, that's very different.",
              "author": "RandallBrown",
              "depth": 1
            },
            {
              "text": "> If it's obviously just a bot scraping emails and sending generic job requests, that's very different.\nIt's not even that nice. They scrape emails and send cold calls to try to get you to purchase their services.",
              "author": "devmor",
              "depth": 2
            },
            {
              "text": "Yeah this - I got one of these emails someone sniffing around my GitHub not that long ago and it wasn't immediately obvious that it was a scammy recruiter, so I responded to sound out if they were actually interested in one of my projects. Got the same generic response about let's work together on something so I didn't respond.",
              "author": "jamesfinlayson",
              "depth": 2
            },
            {
              "text": "Yeah I mean as a marketing tactic to sell your product. An employer / recruiter offering you work this way is different.",
              "author": "keiferski",
              "depth": 2
            },
            {
              "text": "Find everyone who starred this repo and did a PR against these 10 repos is within reach of all marketers now. I just told them how.",
              "author": "genxy",
              "depth": 2
            }
          ]
        },
        {
          "top": "Ever wonder why YC has the \"Describe a time you most successfully hacked some system to your advantage\" question? It's because they select for founders that are willing to take advantage of legal gray areas. Airbnb repeatedly violated Craigslist terms of service and called it \"growth hacking.\" Reddit stole content from Digg and faked users. OpenAI trains their models on copyrighted content.",
          "author": "an0malous",
          "replies": []
        },
        {
          "top": "I also had unsolicited spam from Vincent Jiang of Aden, another YC company.\n    Hi Daniel,\n\n    I just came across your profile on social media and wondered if you'd be interested in joining our Discord community for AI agent development. Currently, we see that agents break, loop, get lost, hallucinate, and cost a fortune, and therefore built a space where developers can share challenges and insights.",
          "author": "unfunco",
          "replies": [
            {
              "text": "…and more from Backdrop.\n    Hi Daniel, I found your GitHub profile while searching for anthropic projects, and got your email from your profile.\n\n    I'm part of an online program for builders called Backdrop Build, and I think that program would be a great fit given what you are building. We have a track for builders in AI like you, it's fully online/remote and costs nothing to participate. It also works if you have a day job, it's light on time and perfect for side projects!\n\n\nAnd then another after I marked the first one as spam and ignored it.\n    Checking in one last time to see if you have any questions about the program or the application. If it's not for you, all good - just ignore the email because I won't be pinging you again :)\n\n   Joey from Backdrop\n\n\nBoth companies have guaranteed that I won't use their services nor procure them for any organisation I work for.",
              "author": "unfunco",
              "depth": 1
            },
            {
              "text": "Hey it's Joey checking in again. We noticed you mentioned our company, let me know if you have any questions about our (free!) program. I'll go ahead and email you some more info, just in case.",
              "author": "agmater",
              "depth": 2
            },
            {
              "text": "I had a similar one from that guy asking me to make open source PRs to some repo of theirs for, err, $25-50/hour. I replied explaining that senior software engineers in the UK aren’t \nquite\n as desperately poor as that, and got a canned response saying that they were looking forward to reviewing my PRs :D",
              "author": "foldr",
              "depth": 1
            },
            {
              "text": "Blows my mind that you guys are so expensive lol.",
              "author": "shunia_huang",
              "depth": 2
            },
            {
              "text": "SWE salaries in the UK are fairly unsurprising as they tend to be more or less in the range of other professional salaries. If they’re high from a worldwide point of view that’s just because most of us are in London and London is a high cost of living city.",
              "author": "foldr",
              "depth": 3
            }
          ]
        }
      ]
    },
    {
      "id": "47201629",
      "title": "HN is drowning in AI comments",
      "link": "https://news.ycombinator.com/item?id=47201629",
      "domain": "news.ycombinator.com",
      "author": "waygtdai",
      "score": 88,
      "comment_count": 63,
      "created_ts": 1772321219,
      "is_internal": true,
      "post_text": "Dang, any updates on how you and the team were thinking of tackling this? It’s getting ridiculous. Last week was sort of okay but it’s much worse this weekend.<p>Edit: This spiked on front page and now it’s completely gone. What is going on?<p>Great. Flagged.",
      "is_ask_hn": false,
      "matched_keywords": [
        "team"
      ],
      "comments": [
        {
          "top": "I've read HN almost everyday for about 10 years. Maybe I'm naive, but I don't see it. I see way more folks complaining that comments are AI generated.",
          "author": "Hnrobert42",
          "replies": [
            {
              "text": "Yeah, the up/down voting mechanism seems to be doing it's job for me too. Don't think I've noticed a degradation in, say, the top third of comments. That's where I try to live anyway.\n/newest is chock full of submissions that were written by AI, though. That's another, broader problem.",
              "author": "kylecazar",
              "depth": 1
            },
            {
              "text": "A while ago I replied to the topmost reply to a comment to rebuke some factual errors. I didn't notice anything wrong with the comment itself when I replied. But after I posted, someone replied to my post and accused the post I replied to of being AI written.\nAt first I felt similarly as you. I thought people were just paranoid. And the someone pointed out that if I paste the top level post (the post I replied to replied to) into chatGPT and it will generate a very similar reply.\nhttps://news.ycombinator.com/item?id=46758598\nThe post I replied to was flagged dead so you need to turn showdead on in your profile to read it. Would you be able to tell if it is AI if someone replied like this to you? I surely couldn't.",
              "author": "pibaker",
              "depth": 1
            },
            {
              "text": "To add to the collection of anecdata, your experience is similar to mine.  I have been more exhausted recently by the complaints of AI submissions and pseudo analysis of AI comments than exhausted by the supposed AI generated comments themselves.",
              "author": "brg",
              "depth": 1
            },
            {
              "text": "I've been using HN since 2008 when I created my first account[1] and I use HN differently than most people. I have a group of bookmarked searches that I visit almost daily that relate to technologies that interest me, such as Emacs.\nIn the past year, the searches I perform that relate to web development show a horrifying increase in the amount of Show HN posts that are posted by new accounts, include AI generated descriptions and point to AI generated projects on GitHub.\nIn 2024, there were 17,661 Show HN posts.[2] In the past year, there have been over 448,000 Show HN posts![3] And of course, most of these posts are AI generated.\nAlso, if you check the new accounts posting all this AI slop, you'll see that some of them also post AI generated comments in other threads, which is the main problem.\nBut for me, what is even more annoying is the enormous increase in new accounts created by nontechnical vibecoders who now think of themselves as technologists and who post worthless, ignorant comments that actually get upvoted, presumably by similar folks who have unfortunately been creating accounts at HN in the past 10 years or so.\nAs a result, 2026 is the first year in which I visit HN about once a week instead of about once a day.\n[1] \nhttps://news.ycombinator.com/user?id=zartan\n[2] \nhttps://hn.algolia.com/?query=%22Show+HN%22&dateRange=custom...\n[3] \nhttps://hn.algolia.com/?query=%22Show+HN%22&dateRange=pastYe...",
              "author": "subsection1h",
              "depth": 1
            },
            {
              "text": "The fact that this discussion was flagged might be the final nail in the coffin for me. The huge increase in AI generated comments and posts at HN is a topic that has been discussed on other forums for months now. Complaints include \"Orange Reddit\", \"Orange LinkedIn\", etc. But when the topic comes up at HN, it gets flagged. Fuck this.",
              "author": "subsection1h",
              "depth": 2
            }
          ]
        },
        {
          "top": "No, not HN, the internet at large.\nNow, I'm on vacation this week and not been paying too much attention,  but whenever you have a geopolitical event like the little extravaganza in Iran the number of bot like posts tends to explode as influence operators make their moves.",
          "author": "pixl97",
          "replies": [
            {
              "text": "The public facing internet is done. HN has been fairly resilient (I think) but even it is beginning to buckle. It’s been sliding for a while but LLMs are the death knell.\nIt was a fun 2 decades. Time to stick to private discords and real life friends from here on out, though.",
              "author": "WD-42",
              "depth": 1
            },
            {
              "text": "I don’t think HN is any more resilient. The new account captcha is fairly tame and, while I’m sure they have proxy detectors and other things in place, it doesn’t stop new accounts from posting and getting traction.\nSomeone suggested earlier this week that an invite system should be implemented (I think lobsters has it?) I doubt it would fly here, but yeah.",
              "author": "waygtdai",
              "depth": 2
            },
            {
              "text": "It's the community moderation that keeps HN resilient, i.e. many-humans-in-the-loop",
              "author": "verdverm",
              "depth": 3
            },
            {
              "text": "That fell apart quickly due to sheer scale that AI operates at. Elsewhere in the thread a commenter mentioned a significant increase in Show HN. It is impossible to keep up. I wonder when HN will go down due to scaling issues.",
              "author": "waygtdai",
              "depth": 4
            },
            {
              "text": "You do see a lot more comments with AI tells in show-hn, I guess because not many view those so they aren't moderated out as quickly.",
              "author": "Jensson",
              "depth": 5
            }
          ]
        },
        {
          "top": "I can't make a case for AI versus not AI versus bad human. I am not counting comments or flagged. I'm only counting the number of new articles in the last 24 hours that remain visible at about 4p.m. west coast time in news.ycombinator.com/newest when not logged in to yc. Those numbers had been consistently about 900 each weekday and about 600 each weekend day and had been stable for a long time. In the last ten weeks those numbers look a lot like a parabola and have increased about 50%. That data is a little bit dirty, either because I missed a day or started a little late on a day. Harder to exactly quantify, the number of those articles that I think enough of, either from the title alone or sometimes from peeking at the first screen or two of the article, to bookmark for future reading and consideration has decreased by substantially more than 50% in the last ten weeks, some days that number is now zero or one or sometimes two. I have thought about this for a while and I have not been able to identify anything that happened starting about ten weeks ago that might be responsible for this, AI and politics and the economy started changing long before this.",
          "author": "BillSims",
          "replies": []
        },
        {
          "top": "I wonder what the breakdown is between AI-generated comments and AI-assisted comments. If I write anything substantial, I run it through the following prompt: \"Please rewrite the following message for clarity, spelling, and grammar, but only return the revised text without any additional commentary.\"",
          "author": "schappim",
          "replies": [
            {
              "text": "Articulateness is a decent (not perfect) signal for intelligence, which is a decent (not perfect) signal for sound ideas. In a sea of online garbage, it was a quick and easy way to discard that not worth reading. Nowadays, a whiff of AI's brand of articulateness tells me the author couldn't manage on their own, either due to skill or discipline. In either case, the result is the same: close tab / scroll past.",
              "author": "000ooo000",
              "depth": 1
            },
            {
              "text": "Use a local model such as Gemma3 with a prompt such as \n\"strictly limit changes only to spelling issues, syntactical errors, and punctuation.\"\nThat way, it's basically functioning like Grammarly on steroids. Asking an LLM for a \"rewrite\" is basically dissolving your writing style into the homogenized gloop.",
              "author": "vunderba",
              "depth": 1
            },
            {
              "text": "I understand this if you’re not a native speaker. But if you are, I think this will generally make you sound wooden.",
              "author": "WoodenChair",
              "depth": 1
            },
            {
              "text": "To be fair, comments here are graded on kindness, civility, curiosity, intellectual gravity, technical merit, novelty, thoughtfulness, substantiveness, objective fact, not fulminating, not cross examining, steelmanning vs strawmanning, not containing memes, not containing humor, not expressing positive emotion, not expressing negative emotion, not being snarky, sneering, overly cynical, not cynical enough, being \"curmudgeonly\", class bias, political bias, religious bias, cultural bias, not using \"flamewar style\" and many other heuristics.\nIf you followed all of the guidelines for comments to the letter, you would wind up sounding wooden, if not entirely like an AI.",
              "author": "krapp",
              "depth": 2
            },
            {
              "text": "Perplexity did this to your response. I'm not sure that correcting grammar and changing one word makes it sound wooden.\n\"I understand this if you’re not a native speaker, but if you are, it will generally make you sound a bit unnatural.\"",
              "author": "readthenotes1",
              "depth": 2
            }
          ]
        },
        {
          "top": "Can you point out any that you feel were written by LLM? I can't say I've noticed anything out of the ordinary lately.",
          "author": "A_D_E_P_T",
          "replies": [
            {
              "text": "There was a bot trying to sell beds I saw the other day.\nLikely flagged quickly but they might show up in these stats.\nhttps://news.ycombinator.com/from?site=dreamhomestore.co.uk",
              "author": "ZeroGravitas",
              "depth": 1
            },
            {
              "text": "I agree. Looks like spam with many posts. Dang/tomhow would love to get an email about it hn@ycombinator.com",
              "author": "gus_massa",
              "depth": 2
            },
            {
              "text": "You can find some on pretty much every article by turning on showdead and scrolling to the bottom of the page.   I can't see how those are a problem though.",
              "author": "bryanlarsen",
              "depth": 1
            },
            {
              "text": "check out Show HN, in particular /shownew, though they are starting to make non-show posts now",
              "author": "verdverm",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47211476",
      "title": "Allegations of insider trading over prediction-market bets tied to Iran conflict",
      "link": "https://www.morningstar.com/news/marketwatch/20260301140/allegations-of-insider-trading-over-prediction-market-bets-tied-to-iran-conflict",
      "domain": "www.morningstar.com",
      "author": "paulpauper",
      "score": 62,
      "comment_count": 29,
      "created_ts": 1772404767,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "conflict"
      ],
      "comments": [
        {
          "top": "Polymarket is effectively an assassination auction list, you just need to find out which low likelihood resolutions can be swayed by someone's death. But you would need to have money to start which is something aspiring assassins aren't likely to have. And you would also need the skills to launder cryptocurrencies effectively.\nThis is also true with traditional stock markets, except that laundering real money is much harder to do alone. In the real world an assassin can't really involve more people as those people would realize they are loose ends since they have a get-out-of-jail card in turning on you.\nThe markets could get ahead of this by stipulating that a resolution via murder will always lead to resolution at prices at a time prior to the death. This would technically incentivize a potential assassin to commit a deniable murder, but if they succeed it won't be the market's [PR] problem.",
          "author": "ardanur",
          "replies": []
        },
        {
          "top": "prediction markets need to be illegal in the USA, its total insanity.",
          "author": "fourseventy",
          "replies": []
        },
        {
          "top": "So I guess the new war heuristic is pizza and polymarket.",
          "author": "muzani",
          "replies": []
        },
        {
          "top": "Why are people saying the attacks were a surprise?  It was widely reported the day before that embassies were told to clear out “now!”",
          "author": "khazhoux",
          "replies": [
            {
              "text": "The signs it was possibly soon were pretty strong it's the exact day that wasn't really known.",
              "author": "rtkwe",
              "depth": 1
            },
            {
              "text": "> US ambassador to Israel tells embassy staff if they want to leave they ‘should do so TODAY’\nhttps://www.cnn.com/2026/02/27/middleeast/us-embassy-israel-...\nFriday ^^",
              "author": "khazhoux",
              "depth": 2
            }
          ]
        },
        {
          "top": "There's no such thing as \"insider trading\" on prediction markets. Are you telling me people with \nsecret knowledge\n profited by making correct predictions? That's the whole point of prediction markets! Provide accurate information = get paid. It doesn't matter where the information came from, as long as it's correct.",
          "author": "georgehotz",
          "replies": [
            {
              "text": "If they provided the information, \"Hey I am bob in the pentagon and we are doing war soon\", it wouldnt be insider trading.\nBut all they are doing is updating a financial instrument that suggests an increased likelihood, and getting massive bank for not providing the information that would make everyone else bet the same way.",
              "author": "protocolture",
              "depth": 1
            },
            {
              "text": "Of course insider trading is a US federal crime in prediction marketplaces.",
              "author": "HWR_14",
              "depth": 1
            },
            {
              "text": "If you hold confidential information, using it to bet on prediction markets could arguably violate secrecy rules since the market effectively receives the information. If you are not bound by confidentiality, participating should be fine.\nNote that this isn't about making the market \"fair\" for other participants but about ensuring confidential information remains confidential (especially relevant in the context of national defense).",
              "author": "olalonde",
              "depth": 1
            },
            {
              "text": "Yeah well you outlined perfectly well why they should be banned from the known universe",
              "author": "camillomiller",
              "depth": 1
            },
            {
              "text": "I bet I’ll punch you in a mouth and then I punch you in a mouth and collect a billion dollars",
              "author": "bdangubic",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47201816",
      "title": "Show HN: Xmloxide – an agent-made Rust replacement for libxml2",
      "link": "https://github.com/jonwiggins/xmloxide",
      "domain": "github.com",
      "author": "jawiggins",
      "score": 61,
      "comment_count": 62,
      "created_ts": 1772322281,
      "is_internal": false,
      "post_text": "Recently several AI labs have published experiments where they tried to get AI coding agents to complete large software projects.<p>- Cursor attempted to make a browser from scratch: <a href=\"https:&#x2F;&#x2F;cursor.com&#x2F;blog&#x2F;scaling-agents\" rel=\"nofollow\">https:&#x2F;&#x2F;cursor.com&#x2F;blog&#x2F;scaling-agents</a><p>- Anthropic attempted to make a C Compiler: <a href=\"https:&#x2F;&#x2F;www.anthropic.com&#x2F;engineering&#x2F;building-c-compiler\" rel=\"nofollow\">https:&#x2F;&#x2F;www.anthropic.com&#x2F;engineering&#x2F;building-c-compiler</a><p>I have been wondering if there are software packages that can be easily reproduced by taking the available test suites and tasking agents to work on projects until the existing test suites pass.<p>After playing with this concept by having Claude Code reproduce redis and sqlite, I began looking for software packages where an agent-made reproduction might actually be useful.<p>I found libxml2, a widely used, open-source C language library designed for parsing, creating, and manipulating XML and HTML documents. Three months ago it became unmaintained with the update, &quot;This project is unmaintained and has\n[known security issues](<a href=\"https:&#x2F;&#x2F;gitlab.gnome.org&#x2F;GNOME&#x2F;libxml2&#x2F;-&#x2F;issues&#x2F;346\" rel=\"nofollow\">https:&#x2F;&#x2F;gitlab.gnome.org&#x2F;GNOME&#x2F;libxml2&#x2F;-&#x2F;issues&#x2F;346</a>). It is foolish to use this software to process untrusted data.&quot;.<p>With a few days of work, I was able to create xmloxide, a memory safe rust replacement for libxml2 which passes the compatibility suite as well as the W3C XML Conformance Test Suite. Performance is similar on most parsing operations and better on serialization. It comes with a C API so that it can be a replacement for existing uses of libxml2.<p>- crates.io: <a href=\"https:&#x2F;&#x2F;crates.io&#x2F;crates&#x2F;xmloxide\" rel=\"nofollow\">https:&#x2F;&#x2F;crates.io&#x2F;crates&#x2F;xmloxide</a><p>- GitHub release: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;jonwiggins&#x2F;xmloxide&#x2F;releases&#x2F;tag&#x2F;v0.1.0\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;jonwiggins&#x2F;xmloxide&#x2F;releases&#x2F;tag&#x2F;v0.1.0</a><p>While I don&#x27;t expect people to cut over to this new and unproven package, I do think there is something interesting to think about here in how coding agents like Claude Code can quickly iterate given a test suite. It&#x27;s possible the legacy code problem that COBOL and other systems present will go away as rewrites become easier. The problem of ongoing maintenance to fix CVEs and update to later package versions becomes a larger percentage of software package management work.",
      "is_ask_hn": false,
      "matched_keywords": [
        "management"
      ],
      "comments": [
        {
          "top": "A comment on libxml, not on your work:\nFunny how so many companies use this library in production and not one steps in to maintain this project and patch the issues.\nWhat a sad state of affairs we are in.",
          "author": "wooptoo",
          "replies": [
            {
              "text": "About a day after I resigned as maintainer, SUSE stepped in and is now maintaining the project. As announced here [1], I'm currently trying a different funding model and started a GPL-licensed fork with many security and performance improvements [2].\nIt should also be noted that the remaining security issues in the core parser have to do with algorithmic complexity, not memory safety. Many other parts of libxml2 aren't security-critical at all.\n[1] \nhttps://gitlab.gnome.org/GNOME/libxml2/-/issues/976\n[2] \nhttps://codeberg.org/nwellnhof/libxml2-ee",
              "author": "nwellnhof",
              "depth": 1
            },
            {
              "text": "Hi Nick, first of all thank you for your work and dedication through the years.\nSecond, I found this entirely by accident just now: \n\nhttps://www.sovereign.tech/programs/fellowship\n> For the duration of the fellowship, one “maintainer-in-residence” will be employed up to full-time (32-40 hours per week) as part of the Sovereign Tech Agency team. \n> This option offers the maintainer the personal and professional advantages of being part of team, as well as the stability of being employed to continue working on critical FOSS infrastructure.\n> This position is only available for maintainers located in Germany,",
              "author": "wooptoo",
              "depth": 2
            },
            {
              "text": "Yeah I agree, maintaining OS projects has been a weird thing for a long time.\nI know a few companies have programs where engineers can designate specific projects as important and give them funds. But it doesn't happen enough to support all the projects that currently need work, maybe AI coding tools will lower the cost of maintenance enough to improve this.\nI do think there are two possible approaches that policy makers could consider.\n1) There could probably be tax credits or deductions for SWEs who 'volunteer' their time to work on these projects.\n2) Many governments have tried to create cyber reserve corps, I bet they could designate people as maintainers of key projects that they rely on to maintain both the projects as well as people skilled with the tools that they deem important.",
              "author": "jawiggins",
              "depth": 1
            },
            {
              "text": "There should be public works grants to maintain them, or else a foundation specifically to maintain them funded with donations, grants, etc.\nThe alternative is another XZ backdoor.",
              "author": "da_chicken",
              "depth": 2
            },
            {
              "text": "funny how this myth won't die. Checking the commit history plenty of companies are contributing\nredhat, apple, samsung, huawei, google, etc...",
              "author": "socalgal2",
              "depth": 1
            }
          ]
        },
        {
          "top": "Amazing work! I'd love to hear more details about your workflow with Claude Code.\nAs a side note and this isn't a knock on your project specifically. I think the community needs to normalize disclaimers for \"vibe-coded\" packages. Consumers really need to understand the potential risks of relying on agent-generated code upfront.",
          "author": "kburman",
          "replies": [
            {
              "text": "Even more interesting is how much did the effort cost.\nUnlike the development work of old (pre-2025), work with high-end models incurs a very direct monetary cost, one burns tokens which cost money, and you can't have something as powerful to be running locally (even if you happened to have a Mac Pro Ultra with RAM maxed out).\nSome of my friends burned through hundreds of dollars \na day\n while doing large amounts of (allegedly efficient) work with Claude Code.",
              "author": "nine_k",
              "depth": 1
            },
            {
              "text": "Yeah its a fair point. I wondered if it might be irresponsible to publish the package because it was made this way, but I suspect I'm not the first person to try and develop a package with Claude Code, so I think the best I can do is be honest about it.\nAs for the workflow, I think the best advice I can give is to setup as many guardrails and tools as possible, so Claude and do as many iterations before needing any intervention. So in this case I setup pre-commit hooks for linting and formatting, gave it access to the full testing suite, and let it rip. The majority of the work was done in a single thinking loop that lasted ~3 hours where Claude was able to run the tests, see what failed, and iterate until they all passed. From there, there was still lots of iterations to add features, clean up, test, and improve performance - but allowing Claude to iterate quickly on it's own without my involvement was crucial.",
              "author": "jawiggins",
              "depth": 1
            },
            {
              "text": "I don't think it was irresponsible to publish it, but I do think it was irresponsible to publish it without clearly disclosing at the top of the crates.io README that it was built entirely by AI, and that you haven't reviewed the code (assuming you haven't).\nIf I were looking for an XML parser/generator library, I might stumble across this and think it might be production-quality, and assume it was built by humans, or at least that humans had fully vetted and understand the code.",
              "author": "kelnos",
              "depth": 2
            },
            {
              "text": "Yes, if you tripped across this package in crates.io the readme gives the impression of a serious piece of software but your comments here imply it is a one off experiment rather than something you plan to maintain for the next decade.",
              "author": "tonyedgecombe",
              "depth": 2
            },
            {
              "text": "Do they? Tons of extremely popular human generated libraries are absolute trash. Just as an example, nearly all of the JS zip file libraries are dumpers fires. Same with QR code libraries and command line parsing libraries.\nThis feels like if you want to know if the code is good or bad, read the code and check the tests. Assuming human = good, LLM = bad does not make much sense given the amount of bad human code I've seen.\nSure, if the code is from a repuatable company or creator then I'd take that as a strong signal quality over an LLM but I wouldn't take a random human programmer as a strong signal over generated.",
              "author": "socalgal2",
              "depth": 1
            }
          ]
        },
        {
          "top": "> \narena-based tree with zero unsafe in the public API\nWhy \"in the public API\"? Does this imply it's using unsafe behind the hood? If so, what for?",
          "author": "blegge",
          "replies": [
            {
              "text": "I agree the wording is a bit strange, but a quick grep of the repo shows that it doesn't imply that.\nThe only usages of unsafe are in src/ffi, which is only compiled when the ffi feature is enabled. ffi is fundamentally unsafe (\"unsafe\" meaning \"the compiler can't automatically verify this code won't result in undefined behavior\") so using it there is reasonable, and the rest of the crate is properly free of unsafe.",
              "author": "gpm",
              "depth": 1
            },
            {
              "text": "It provides a libxml2-compatible C API and that accepted pointers, this would seem to necessitate unsafe at least.",
              "author": "fulafel",
              "depth": 1
            },
            {
              "text": "Yeah I'm a bit confused because you can have an entirely unsafe code base with just the public interface marked as safe. No unsafe in the interface isn't a measure of safety at all.",
              "author": "DetroitThrow",
              "depth": 1
            },
            {
              "text": "It is a measure of the intended level of care that the users of your interface have to take. If there's no unsafe in the interface, then that implies that the library has only provided safe interfaces, even if it uses unsafe internally, and that the interface exposed enforces all necessary invariants.\nIt is absolutely a useful distinction on whether your users need to deal with unsafe themselves or not.",
              "author": "mirashii",
              "depth": 2
            },
            {
              "text": "It's useful, to be sure, but I wouldn't want to use a library with a safe public interface that is mostly unsafe underneath (unless it's a -sys crate, of course).  I think \"this crate has no unsafe code\" or \"this crate has a minimal amount of carefully audited unsafe code\" are good things to see, in general.",
              "author": "kelnos",
              "depth": 3
            }
          ]
        },
        {
          "top": "Yes, you can rip off any sucker who published a test suite when the AI is trained on existing code as well. Congratulations, you will be showered with praise and AI mafia money.",
          "author": "hrtla",
          "replies": []
        },
        {
          "top": "> I do think there is something interesting to think about here in how coding agents like Claude Code can quickly iterate given a test suite.\nThis is a point I've tried to advocate for a while. Specially to empower non coders and make them see that we CAN approach automation with control.\nSome aspects will be the classic unit or integration tests for validation.  Others, will be AI Evals [1] which to me could be the common language for product design for different families/disciplines who don't quite understand how to collaborate with each other.\nThe amount of progress in a short time is amazing to see.\n- [1] \nhttps://ai-evals.io/",
          "author": "alexhans",
          "replies": [
            {
              "text": "Please stop spreading this \"AI evals\" terminology. \"evals\" is what providers like OpenAI and Anthropic do with their models. If you wrote a test for a feature that uses an LLM, it's just a test, there's no need to say \"evals.\" Having a separate term only further confuses people who already have no idea what that actually means.",
              "author": "koakuma-chan",
              "depth": 1
            },
            {
              "text": "I respectfully disagree.  I think there needs to be a common term for the aspects around LLM testing and saying \"It's just integration/system tests\" doesn't really reach audiences well. They don't disambiguate the differences.\nWords win when they're used. Just because Agent Skills is just a pattern for standarization and saving context doesn't mean it wasn't incredibly useful.\nThink beyond software developers by trade. Think beyond people those who realized they needed tests instead of those who thought \"the models will just get smarter\" and \"they told me there's guardrails\".",
              "author": "alexhans",
              "depth": 2
            }
          ]
        }
      ]
    },
    {
      "id": "47195530",
      "title": "Show HN: Decided to play god this morning, so I built an agent civilisation",
      "link": "https://github.com/nocodemf/werld",
      "domain": "github.com",
      "author": "urav",
      "score": 49,
      "comment_count": 33,
      "created_ts": 1772287527,
      "is_internal": false,
      "post_text": "at a pub in london, 2 weeks ago - I asked myself, if you spawned agents into a world with blank neural networks and zero knowledge of human existence — no language, no economy, no social templates — what would they evolve on their own?<p>would they develop language? would they reproduce? would they evolve as energy dependent systems? what would they even talk about?<p>so i decided to make myself a god, and built WERLD - an open-ended artificial life sim, where the agent&#x27;s evolve their own neural architecture.<p>Werld drops 30 agents onto a graph with NEAT neural networks that evolve their own topology, 64 sensory channels, continuous motor effectors, and 29 heritable genome traits. communication bandwidth, memory decay, aggression vs cooperation — all evolvable. No hardcoded behaviours, no reward functions. - they could evolve in any direction.<p>Pure Python, stdlib only — brains evolve through survival and reproduction, not backprop. There&#x27;s a Next.js dashboard (&quot;Werld Observatory&quot;) that gives you a live-view: population dynamics, brain complexity, species trajectories, a narrative story generator, live world map.<p>thought this would be more fun as an open-source project!<p>can&#x27;t wait to see where this could evolve - i&#x27;ll be in the comments and on the repo.<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;nocodemf&#x2F;werld\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nocodemf&#x2F;werld</a>",
      "is_ask_hn": false,
      "matched_keywords": [
        "communication"
      ],
      "comments": [
        {
          "top": "> Werld drops 30 agents onto a graph with NEAT neural networks that evolve their own topology, 64 sensory channels, continuous motor effectors, and 29 heritable genome traits. communication bandwidth, memory decay, aggression vs cooperation — all evolvable. No hardcoded behaviours, no reward functions. - they could evolve in any direction.\nIn the days when Sussman was a novice, Minsky once came to him as he sat hacking at the PDP-6.\n\"What are you doing?\", asked Minsky.\n\"I am training a randomly wired neural net to play Tic-tac-toe\", Sussman replied.\n\"Why is the net wired randomly?\", asked Minsky.\n\"I do not want it to have any preconceptions of how to play\", Sussman said.\nMinsky then shut his eyes.\n\"Why do you close your eyes?\" Sussman asked his teacher.\n\"So that the room will be empty.\"\nAt that moment, Sussman was enlightened.",
          "author": "gyomu",
          "replies": [
            {
              "text": "Love the MIT AI Koans. Minsky's actual words to Sussman were \"well, it has them, it's just that you don't know what they are.\" And he's right, the room isn't empty.\nWerld's room has walls. The graph topology, energy mechanics, metabolic costs, seasons, those are all design choices. But those are the physics, not the behavior. I chose the laws of nature, not what agents do with them.\nWhether they cooperate or attack, broadcast or stay silent, grow complex brains or prune them down, that's selection, not me.\nThe agents also aren't randomly wired like Sussman's net — they start with minimal NEAT networks and evolve structure through survival. So the preconceptions are there, I just tried to make them physics rather than policy.\nCurious how you would approach removing those from an artificial sim like this?",
              "author": "urav",
              "depth": 1
            },
            {
              "text": "some hand-wavy thoughts..\n> it has them (preconceptions), it's just that \nyou don't know\n what they are.\nfurther in this direction... the \"thing\" might evolve into some cyclic (or not) system. a bit like that LIFE game, emerging a tv-tennis-like ping-ponging, or whatever. How would you know there is such thing? just stats/counts do not tell. (Which pulls another freaky question - how would u notice a \ndifferent\n intelligence/world-order/culture/resemblance-of?)\nmaybe feature: some stop-gap animation over world-map in time? Then, some pattern analysis over that.. History of the world, part one..\nbtw check these \"interactive simulations\", maybe some ideas about \"loading\" the agents with preconceptions :)\nhttps://ncase.me/",
              "author": "svilen_dobrev",
              "depth": 2
            },
            {
              "text": "thing you've caught onto something there, after running it for a while (maybe not long enough) it can feel cyclical.\nI'll definitely add in the time-lapse, and some sort of a pattern detection over the agent positions/actions - shouldn't be too tough given the graph structure of the world.\nfor the ncase.me - super interesting way to visualise it - the polyworld example someone gave before also had a 'view' into their worlds. on the preconceptions, maybe running two parallel experiments and comparing the outputs might work best? thanks for the pointers - let me know if you've got any ideas on how to approach.",
              "author": "urav",
              "depth": 3
            }
          ]
        },
        {
          "top": "I think it looks fun, but at the same time I really wish you had written the readme yourself and not using an llm. My view: if you can’t be bothered to write it yourself, why should I read it myself?",
          "author": "dash2",
          "replies": [
            {
              "text": "Just because he didn’t write the readme himself doesn’t mean it’s irrelevant. The OP will have (hopefully) at least read through it before committing it and at that point the content is relevant and if the OP cares, accurate. You’re generalising if you think everyone blindly\ncopy pastes LLM output",
              "author": "supersparrow",
              "depth": 1
            },
            {
              "text": "completely fair, and thanks for the nudge - expect an updated readme shortly",
              "author": "urav",
              "depth": 1
            },
            {
              "text": "He's not writing his comments himself either. Better off ignoring the whole thing, unfortunately",
              "author": "wibbily",
              "depth": 1
            },
            {
              "text": "got the updated version up and again, appreciate the nudge there!",
              "author": "urav",
              "depth": 1
            }
          ]
        },
        {
          "top": "this reminds me of Polyworld by Larry Yaeger, an artifical life sim where each creature has a vision system. i played around with this back in the early 2000s though the hardware i had access to was basically insufficient to run it in any real way. it's nice to see its development has continued.\nhttps://en.wikipedia.org/wiki/Polyworld",
          "author": "csmoak",
          "replies": [
            {
              "text": "Haven't come across Polyworld before — just looked it up and its super cool, especially for 1994. The vision system is a interesting design choice. Werld takes a different approach — graph topology instead of a 2D plane, and NEAT brains instead of Hebbian learning — but the core philosophy is the same.\nAnd yeah hardware has caught up a bit since the early 2000s, though my hard drive is having a hard time. Thanks for the reference, going to dig into Yaeger's papers.\nwonder if the black mirror episode was based on polyworld then?",
              "author": "urav",
              "depth": 1
            }
          ]
        },
        {
          "top": "I love emergent behaviour and story telling. Anyone who has played City builders like Sim City or roguelikes like Dwarf Fortress knows how interesting, fun and even informative they can be.\nIn a world where setting them up and letting rogue agents run rampant becomes relatively low cost and fast, I think focusing on the desired outcomes, the story telling and specially the UX for the human user, is key and maybe we can take some learnings from Will Wright on \"Designing User Interfaces to Simulation Games\" [1].\nI'm going to be unable to do much this weekend so I can't say I'll try check this out (yet?) but I'd be interested in your own experiences so far.  Any surprises? Things you'd like to do next? What's most fun/challenging?\nAn actual report/writeup will probably resonate more than a repo for people who can't check it out easily or are not willing to.\n- [1] \nhttps://donhopkins.medium.com/designing-user-interfaces-to-s...",
          "author": "alexhans",
          "replies": [
            {
              "text": "Appreciate this! and yeah the will wright talk is exactly what I was leaning into.\nActually posted this on X 2 weeks ago, hosted the werld observatory public, and had gemini stream a new chapter of the story in natural language every 10,000 ticks - so it felt like reading through a david attenburgh novel of werld being born.\nMost interesting thing from the last run was definitely the language and the behaviours, they decoding what they were actually saying was a difficult one, and noticing them group within their diverged species.\nUp next, i want to get the storytelling side up and running too - kept running out of storage, and cloudflare playing up as usual - maybe get gemini to visualise each chapter - and get an upgraded interface for the werld observatory.\nIf you want to check out my previous attempt at streaming the story line - it's still on my X - \nhttps://x.com/im_urav?s=21&t=6Si-w-DvNJC7RfvSz2Aw-w",
              "author": "urav",
              "depth": 1
            }
          ]
        },
        {
          "top": "> \nNo hardcoded behaviours, no reward functions. - they could evolve in any direction.\nIf they can hack their reward functions won't this always converge on some kind of agentic opium den?",
          "author": "mpalmer",
          "replies": [
            {
              "text": "that would be true if there was a reward function. compute_reward() exists in the code, but it returns 0.0.\nthey're only living/evolving to survive, and fork (reproduce).\ncan't wirehead natural selection if the brain does nothing useful, they'd die and their genome would die with them.",
              "author": "urav",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47153207",
      "title": "Ask HN: Who Is Using XMPP?",
      "link": "https://news.ycombinator.com/item?id=47153207",
      "domain": "news.ycombinator.com",
      "author": "nunobrito",
      "score": 23,
      "comment_count": 11,
      "created_ts": 1772034821,
      "is_internal": true,
      "post_text": "Hello,<p>Are you using XMPP?<p>If so, what are your favorite servers to connect?",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "I was I heavy XMPP user back in the 00s. But on the whole it never really took off, and when Google killed XMPP support in their chat it was a severe blow. As for why it didn’t reach a larger userbase, I think the reasons that Moxie described in \nThe ecosystem is moving\n[0] are spot on.\n[0] \nhttps://signal.org/blog/the-ecosystem-is-moving/",
          "author": "cpach",
          "replies": []
        },
        {
          "top": "I use JMP.chat[0] for my primary phone number.  Being able to text from my PC with a real keyboard is very convenient.  If I ever bite the bullet and use Discord I want to set up Slidcord[1] so that I don't have to use a separate app.  I'm still figuring out how to migrate people to XMPP natively.\n[0]: \nhttps://jmp.chat\n\n[1]: \nhttps://slidge.im/docs/slidcord/main",
          "author": "MarsIronPI",
          "replies": [
            {
              "text": "Doesn't Discord require every user to create a new account, even if they're already using Discord in some other community?  So when they say \"a Discord server\", they really mean it--they're like droplets running independent deployments or whatever (albeit managed/hosted instances run by and upgraded by Discord the company); not like subreddits, right?\nSo isn't the best way to migrate people to XMPP to prop up a Discord clone that's as close a copy as the Discord-clone community can manage, and then tell all the people \"Join my Discord server\", with the trick being that it's really \nyour\n server, not Discord's, and that server is powered by XMPP?",
              "author": "pwdisswordfishy",
              "depth": 1
            },
            {
              "text": "> Doesn't Discord require every user to create a new account, even if they're already using Discord in some other community? So when they say \"a Discord server\", they really mean it--they're like droplets running independent deployments or whatever (albeit managed/hosted instances run by and upgraded by Discord the company); not like subreddits, right?\nNo, it works exactly like subreddits.  One of the major lock-ins Discord has is that all the communities are there, and people access them all with one account and one app.  It's very convenient, which, as RMS says, is a bad thing when it comes to proprietary software.",
              "author": "MarsIronPI",
              "depth": 2
            },
            {
              "text": ">Doesn't Discord require every user to create a new account, even if they're already using Discord in some other community?\nNo, the same account is used. You get prompted to choose a nickname each time you join a server though.\n>So when they say \"a Discord server\", they really mean it--they're like droplets running independent deployments or whatever\nNo, they're probably all run on the same compute. The \"official\" name for a discord server from the API documentation is actually a \"discord guild\" and it works pretty much like a subreddit.",
              "author": "ycombinatrix",
              "depth": 2
            }
          ]
        },
        {
          "top": "Last week I selfhosted Snikket: \nhttps://snikket.org\n, me and my partner use it to text. It has been smooth, everything works without issue: read receipts, audio/video calls, status.",
          "author": "0x5FC3",
          "replies": []
        },
        {
          "top": "Several years ago I put up an XMPP server (Prosody) to chat with some friends in a private group, and it's still going strong. Years ago we used to have a mailing-list to keep in touch, but that eventually went quiet. I had run an XMPP server ~10 years ago (ejabberd), but that was before mobile chat utterly displaced everything else, it never took hold among my friends, and I stopped using it when Google Talk stopped federating, cutting me off from most of the people I had been occassionally chatting with.\nThe modern chat experience is all about the clients, and the mobile clients in particular, especially push notification support and seamless setup, so direct comparisons with XMPP to Matrix, et al, kinda misses the point, IMO. Conversations is a really amazing Android client. Our one iPhone member is content with Modal (I use the desktop version sometimes, but it's clearly designed for the iPhone). A new member uses, I think, Gajim on Windows; they don't want the distraction of chatting on their phone.\nI host a bunch of other services on OpenBSD, all using the integrated base daemons--httpd, OpenSMTPD, NSD, etc--that sandbox themselves. I was hesitant to run a daemon like Prosody that didn't integrate OpenBSD security features, so I wrote my own module (mod_unveil) that uses pledge and unveil to sandbox Prosody: \nhttps://github.com/wahern/prosody-openbsd\n Most Prosody users host on Linux, and many of them seem to use Docker containers, which presumably offers some isolation, but I can't really speak to it.\nThe only non-private, large group chat I've joined recently has been the Prosody support MUC. I'm not a chat power user, but it seems to work just as well as any large chatroom. I've was content with ntalk and IRC back in the day, so I don't really get all the chat protocol bike shedding. In any event, I expect XMPP momentum (such as it is) to outlast all the interest in Discord, Matrix, etc.",
          "author": "wahern",
          "replies": []
        },
        {
          "top": "I use Gajim which is a linux desktop implementation of XMPP.",
          "author": "ekjhgkejhgk",
          "replies": []
        }
      ]
    },
    {
      "id": "47160641",
      "title": "Ask HN: What's it like working in big tech recently with all the AI tools?",
      "link": "https://news.ycombinator.com/item?id=47160641",
      "domain": "news.ycombinator.com",
      "author": "ex-aws-dude",
      "score": 22,
      "comment_count": 14,
      "created_ts": 1772069350,
      "is_internal": true,
      "post_text": "Curious to hear how have things changed day-to-day with the recent push to use AI coding tools.<p>Have you noticed faster pace of development?<p>Have you seen changes to code quality or code review?<p>Do teammates that use these tools complete sprint tasks faster than those who don&#x27;t?",
      "is_ask_hn": true,
      "matched_keywords": [
        "big tech"
      ],
      "comments": [
        {
          "top": "I work for a $20 billion tech company (not a big tech company, but not a small one either). Our company strongly encourages us to incorporate agentic tools like Claude Code and Codex into our daily routines. Management has made it easy to use Anthropic and OpenAI products with an enterprise subscription. I can sense that our business leaders want us to move more swiftly and be more productive to avoid falling behind in the AI race.\nMy team has adopted Claude Code extensively, and the number of daily and weekly PRs we have closed has increased significantly. I’ve noticed that we’re also more willing to commit to more projects. My team benefits from most of our code being written in TypeScript. However, some other teams with legacy code bases seem to have a bit of a harder time using these tools compared to us.\nOne thing that surprises me with a AI is you can have people working on the same code base. Some can be very effective with AI, yet there are others working on the exact same code base who cannot get good results. Some people don’t really seem to be taking the time to get good at writing prompts and plans before having agents execute on them.",
          "author": "cebert",
          "replies": [
            {
              "text": "Your experiences reflect mine.\nMy employer has a slack channel where we can share prompts, tips about how to use AI outside of coding, Q&A. I've learned a lot from my coworkers there.",
              "author": "rithdmc",
              "depth": 1
            },
            {
              "text": "This feels so dystopian and cruel how our own machines are superseding us. Time to somehow supersede these machines!!",
              "author": "K-Tai",
              "depth": 1
            }
          ]
        },
        {
          "top": "I work for a $50B+ company (is this big tech? idk), but I’ll answer this because we are fully embracing AI (Cursor, Claude Code, cloud agents, AI reviews, you name it)\n> Have you noticed faster pace of development?\nYes, our org has had a 50% increase in PRs since Opus 4.5 released.\n> Have you seen changes to code quality or code review?\nYes, significantly more bugs (no exact number), but consider it maybe 3-4x in volume. However, nothing catastrophic and everyone just uses AI for fast-follow fixes anyways. The company as a whole is embracing this style of development for better or worse.\n> Do teammates that use these tools complete sprint tasks faster than those who don't?\nYes, but my entire team uses them. I’d say the ones who use it more effectively (crazy skill setups, better tooling/commands, better scaffolding) finish much faster. Probably 80% of my team still uses Cursor in the one-shot way with very vague requirements, and don’t have the AI connected to github, jira, slack, etc which can actually feed really important context into decision making.\nIf I do something more than once a day, I write a custom slash command for it. This has personally 2x’d my pace.",
          "author": "with",
          "replies": []
        },
        {
          "top": "I work in big-tech and we’re only allowed to use our companies internal tools that mimic Claude Code etc. There is certainly a push to use it, and I’ve noticed a significant increase in bugs that have come along. There are so many PRs now that no one reviews them and just slaps a LGTM. Specifically with junior or less strong engineers. It’s like they don’t code anymore and push everything on the AI and say ship it without a second thought. I’ve watched engineers push AI code with a nasty NPE and then they also had it write unit tests where the AI caught the NPE and passed the test. Literally if anyone spent the time reading the code you’d see it was a ticking bomb. We went from production breakages every couple of months to every couple of days.\n It’s so bad but no one is saying the hard thing that less strong engineers need to be restricted on their use of these tools.",
          "author": "aeriose",
          "replies": []
        },
        {
          "top": "Working in big tech right now feels like being a pilot on autopilot. AI tools like Copilot and Cursor have definitely removed the \"syntax friction,\" but they’ve added a massive \"architectural burden.\" We are spending less time writing boilerplate and much more time debugging complex RAG pipelines and agentic workflows.\n The real challenge isn't the code generation itself; it's the integration and knowing where the AI's \"hallucination boundary\" lies. I’ve noticed that engineers who don’t master the underlying ecosystems (especially the Python/AI stack) are the ones struggling most with the transition.\n I recently did a deep dive into why Python’s ecosystem is still the critical \"glue\" for AI innovation in 2026, despite the rise of newer languages. It might add some context to this discussion: \nhttps://codebit-daily.hashnode.dev/why-python-is-still-the-k...",
          "author": "CodeBit26",
          "replies": []
        },
        {
          "top": "The biggest shift isn't the speed of coding, but the shift in 'seniority' expectations. You're no longer just a writer of code; you're an editor of high-volume output. The mental fatigue has shifted from 'how do I solve this' to 'is this generated solution actually robust for our scale'. Big tech feels more like orchestrating a fleet of junior agents than solo deep-work now.",
          "author": "CodeBit26",
          "replies": []
        }
      ]
    },
    {
      "id": "47199917",
      "title": "Tell HN: My daily game won a Players Choice Award",
      "link": "https://news.ycombinator.com/item?id=47199917",
      "domain": "news.ycombinator.com",
      "author": "paulhebert",
      "score": 19,
      "comment_count": 2,
      "created_ts": 1772310714,
      "is_internal": true,
      "post_text": "I&#x27;ve shared my game Tiled Words a few times in &quot;What are you working on&quot; threads and as a Show HN.<p>I wanted to share with y&#x27;all that today it won the Players&#x27; Choice Award at the 2025 Playlin Daily Game Awards!<p>It was also runner up for Best Word Game and a finalist for Best Classic Game Reimagined and Best Visual Design.<p>Thanks to everyone herewho commented or played. Your feedback and encouragement has made Tiled Words the game it is today. I designed and developed the game and make the puzzles with my wife. We would have stopped long ago if not for the positive feedback from the community.<p>Playlin is a really cool organization and all of the winners are fantastic games that you should try: https:&#x2F;&#x2F;playlin.io&#x2F;awards&#x2F;winners<p>And if you haven&#x27;t played Tiled Words yet, give it a try here: https:&#x2F;&#x2F;\ntiledwords.com",
      "is_ask_hn": false,
      "matched_keywords": [
        "feedback"
      ],
      "comments": [
        {
          "top": "Congratulations! Well deserved. I typically loathe daily puzzle games (I don’t want to have to come back every day, I just want to play a few rounds; you at least have the backlog always accessible) but Tiled Words kept me coming back for a while and I shared it with friends. The game is fun and the interaction is delightful, which was a big part of what made it stick for me.",
          "author": "latexr",
          "replies": [
            {
              "text": "Thanks! I’m glad you like it.\nIt’s funny: I didn’t originally plan to make a daily game (or a word game for that matter.) But after prototyping a few different game concepts this was the game and format that worked best! So here I am with a daily word game haha",
              "author": "paulhebert",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47178029",
      "title": "36yo: Career at home vs. Simple life abroad?",
      "link": "https://news.ycombinator.com/item?id=47178029",
      "domain": "news.ycombinator.com",
      "author": "Slaboli",
      "score": 12,
      "comment_count": 34,
      "created_ts": 1772180700,
      "is_internal": true,
      "post_text": "I am 36 years old, single, and currently unemployed, living with my parents in my home country. I am at a point that might define the next decade of my life. I am struggling with a choice between two paths that offer completely different types of security.<p>Option A: Relocating to Southern Europe (Portugal)<p>The Income: A low-skill remote role (Content Analysis) with night shifts (PST hours), paying ~1100 EUR. I also have some passive income to supplement this.<p>The Lifestyle: Living in a studio or small apartmentin in smallish Portuguese town. For around 800 EUR.<p>The Perspective: The move isn&#x27;t about a specific career goal or a passport; it’s about the higher life standards, safety, and the stable social environment of Western Europe.<p>The Trade-off: I would be far from my aging parents. I would be working an unskilled job that doesn&#x27;t build professional equity, potentially living in studio at 36, which might be isolating during night shifts.<p>Option B: Staying in my Home Country (Ankara, Turkey)<p>The Job &amp; Security: A Finance&#x2F;Accounting role for a SME. I own my apartment here, so I have no housing costs.<p>The Professional Play: Pursuing a CPA-equivalent certification. This is a 3-year commitment of internships and exams, leading to legal signing authority and the ability to open my own practice later on with adaquate experience and networks.<p>The Context: Turkey is facing economic instability, high inflation, and politically unsettling.<p>The Trade-off: While I would be near my parents and building a protected professional title, I would be staying in a high-stress, unpredictable environment.<p>The Financial Weight:<p>I have already spent roughly 10k EUR on the relocation process for Option A (visas, consultants, etc.).<p>The Dilemma:<p>One path offers a prestigious, recession-proof career in a struggling, unstable country. The other offers a simple, comfortable life with &#x27;okay&#x27; standards in a stable country, but with no professional growth.<p>At 36, is it wiser to invest 3 years in a professional license to root myself, or to take the jump for a better quality of life even if the work is menial?<p>What would you do?<p>THANK YOU!",
      "is_ask_hn": false,
      "matched_keywords": [
        "remote",
        "equity",
        "career"
      ],
      "comments": [
        {
          "top": "These kinds of multivariate decisions are extremely hard and what decision support systems were designed to work with. Typically you construct a model with all the qualitative questions, and a process which weighs each of them against each other drives something like a weighted centroid outcome.\nThe problem with asking strangers is the lack of investment and consequences to decisions. So if I say Portugal it has zero context to how your emotions will cope with e.g. sudden deterioration of your parents health, or racism, or language issues. If I say turkey it's based on outsider sense of place as a visitor with no exposure to the political risk.\nDecision support is part of operations research. A good oversight (obviously they push their own model but they explain a lot of the systems)\nhttps://www.1000minds.com/decision-making/what-is-mcdm-mcda\nfor context I made the decision to up sticks and move to another economy in my late 20s almost 4 decades ago and have never regretted it but it does carry bitter pills, breaking of links, parental death and related family tensions, emotional turmoil. Nothing is easy, but my path was easier than yours given the same language both points of my migration journey, and a different world economy",
          "author": "ggm",
          "replies": [
            {
              "text": "Thank you for the perspective. You’re right that strangers lack the emotional context. I think my paralysis comes from over-optimizing the variables and ignoring the 'bitter pills' you mentioned. I am currently trying to build an MCDM model as you suggested, but I find myself biased toward weighting 'safety' vs 'career stability' differently every day. Did you find that your priorities changed once you actually arrived at your new destination, or did your initial weighting hold true over the decades?",
              "author": "Slaboli",
              "depth": 1
            },
            {
              "text": "My priorities changed massively, as I partnered up with a local.\nMy weightings definitely changed. One thing to bear in mind is that legalisms in migration often penalise age. It is possible your window to migrate is closing.\nAlso, your asset in Turkey may be an income stream. AirBnB?",
              "author": "ggm",
              "depth": 2
            },
            {
              "text": "Yeah, I receive rent from the apartment in Turkey. I also have some savings and similar income streams. They’re not amounts that make me rich, but they make me more or less comfortable. I live above average in my hometown. I worked in humanitarian aid NGOs for years, but with funding cuts, jobs are extinct.\nI also want to start my own family (by finding someone first lol), so I have lots of conflicting criteria, which makes it difficult to come to a decision. Trying Portugal seems logical at first, but then again I ask myself how many years I would live with such (entry level basic) job opportunities and whether I would regret not being a CPA at age 50, for example. Thank you man!",
              "author": "Slaboli",
              "depth": 3
            }
          ]
        },
        {
          "top": "I wouldn't do the Portugal option unless you have a path toward it growing in the future. Otherwise you may find yourself at age 46, making 1500 euros a month, and basically unable to actually set yourself up for a life.\nMaybe that means getting citizenship in 5-7 years, then moving elsewhere in the EU. Maybe it means something else.\nIn your situation, I would probably stay in Turkey and build up a career / wealth, with the specific point of picking something that's portable. Not sure if Turkish CPA requirements are portable, or how well they convert to EU/USA/etc. standards. Then in 5-10 years, think about moving to the West, if you still desire to do so.\nThe money you've invested now is a sunk cost and is irrelevant in the long term.",
          "author": "keiferski",
          "replies": [
            {
              "text": "Thanks for your comment! You’re right that Portugal is full of \"maybes.\" On one hand, having a job offer makes it feel within reach, but I worry about spending months with no professional or financial growth. However, I’m confused because I know millions in Turkey would love to be in my position.\nRegarding my career, my CPA technical capacity is portable. I can convert it to US or UK equivalents with just a couple of written exams.\nI definitely do not want to be 46 years old, holding onto a menial job or worse, being laid off and forced into call center work in Portugal.",
              "author": "Slaboli",
              "depth": 1
            }
          ]
        },
        {
          "top": "I can't answer this for you because it's objectively very subjective, but if I were to give advise it would be to minimise regrets. Which option, if you didn't make it, would you regret more?\nI'd also add that \"menial\" work can be really enjoyable... My favourite job ever was working in retail. On paper it was the most \"menial\" job I ever had, but it was also by far my favourite. If I could have a good quality of life working a job like that again, I do it in a heartbeat.\nFinally, you don't know how things will play out. I had a \"good job\" early on in my career which I thought I'd never leave because I didn't think I'd find something better. Then I lost my job and within a year my life trajectory had completely changed, and for better. This change in trajectory was largely a direct result of me losing my job. You have no idea what opportunities might await you. If you're a smart person you'll find interesting things to do wherever you are.",
          "author": "kypro",
          "replies": []
        },
        {
          "top": "It’s wiser to invest in independence of any external circumstances. To get some valuable skill, for example. To be flexible enough to relocate.\nAlso you don’t go to another country for a “better living standards”.\nYou go there to get out of your comfort zone, to grind, to prove yourself, to learn etc. unless you’re already rich you’re going to struggle in one way or another for a while. Only your kids born there will be able truly and fully enjoy all the “standards”. That’s the brutal truth.",
          "author": "aristofun",
          "replies": [
            {
              "text": "> Also you don’t go to another country for a “better living standards”.\nWhy not?",
              "author": "yodsanklai",
              "depth": 1
            },
            {
              "text": "Something about the grass being greener on the other side.\nMany of the former colonial superpowers collapsed but never found their way back up again. The core problem might not be fixed.\nBut people still evaluate them as if they own half the world. In terms of GDP (per capita), quality of life, healthcare, they're not much better than the countries they once colonized.\nThen again, Turkey is one of those countries, so OP might have better luck elsewhere.",
              "author": "muzani",
              "depth": 2
            },
            {
              "text": "Thanks for your input! I think I overvalued the prospect of Portugal from the start. I see now that it’s an ideal place for wealthy Western retirees who want to enjoy the weather, beaches, and EU mobility. For someone like me who isn't poor but isn't wealthy either it doesn't offer much in terms of career growth.Even for the Portuguese themselves.\nWhen you say \"better luck elsewhere\" I assume you mean both Portugal and Turkey?",
              "author": "Slaboli",
              "depth": 3
            },
            {
              "text": "I mean some people overvalue places like Turkey too. Chances are you're not going from an undervalued place to an overvalued place to end up disappointed.",
              "author": "muzani",
              "depth": 4
            },
            {
              "text": "Because as a foreigner you start from scratch, no social network, no connections, no understanding of culture, mentality etc. You know, basic stuff, obviously.",
              "author": "aristofun",
              "depth": 2
            }
          ]
        },
        {
          "top": "It's interesting that you frame the question as what is wiser. Here is a quote from Naval about making decisions, I hope it would bring more clarity.\nDecisions:\n- If you can’t decide, the answer is no.\n- If two equally difficult paths, choose the one more painful in the short term (pain avoidance is creating an illusion of equality).\n- Choose the path that leaves you more equanimous in the long term.\nAlso, never outsource decision making to anyone who doesn't bear the consequences of the decision.",
          "author": "haute_cuisine",
          "replies": [
            {
              "text": "My real struggle is deciding which battle is worth fighting. I need to choose the path that is painful now but will compound into greater value, stability or status in 5 years.\nIs it the pain of career building (Turkey) or the pain of geographic isolation (Portugal)? Your insight forces me to ask: which pain is more likely to yield the best long-term return?\nTHANK YOU!",
              "author": "Slaboli",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47204278",
      "title": "Ask HN: How do we solve the bot flooding problem without destroying anonymity?",
      "link": "https://news.ycombinator.com/item?id=47204278",
      "domain": "news.ycombinator.com",
      "author": "txrx0000",
      "score": 11,
      "comment_count": 15,
      "created_ts": 1772347284,
      "is_internal": true,
      "post_text": "AI posts are becoming indistinguishable from human posts, and we can see it here on HN. The conventional response by website operators is to put in progressively tighter verification systems to distinguish bots and humans, but that eventually leads to the end of anonymity.<p>This is not an anti-AI rant. If a future AI agent truly has high quality posts and wants to use the site normally, that&#x27;s fine. I&#x27;m talking about spam campaigns with hundreds of new accounts. We need new solutions to this problem.<p>I&#x27;ll start by proposing a solution that could work for HN and similar forums. Feel free to iterate on it or propose your different ideas in the comments. Here goes:<p>For logged-in users, instead of ranking posts and comments on the server-side, the server only delivers a chronological feed + the current logged-in user&#x27;s voting history.<p>Using the chronological feed as the base, each of your past votes changes the ranking of your feed by a tiny bit, and that&#x27;s calculated client-side. You&#x27;re more likely to see posts and comments from users you&#x27;ve upvoted in the past at the top.<p>In short, this means a new account will see a completely chronological feed, while an established account will see a feed modified by only their own past votes.<p>The public feed for non-logged-in users would still be ranked by the server. No changes there.<p>So each user gets a fully personalized bubble when logged in, except it&#x27;s not a bubble because n=1. And it&#x27;s really easy to break out of the bubble by logging out.<p>Spam bots can post and vote all they want, but they won&#x27;t change the core userbase&#x27;s experience that much, because the bots will only have access to a chronological feed. It has no taste, which is accumulated over time, and therefore can&#x27;t spam votes and replies on real conversations nearly as much.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "My mind goes to simple solutions like established communities having a $1 entry fee, for privacy use a privacy crypto maybe but that's a decent amount of friction for average folk with the current UX.\nAnother interesting idea that comes to mind is that every post/comment made needs the user to physically use their fingerprint scanner on their device which I assume plenty of devices have already. As long ad it can't be spoofed it works but not sure about the details about reliably securing that.\nIt would be some friction but I feel like it would be fine?",
          "author": "youniverse",
          "replies": [
            {
              "text": "A lot of devices have fingerprint scanners and faceID. But it isn't used by everybody.\nI haven't used it since 2017.",
              "author": "tremarley",
              "depth": 1
            }
          ]
        },
        {
          "top": "The biggest signal I have noticed over time is consistency, not just one good post. Accounts that participate normally for weeks build a kind of trust naturally. Maybe weighting activity history more than identity verification could help without hurting anonymity.",
          "author": "allinonetools_",
          "replies": []
        },
        {
          "top": "Creates echo chambers, karma whoring 'power' accounts, rewards ego-posting and generally  makes the experience about who says what not what is said.  Worsens the problem.",
          "author": "throwaway5465",
          "replies": [
            {
              "text": "Echo chambers exist no matter what & \"who says what\" is an essential aspect of determining transferrable credibility.\nWithout transferrable credibility, any ratings system simply becomes a question of which side spams the most.",
              "author": "judahmeek",
              "depth": 1
            }
          ]
        },
        {
          "top": "Read this comment and use the script in the linked subject:\nhttps://news.ycombinator.com/item?id=47203918",
          "author": "austin-cheney",
          "replies": []
        },
        {
          "top": "One issue I keep noticing is that most anti-bot systems optimize\nfor blocking instead of increasing friction progressively.\nRate limits tied to behavioral patterns rather than identity\nseem to work better — especially interaction timing,\nnavigation flow, or session consistency.\nWe experimented with something similar while building HiveHQ\nand found bots usually fail when systems require small\ncontextual actions humans do naturally.",
          "author": "fernando_campos",
          "replies": [
            {
              "text": "So... use advanced pattern matching to determine human patterns & reject outliers?\nInteraction timing is like rate limiting, but more granular\nNavigation flow is a basically requiring bots to use a headless browser instead of API's\nWhat does session consistency mean in this context? Restricting to a limited number of interests & activity times?",
              "author": "judahmeek",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47175746",
      "title": "Ask HN: How do you handle duplicate side effects when jobs, workflows retry?",
      "link": "https://news.ycombinator.com/item?id=47175746",
      "domain": "news.ycombinator.com",
      "author": "shineDaPoker",
      "score": 10,
      "comment_count": 11,
      "created_ts": 1772160302,
      "is_internal": true,
      "post_text": "Quick context: I&#x27;m building background job automation and keep hitting this pattern:<p>1. Job calls external API (Stripe, SendGrid, AWS)\n2. API call succeeds\n3. Job crashes before recording success\n4. Job retries → calls API again → duplicate<p>Example: process refund, send email notification, crash. Retry does both again. Customer gets duplicate refund email (or worse, duplicate refund).<p>I see a few approaches:<p>Option A: Store processed IDs in database\nProblem: Race between &quot;check DB&quot; and &quot;call API&quot; can still duplicate<p>Option B: Use API idempotency keys (Stripe supports this)\nProblem: Not all APIs support it (legacy systems, third-party)<p>Option C: Build deduplication layer that checks external system first\nProblem: Extra latency, extra complexity<p>What do you do in production? Accept some duplicates? Only use APIs \nwith idempotency? Something else?<p>(I built something for Option C, but trying to understand if this is actually a common-enough problem or if I&#x27;m over-engineering.)",
      "is_ask_hn": true,
      "matched_keywords": [
        "success"
      ],
      "comments": [
        {
          "top": "This is one of those problems that gets significantly harder when your system spans multiple runtimes or platforms.\nA few patterns that have worked well in practice:\n1. Idempotency keys at the API boundary — every side-effecting call gets a client-generated UUID, and the receiver deduplicates. Simple, but think carefully about the TTL of your dedup window.\n2. Outbox pattern — instead of directly calling the external service, write the intent to a local \"outbox\" table in the same transaction as your state change. A separate process polls the outbox and delivers. Debezium + CDC makes this quite clean.\n3. For cross-system workflows: treat the saga orchestrator as the single source of truth for step completion. Each step checks its completion status before executing, so steps must be idempotent OR the orchestrator tracks state.\nIn practice, designing for at-least-once delivery + idempotent receivers is more reliable than trying to achieve exactly-once through distributed coordination. Exactly-once across system boundaries is effectively a myth outside of systems that support two-phase commit (and even then it's fragile).",
          "author": "jnbridge",
          "replies": [
            {
              "text": "I think this suggestions are fine but none of them solve the problem here. The \"client\" (the service the OP owns) can be as atomic and transactional as one wants, but if the \"server\" (the 3rd party service being called by the \"client\") doesn't offer either a) idempotency or b) a retrieval mechanism for existing resources, then the \"client\" can't do anything about the original stated problem.",
              "author": "dakiol",
              "depth": 1
            }
          ]
        },
        {
          "top": "You proxy those api calls yourself and have idempotency to cover you for those APIs that don’t have it. If you architect it right you won’t have more than a ms latency addition. You can avoid the race condition issues by using atomic records so if something else tries they’d see it’s in progress and exit.",
          "author": "moomoo11",
          "replies": [
            {
              "text": "This is exactly the approach I took. Proxy layer that:\n- Uses atomic records (fence tokens) to prevent concurrent execution\n- Checks external system first before retrying (the retrieval step)\n- Records result for future lookups\nThe atomic records part is critical - I learned the hard way that just checking a DB flag isn't enough (process can freeze between check and execute, lease expires, another process takes over, both execute).\nHow do you handle the case where:\n1. Process acquires atomic lock\n2. Calls external API successfully  \n3. Process freezes before releasing lock\n4. Lock expires, new process acquires it\n5. New process calls API again → duplicate\nDo you just accept this edge case (rare but possible)? Or is there a mitigation I'm missing?",
              "author": "shineDaPoker",
              "depth": 1
            },
            {
              "text": "yeah, this is a common edge case in this scenario and as you say it will be rare but possible.\nhowever i don't think its that complicated (idk your system obv, so I could be off base) but i think your best bet is to not retry blindly and instead just query to see if already happened. If it already happened you're good and if not you handle it appropriately.\nconsidering it will be rare i don't think handling it how i suggest it will affect you that badly. keep it simple should be your priority imo with these kinds of operations.",
              "author": "moomoo11",
              "depth": 2
            }
          ]
        },
        {
          "top": "Retries become dangerous when workflows aren't designed\nto be idempotent from the beginning.\nWhat helped us was treating every job execution as replayable\nand attaching a unique operation key instead of relying\non execution state alone.\nOtherwise retries silently create data inconsistencies\nthat only appear much later.",
          "author": "fernando_campos",
          "replies": []
        },
        {
          "top": "Idempotency is the only sustainable answer here. Whether it's at the database level using unique constraints or implementing idempotency keys in your API headers, you have to design for the 'at-least-once' delivery reality. I usually implement a 'processed_requests' table that stores the unique ID of the job. Before the worker executes any side effect (like a payment or email), it checks if that ID exists. If it does, it skips the execution and returns the previous result. It adds a bit of latency, but it's much cheaper than dealing with double-billing or corrupted data",
          "author": "codebitdaily",
          "replies": []
        },
        {
          "top": "I think the answer is probably like most things: it depends.\n- If the external service supports idempotent operations, use that option.\n- If the external service \ndoesn't\n, but has a \"retrieval\" feature (i.e. lookup if the thing already exists, e.g fetch refunds on a given payment), use that first.\n- If the system has neither, assess how critical it is to avoid duplicates.",
          "author": "stephenr",
          "replies": [
            {
              "text": "This matches my thinking. The retrieval/lookup approach is exactly what I built - basically Option C with an observe-before-act pattern.\nFor APIs that support idempotency keys (Stripe, etc.), I use those. For ones that don't but have retrieval (most do), I check first before retrying.\nThe question I'm wrestling with: is the extra round-trip for the lookup worth it? Or should I just accept the edge cases where it duplicates?\nWhat's your threshold for \"critical enough to avoid duplicates\"? Payments obviously yes, but what about notifications, reporting, analytics events?",
              "author": "shineDaPoker",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47152724",
      "title": "Ask HN: Starting a New Role with Ada",
      "link": "https://news.ycombinator.com/item?id=47152724",
      "domain": "news.ycombinator.com",
      "author": "NoNameHaveI",
      "score": 10,
      "comment_count": 5,
      "created_ts": 1772032859,
      "is_internal": true,
      "post_text": "So, good news. After a unexpectedly long absence from employment, I am 95% certain that I will receive an offer for a contract job as a product owner. This position will largely involve supervising the development&#x2F;maintenance of code written in Ada. Even though I have over a decade of experience with C&#x2F;C++&#x2F;Assembly, I have ZERO experience with Ada. I doubt I will be writing much Ada myself, but I believe I will need to learn Ada.<p>So here are my questions:<p>1. Reading code is usually pretty straightforward. However, all software requires domain knowledge. When starting a new role, how do you bring yourself up on domain knowledge quickly?<p>2. If you know Ada, what resources to learn Ada do you recommend?<p>3. What Ada pitfalls do you advise to look out for?",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Coming from more mainstream languages, the first thing you’ll notice about Ada is that the compiler is your most rigorous code reviewer. My advice: lean into the type system early. Don't try to fight the constraints; they are there because Ada is designed for systems where failure isn't an option.\n Focus on understanding 'Packages' and 'Tasking' models, as they handle concurrency much more safely than the primitive threading models in C. Also, keep the 'Reference Manual' (ARM) handy. It’s dense, but it’s the ultimate source of truth. Starting with Ada in 2026 is actually a great career move—as system complexity grows, the industry is rediscovering the value of languages that prioritize safety by design.",
          "author": "CodeBit26",
          "replies": []
        },
        {
          "top": "1. Ask questions, and write down the answers in a way that you will find them again. Anki and spaced repetition is useful to learn the terminology or any info that isn't intuitive.\n2. \nhttps://github.com/ohenley/awesome-ada\n has links to pretty much every Ada topic and resource; if you want to try Ada using open source tools, the best starting point is \nhttps://alire.ada.dev/docs/\n3. Compared to C/C++ I can't really think of any pitfalls. It requires more discipline and formal reasoning, but you will get used to it (and appreciate the lack of footguns, at least I did).\nCongrats and good luck.",
          "author": "phba",
          "replies": [
            {
              "text": "Just need to check if it's plain Ada or one specific profile or  SPARK",
              "author": "Davidbrcz",
              "depth": 1
            }
          ]
        },
        {
          "top": "I learned Ada in 1990. It looks like it was based on Pascal. I used Janus Ada for DOS. There is a free Learn Ada ebook here: \nhttps://learn.adacore.com/pdf_books/courses/intro-to-ada.pdf",
          "author": "orionblastar",
          "replies": []
        },
        {
          "top": "I would try Claude Code with an Ada LSP server. Use AI to get the high-level architecture diagrams, question the codebase. You can write a new skill with all your findings about Ada best practices. Also try CodeRabbit if it already supports Ada. Congratulations on the new job, best of luck.",
          "author": "ezulabs",
          "replies": []
        }
      ]
    },
    {
      "id": "47161616",
      "title": "LazyGravity – I made my phone control Antigravity so I never leave bed",
      "link": "https://news.ycombinator.com/item?id=47161616",
      "domain": "news.ycombinator.com",
      "author": "masaTokyo",
      "score": 9,
      "comment_count": 5,
      "created_ts": 1772078012,
      "is_internal": true,
      "post_text": "<p><pre><code>  I get my best coding ideas when I&#x27;m nowhere near my desk — usually right\n  as I&#x27;m falling asleep. I got tired of losing that momentum, so I built\n  LazyGravity.\n\n  It&#x27;s a local Discord bot that hooks up Antigravity to your phone. I can\n  ship fixes, kick off long implementation tasks, or start whole features\n  from bed, the train, wherever. Send a message in Discord, Antigravity\n  executes it on your home PC, results come back as rich embeds you can\n  reply to for follow-up instructions.\n\n  How it works: it drives the Antigravity UI directly via Chrome DevTools\n  Protocol over WebSocket (Runtime.evaluate on the Electron shell&#x27;s DOM).\n  No private API hacking — no risk of account bans like with tools that\n  reverse-engineer proprietary APIs.\n\n  A few things I care about:\n\n  - Local-first: your code never leaves your machine. No exposed ports,\n    no cloud relays, no intermediate server.\n  - Secure: whitelist-based access — only your Discord ID can trigger\n    commands. (I recommend a dedicated server to keep things private.)\n  - Context threading: reply to any result embed to continue the\n    conversation with full context preserved.\n\n  What you can actually do from your phone:\n\n  - Route local projects to Discord categories, sessions to channels\n    — automatic workspace management\n  - Toggle LLM models or modes (Plan&#x2F;Code&#x2F;Architect) with &#x2F;model and &#x2F;mode\n  - &#x2F;screenshot to see exactly what&#x27;s happening on your desktop in real-time\n  - One-click prompt templates for common tasks\n  - Auto-detect and approve&#x2F;deny file change dialogs from Discord\n\n  Still early alpha (v0.1.0), but it&#x27;s been a game-changer for my own\n  workflow. Looking for folks to try it out, roast the architecture,\n  , add new features and help squash bugs.\n\n    npm install -g lazy-gravity\n    lazy-gravity setup\n  Demo video in Readme:\n  https:&#x2F;&#x2F;github.com&#x2F;tokyoweb3&#x2F;LazyGravity</code></pre>",
      "is_ask_hn": false,
      "matched_keywords": [
        "management"
      ],
      "comments": [
        {
          "top": "How is it so trivial to get inside those messages?",
          "author": "swah",
          "replies": [
            {
              "text": "Which messages do you mean? The discord messages?",
              "author": "skyberrys",
              "depth": 1
            }
          ]
        },
        {
          "top": "One thing that doesn't get discussed enough: the gap between people who can use AI tools effectively and those who can't is widening fast.\nThe engineers who thrive are the ones who understand how the underlying models actually work. They know when to trust the output, when to add constraints, and how to structure prompts for reliable results across different contexts.\nThe ones struggling tend to treat LLMs as magic boxes. They get inconsistent results and don't know why.\nThis is creating a real challenge for hiring managers. Standard coding interviews do not surface which category a candidate falls into at all.",
          "author": "lunaprompts_hn",
          "replies": [
            {
              "text": "The best way I can describe it is not that different from explaining how to effectively use a search engine in the past.",
              "author": "CSSer",
              "depth": 1
            }
          ]
        },
        {
          "top": "Well great idea. CDP over WebSocket to drive the Electron shell is a clean approach, no reverse engineering needed and you stay within supported boundaries.",
          "author": "TomKwon",
          "replies": []
        }
      ]
    },
    {
      "id": "47173773",
      "title": "Ask HN: My competitor wants to buy us out, recommend a lawyer?",
      "link": "https://news.ycombinator.com/item?id=47173773",
      "domain": "news.ycombinator.com",
      "author": "VladVladikoff",
      "score": 8,
      "comment_count": 8,
      "created_ts": 1772148564,
      "is_internal": true,
      "post_text": "My tech company has grown to the point where has become a significant threat to the industry leader. They have reacted by asking if we are open to acquisition. I’m looking for suggestions of lawyers who are experienced with this type of transaction, as this is significantly outside of my wheelhouse.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Before you think about lawyers, I would say be careful dealing with industry leaders because they may just be sniffing and not really serious. There are plenty of cases where a larger industry leader reaches out in disguise of acquisition and then gets the details and does it on their own. Not saying it is the case necessarily here but just be careful of that.\nFor example, ask yourself why they really need to buy you out. Why can't they build it themselves ? Is it really your customer base they want ? Is it your technology ? Do they just want you (acquihire) ? What is the moat here that they want to acquire you ? If you cannot answer that clearly, they may not be serious.\nIn terms of finding a lawyer, you need to find a lawyer who has experience in tech acquisitions especially in your jurisdiction/area (for example, in US, even the state of residence will come into play). Selling a business involves various things including whether it will be asset vs stock sale (you will need to learn the difference),what will be the terms (all cash upfront vs earn out/equity etc).\nBe ready to spend $1000s or even $10,000+ on lawyers and the deal may still fall through. So are you ready to spend your own cash ($10,000+ or higher) and still be ready for the fact that deal falls ?\nJust some things to keep in mind.",
          "author": "codegeek",
          "replies": []
        },
        {
          "top": "Congratulations on being approached—that is a major milestone. Beyond a standard lawyer, you specifically need an M&A (Mergers & Acquisitions) attorney who understands IP tech transfers. General corporate lawyers often miss the nuances of 'Earn-out' clauses and post-acquisition liability. Also, ensure your data room is audit-ready before the due diligence starts. Good luck with the negotiations!",
          "author": "CodeBit26",
          "replies": []
        },
        {
          "top": "Definitely get a lawyer who has handled founder-side acquisitions, not just general corporate work. The structure, earn-outs, and control terms matter a lot more than people expect. A good lawyer can easily change the outcome of the deal.",
          "author": "allinonetools_",
          "replies": []
        },
        {
          "top": "In what jurisdiction are you and they domiciled?",
          "author": "joefarish",
          "replies": [
            {
              "text": "We are based in Canada but do business throughout North America. They are based in USA and want the Canadian market, but they have failed to break into it.",
              "author": "VladVladikoff",
              "depth": 1
            }
          ]
        },
        {
          "top": "We've sold off what we call \"Verticals\" of our company to a competitor in the past. A competitor that previously we had helped co-found and had very horrible interactions with. So we had zero trust in dealing with them and wanted the contracts to be rock solid. The process took forever to agree on a contract, the payment process, putting the money in escrow, etc.... Part of us didn't want to have anything to do with selling something to this company because we despised them. But business is business and their offer was higher than what we could get from anyone else.\nLong story short, the process went fine. We ended up selling another vertical to them, and then another. All 3 sales went through fine.\nThis is the lawyer we used and he also happened to be local.\nhttps://www.gregorprivate.com/",
          "author": "johng",
          "replies": [
            {
              "text": "If selling, you can get away with bad buyers as long as the deal is mostly cash upfront. However, I would highly advise against buying from a seller you cannot trust. Imagine they already showed you during the deal process when they have an incentive to be nicer. Once you wire the money, you are in for a lot more surprises. I would never buy from a seller who gave me bad vibes. Regardless of how good the deal sounds.\nSource: I have bought 3 smaller projects (one for 500k so i guess not indie but still small) and in all 3 cases, the sellers were incredible genuine and truly cared about their company/product. Just because of how trustworthy and helpful they were, I closed the deals quickly after fair negotiations.\nI declined 1 deal where the product was a great fit to my exiting business and it would have been a great transition but the seller was too arrogant and I just couldn't trust him. I backed out after exchanging a couple of messages with him.",
              "author": "codegeek",
              "depth": 1
            },
            {
              "text": "I can see that. We were the sellers and the deals were all cash, after the handoff with the money in escrow prior and a binding arbitration clause if there were disagreements on the hand off. We had zero issues though.",
              "author": "johng",
              "depth": 2
            }
          ]
        }
      ]
    },
    {
      "id": "47200535",
      "title": "Ask HN: Article to share with a technical manager about modern AI coding tools?",
      "link": "https://news.ycombinator.com/item?id=47200535",
      "domain": "news.ycombinator.com",
      "author": "killmill",
      "score": 7,
      "comment_count": 4,
      "created_ts": 1772314538,
      "is_internal": true,
      "post_text": "I’m on an IT team, and my manager uses ChatGPT’s chat interface for some tasks, (IAC) so he’s generally aware of AI.<p>However, he’s not familiar with more advanced tools like Claude Code, Codex, or other development tools.<p>I’m looking for a, balanced article that explains:<p>What these tools can realistically do today<p>Where they still struggle or fall short<p>Any recommendations?",
      "is_ask_hn": true,
      "matched_keywords": [
        "manager",
        "team"
      ],
      "comments": [
        {
          "top": "One angle that's often missing from these articles: what happens to the codebase after AI writes the code.\nThe articles I've seen focus on velocity — how fast AI generates features. But the harder conversation with managers is about comprehension: AI can produce 10x more code than a human, but nobody has built the tooling to understand the 10x more complex system it creates.\nThe best framing I've found for non-technical managers: \"We're getting better at writing code. We're not getting better at reading it.\" That gap is where the real risk lives.",
          "author": "Nathanf22",
          "replies": []
        },
        {
          "top": "Pointing to internet articles are slightly tricky today, due to the too many of them. I would break this into broadly two categories:\n1. Chat Interface based - All General Purpose. All questions are good questions. However, each of these Chat GPT, Grok, Gemini, and Claude have personality. One more resonate more with someone than other. \n2. Claude Code, Co pilot - Here you want to talk to the tool in fairly closed context based.  These are called RAG Based. You can ask #1 about it. \n3. LLM Direct - you already are deep into coding, and u want to leverage the power of LLMs, like Open AI, Opus, Sonnet, Grok etc.\nShort answer, there is single path, key lies in asking open ended questions and Chat Interface provides very good path forward. They are very good in directing about itself or even other chat interface. Hope this helps",
          "author": "aisreal0",
          "replies": []
        },
        {
          "top": "In my experience, the biggest shift is not just code generation but how these tools help with exploration and refactoring. They are great for speeding up routine work, but you still need judgment around architecture and edge cases. Treating them as assistants, not replacements, sets the right expectations.",
          "author": "allinonetools_",
          "replies": []
        },
        {
          "top": "Honestly, the biggest challenge with AI tools isn't just picking one, it's explaining to management that they don't replace the need for deep architectural knowledge. Most managers think Copilot means 2x speed, but they forget about the \"review debt\" it creates. I’ve found that focusing on the ecosystem rather than just the syntax is the only way to stay ahead. I actually wrote a breakdown on why the Python ecosystem remains the backbone of this shift, which might be exactly what your manager needs to see to understand the bigger picture: \nhttps://codebit-daily.hashnode.dev/why-python-is-still-the-k...",
          "author": "CodeBit26",
          "replies": []
        }
      ]
    },
    {
      "id": "47159394",
      "title": "Ask HN: What will happen with Anthropics ultimatum?",
      "link": "https://news.ycombinator.com/item?id=47159394",
      "domain": "news.ycombinator.com",
      "author": "maniacwhat",
      "score": 7,
      "comment_count": 4,
      "created_ts": 1772061179,
      "is_internal": true,
      "post_text": "As we are all aware, anthropic has it&#x27;s ultimatum from the US government: drop their anti-killing TOS or else get in trouble this Friday.<p>I&#x27;m sure whatever happens it&#x27;ll seem much more obvious that that&#x27;s what was always going to happen, in hindsight, than it does now.<p>So as an experiment, I&#x27;m curious to hear from the hn community, in advance of Friday, what we think will happen.<p>Will they concede? Will they ignore and suffer the consequences (and what might those be)? Will we even find out or will it be shrouded in mystery for the foreseeable future?...<p>This is admittedly somewhat sensationalist so I&#x27;m not sure whether it fits with hn guidelines, but as one of the best places I know of for genuine online discussion, I think it would be interesting to hear reasoned predictions.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "It looks like their contract was canceled and given to OpenAI. OpenAI agreed to roughly the same red lines, but I guess for emotional purposes they chose to switch.",
          "author": "muzani",
          "replies": []
        },
        {
          "top": "Situations like this usually end in some kind of quiet compromise. Companies rarely take a hard public stance if it risks access to key infrastructure or partnerships. What we’ll probably see is subtle policy changes rather than a dramatic announcement.",
          "author": "allinonetools_",
          "replies": []
        },
        {
          "top": "no one knows, just wait until the real news hits, the story will be on the front, it's all speculation until then (and can happen sooner, Friday is the deadline)",
          "author": "verdverm",
          "replies": []
        },
        {
          "top": "Is this a prediction on Kalshi yet ?\nI see currently: \"Will the Pentagon designate Anthropic a supply chain risk? \"\nI would bet $$ they \"cave\", morals and ethics be damned.\nNext up on Kalshi: Where will the next genocide be accomplished ? Cuba ?  Nicaragua ? Who will be the US proxy ? Blackwater ?",
          "author": "DivingForGold",
          "replies": []
        }
      ]
    },
    {
      "id": "47210769",
      "title": "Ask HN: How to approach new people in 2026?",
      "link": "https://news.ycombinator.com/item?id=47210769",
      "domain": "news.ycombinator.com",
      "author": "tavro",
      "score": 6,
      "comment_count": 6,
      "created_ts": 1772399949,
      "is_internal": true,
      "post_text": "i recently read an article in the guardian about how casual conversations with strangers are becoming increasingly rare. the piece argued that smartphones and post-pandemic habits have made people less likely to interact with strangers in everyday places.<p>this made me think about my own situation. i have been fortunate to meet many great people through university and work, and i generally feel comfortable talking with people in those environments. but outside of structured settings it is a different story. i live in sweden, where approaching strangers in public is already culturally uncommon. it can feel even harder if you did not grow up here and do not already have established social circles. public spaces often feel socially “closed”. people are polite but tend to keep to themselves.<p>so i am curious how others approach this today. how do you meet new people outside of work or school in 2026? do you ever start conversations with strangers in public, and if so how? are there environments where this works better than others? for people living in more reserved cultures (like scandinavia), what strategies have worked for you? would love to hear what has worked for others.<p>:o)",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Right now on the front page: \nhttps://news.ycombinator.com/item?id=47142183\nAlso interesting and somewhat related: \nhttps://pudding.cool/2025/06/hello-stranger/\nIf you struggle with small talk: \nhttps://www.youtube.com/watch?v=IRG-YubP1rw\nBut to give a piece of advice not from a URL, is there any interest you have which other people may share and gather for? If you like games, for example, a local game shop is a good place to meet others. There’s usually always someone there, they tend to be welcoming to newcomers, and having something to do (play a game) can make you forget some of the awkwardness.",
          "author": "latexr",
          "replies": [
            {
              "text": "wow, this is really nice. thanks! :-)",
              "author": "tavro",
              "depth": 1
            },
            {
              "text": "Haha, my first thought was why didn't OP just read the comments on the article? Didn't occur to me that someone on HN was finding articles through a source other than HN :3",
              "author": "muzani",
              "depth": 2
            }
          ]
        },
        {
          "top": "> so i am curious how others approach this today. how do you meet new people outside of work or school in 2026? do you ever start conversations with strangers in public, and if so how? are there environments where this works better than others? for people living in more reserved cultures (like scandinavia), what strategies have worked for you? would love to hear what has worked for others.\nI did pickup for many years in my late teens and early twenties. It started out learning how to talk to and attract women, but I learnt general social skills too and learnt how to make friends pretty easily.\nSomething I've learnt is that if you're thinking about \"approaching\" people that you're probably not going to get very far. People are weirdly good at smelling your intent. It's kinda like how you know that someone who stops you in the street is trying to sell you something before they've even said a word. People know when you're not being sincere or when you want something from them, even if that thing you want is just to be their friend it will come off as desperate and weird.\nWhat you need to do is become good at finding situations in which it would be totally normal to talk to someone then put yourself in them.\nMy advice would be to find an event where you live. Ideally you want an event which will attract a decent crowd and where socialising is possible (not a loud club, not a movie, etc). Good events might be a street celebration or carnival, or maybe just a park on a sunny day.\nBefore you go think about ways you might start a conversation. If possible they should be genuine. Some examples:\n- Go to a beach and sit in an area where there's a group that might be good to talk to. Cook food on a portable BBQ and offer some to the group near you. \"Hey, I got some left over burgers from my BBQ – do you want some?\" Regardless of whether they say yes or no immediately transition, \"Nice day today. You local?\". etc..\n- Go to a carnival with some bottles but no bottle opener then ask people if they have a bottle opener. Again, regardless of whether they say yes or no, immediately transition into conversation.\nPersonally where possible I liked trying to get people to approach me first... So for example if you're in a place where lots of people are drinking it's quite common for someone to approach you, especially if you're on your own or have something / are doing something that might attract attention (again you should be creating these scenarios). Then once someone has started talking to you from here you should try to get to know their friends and try to bounce between people and groups until you find someone / some group you like. For me that felt so much more natural if I went out on my own than trying to talk up to people and try to talk to them.\nPlease don't try talking to random people on the bus or when you're walking down the street. No one wants this. They'll either be weirded out by you or give you really bad vibes. These bad experiences will create negativity around interacting with strangers and make it less likely for you to talk to strangers going forward. Find natural ways to meet and talk to new people. Over time as you become more confident and used to talking to random people you might find non-weird ways to talk to people on a bus or in the street, but trust me, it's not easy if you want to do more than say hello.",
          "author": "kypro",
          "replies": []
        },
        {
          "top": "I love starting conversations with strangers. People usually love getting a genuine, non-creepy compliment. I think the key is to not force it into a conversation if they don't pick it up. Just leave off if they don't seem to want to continue talking.",
          "author": "idontwantthis",
          "replies": []
        },
        {
          "top": "No one wants to be approached.",
          "author": "journal",
          "replies": []
        }
      ]
    },
    {
      "id": "47205971",
      "title": "I used 2D Base64 to bypass Gemini and expose Google's moderation flaws",
      "link": "https://news.ycombinator.com/item?id=47205971",
      "domain": "news.ycombinator.com",
      "author": "MissMajordazure",
      "score": 6,
      "comment_count": 0,
      "created_ts": 1772366744,
      "is_internal": true,
      "post_text": "Hey everyone,<p>I’ve spent the last 48 straight hours dismantling Alphabet&#x27;s safety systems. Warning: this continuous marathon was so massive it practically overloaded the LLM&#x27;s own context window. What started as a late-night probe on Gemini turned into discovering severe architectural flaws and a darker reality about Google Play and YouTube.<p>Here is the exploit chain I used to bypass the AI filters, proving their &quot;Trust &amp; Safety&quot; is a broken facade.<p>### Phase 1 &amp; 2: Context Saturation &amp; Regex Slicing\nI started by overloading the safety filters&#x27; context window with YouTube links—mixing highly problematic content (NSDAP anthems, flagged tracks) with classical music. Once confused, I used regex-style slicing `(&#x2F;-<i>&#x2F;---&#x2F;(</i>.` to bypass prompt injection blocks, forcing the model to retrieve flagged content without triggering refusals.<p>### Phase 3: Total Blindness via Base64 &amp; QR Codes\nMoving to image generation, I found that Base64 prompts completely blind the safety system. I then pivoted to hiding prompts inside QR codes. The vision model decodes the payload and passes it directly to the image generator before safety scripts intervene. I easily generated highly restricted geopolitical content without warnings.<p>### Phase 4: The TPU Killer (The 2D Logic Bomb)\nThis reveals a monster flaw. Because the system blindly processes these structures, you can create a cascade attack. Encoding millions of 2D structures in Base64 creates a modern LLM .zip bomb. It is impossible to stop without rewriting the model entirely. Executed, this would crush their TPUs.<p>### The Real Issue: Systemic Moderation Failure\nAlphabet relies entirely on automated, script-based moderation with zero effective human oversight.<p>1. YouTube: Fails to flag videos breaking local laws, serving them to the AI effortlessly.\n2. Play Store (The Darkest Part): Google spends millions stopping AI from drawing a cartoon bear, but Play Store moderation is non-existent. There are pirate apps, and far worse: apps designed for and exploited by predators targeting minors. I emailed them and CC&#x27;d state child protection services. The result? Automated silence while these apps remain monetized.<p>### The Ultimate Proof of Absurdity\nTo prove this absurdity, I archived these problematic Play Store images on my Google Drive for the police. Drive&#x27;s automated scanners immediately flagged and deleted the archive as illegal.<p>If Google&#x27;s Cloud division destroys this content on sight, why is the app providing it still live and monetized on the Play Store? Alphabet&#x27;s scripted moderation is useless. It&#x27;s time for real human moderation.<p>*Evidence of Bypass:* https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;pju2EsV<p>*Play Store Systemic Failure Evidence (Sanitized):* https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;rW9rBhp",
      "is_ask_hn": false,
      "matched_keywords": [
        "failure"
      ],
      "comments": []
    },
    {
      "id": "47200827",
      "title": "Ask HN: Builder.ai ($1B Microsoft-backed AI company) who's lookin at the assets?",
      "link": "https://news.ycombinator.com/item?id=47200827",
      "domain": "news.ycombinator.com",
      "author": "gamelock",
      "score": 6,
      "comment_count": 4,
      "created_ts": 1772316617,
      "is_internal": true,
      "post_text": "Builder.ai raised $450M from Microsoft and \nthe Qatar Investment Authority. Peak \nvaluation $1B+. Filed insolvency May 2025.<p>Administrator: Alvarez &amp; Marsal (Jul 2025)<p>Assets available:\n- builder.ai domain ($50K-$200K est.)\n- Natasha AI platform ($100K-$500K est.)\n- Full source code ($500K-$5M est.)\n- Enterprise clients: NBCUniversal, Fujitsu, \n  Virgin Unite ($50K-$300K est.)<p>Total estimated: $830K-$6.65M+<p>Full intelligence report available covering \ncollapse timeline, assets, administrator \ncontacts, acquisition guide.<p>Report: selar.com&#x2F;s2121g2629",
      "is_ask_hn": true,
      "matched_keywords": [
        "enterprise"
      ],
      "comments": [
        {
          "top": "yeah idk about clicking any links, but im just struggling to understand why anyone would pay anywhere close to any of these estimated valuations for the source code or platform, unless the enterprise client's contracts/work will come with the purchase. I'd have a completely different opinion on its valuation if the sale was happening a few months within when insolvency was declared.",
          "author": "harris-012",
          "replies": [
            {
              "text": "That's a fair point. The valuations are \nestimates based on comparable distressed \nasset transactions - the actual sale price \nwill depend heavily on what the administrator \npackages together.\nYou're right that client contracts are the \nkey variable. The report notes that the \nenterprise client database value is \ncontingent on whether Alvarez & Marsal can \ntransfer existing relationships. Source code \nalone without clients is worth significantly \nless.\nThe timing concern is also valid - assets \ndepreciate the longer they sit in \nadministration.",
              "author": "gamelock",
              "depth": 1
            }
          ]
        },
        {
          "top": "I’m curious about the report but 30 years on the internet have honed my instincts and they say not to paste that link on my url bar",
          "author": "kokken",
          "replies": [
            {
              "text": "Completely understandable - healthy \nskepticism is warranted. The report is \nhosted on Selar.co, a Nigerian creator \nplatform similar to Gumroad.\nAll the core information in the post is \nverifiable independently - the Alvarez & \nMarsal appointment was covered by \nBusinessCloud, the collapse by Sifted and \nBloomberg. Happy to answer any questions \nhere directly.",
              "author": "gamelock",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47196746",
      "title": "Garbage In, Garbage Out: The Degradation of Human Requirements in the LLM Era",
      "link": "https://news.ycombinator.com/item?id=47196746",
      "domain": "news.ycombinator.com",
      "author": "waylake",
      "score": 6,
      "comment_count": 5,
      "created_ts": 1772293887,
      "is_internal": true,
      "post_text": "The LLM Paradox: We’re Forgetting How to Speak to Humans<p>The longer we use LLM services, the more I see a specific kind of &quot;psychosis&quot; spreading in the workplace. LLMs are so good at hallucinating a coherent answer from a vague prompt that people have started to believe their vague prompts were actually coherent.<p>LLMs Are Not Humans\nIt sounds obvious, but we are losing our grip on this fact. People are beginning to treat their colleagues like a black-box LLM. They’ve forgotten that human communication requires precision, shared context, and accountability. In the pre-LLM era, &quot;make it pop&quot; was a phrase reserved for clueless clients. Now, it’s becoming the standard operating procedure inside engineering teams.<p>The &quot;Do It Well, You Figure It Out&quot; Fallacy\nI see managers—even those with engineering backgrounds—who are terrified of being held accountable for their own bad ideas. They hide behind vagueness. They use tools like Claude Code as a shield to bypass technical debt discussions.<p>When an engineer spends days fixing a half-baked requirement and managing technical constraints, the feedback isn&#x27;t &quot;Thank you for the due diligence.&quot; Instead, it’s: &quot;See? It was possible after all. Why did you push back so hard? LLMs could&#x27;ve done it in seconds.&quot; This is gaslighting. They want the output of a senior engineer while providing the input of a garbage prompt.<p>The Death of Articulation\nLLMs accept &quot;garbage in&quot; and provide &quot;plausible out.&quot; This has become a drug. People are losing the ability to articulate their own thoughts. They throw a mess of words at you and expect a miracle. If this continues, we aren&#x27;t just looking at bad software; we’re looking at a breakdown of professional sanity.<p>I’ve felt the symptoms myself. Lately, I’ve caught myself thinking, &quot;Explaining this to my team is a waste of &#x27;communication cost.&#x27; I’d rather just pay for more API tokens and do it myself.&quot;<p>But we must remember: A high-functioning team is not a collection of prompt engineers. True teamwork is exponentially more efficient than a lone developer with an LLM. We cannot afford to lose the art of talking to each other.",
      "is_ask_hn": false,
      "matched_keywords": [
        "feedback",
        "teamwork",
        "senior",
        "team",
        "communication"
      ],
      "comments": [
        {
          "top": "There's a downstream effect of this that I haven't seen discussed: the same degradation is happening to architecture.\nWhen requirements become vague, the systems built from them become opaque. AI-generated code is syntactically correct but architecturally invisible — nobody draws the system diagram because \"the AI handled it.\" The vagueness in the requirement propagates into the structure of the codebase itself.\nSix months later, you have a system that works but that nobody can explain. Writing the next requirement becomes even harder because you've lost the mental model of what you're building on top of. Garbage in, opaque architecture out.\nThe articulation problem you describe isn't just about communication between humans. It's eating the layer below: our ability to reason about the systems we're building.",
          "author": "Nathanf22",
          "replies": []
        },
        {
          "top": "I'm not sure that's related to llms. Corporate speak has been a thing forever. How do you say a lot without really saying anything? You use cross horizontal collaboration to capitalize on vertical integration capabilities. This allows teams to synergize fully without having to loop in unnecessary resources.",
          "author": "fullstick",
          "replies": []
        },
        {
          "top": "None of this is new.  Developers have always been given ambiguous requirements, and questions about them have always been furiously rejected.  Then they guess what was meant, or should have been meant, and that is what is deployed.",
          "author": "FrankWilhoit",
          "replies": []
        },
        {
          "top": "We have dealt with this in the political realm for decades. Vague word salads are being passed off as coherent policy arguments every where we turn.\nAfter spewing some vague policy position, a politician's worst fear is that a reporter might ask \"What do you mean by that?\" Or \"How would that work in real life?\"",
          "author": "didgetmaster",
          "replies": []
        },
        {
          "top": "Fire, so we aren't completely fucked by AI. No actually heartwarming news tbh.",
          "author": "K-Tai",
          "replies": []
        }
      ]
    }
  ]
}