{
  "scraped_date": "2026-02-19",
  "source": "hacker_news",
  "total_scraped": 126,
  "nontech_count": 28,
  "posts": [
    {
      "id": "47049824",
      "title": "Thank HN: You helped save 33k lives",
      "link": "https://news.ycombinator.com/item?id=47049824",
      "domain": "news.ycombinator.com",
      "author": "chaseadam17",
      "score": 1092,
      "comment_count": 109,
      "created_ts": 1771347978,
      "is_internal": true,
      "post_text": "13 years ago, we launched Watsi.org with a Show HN [1].<p>For nearly a year, this community drove so much traffic that we couldn’t list patients fast enough. Then pg saw us on HN, wrote us our first big check, and accepted us as the first YC nonprofit (W13). The next few years were a whirlwind.<p>I was a young, naive founder with just enough experience to know I wanted Watsi to be more efficient, transparent, and innovative than most nonprofits. We spent 24&#x2F;7 talking to users and coding. We did things that don’t scale. We tried our best to be walking, talking pg essays.<p>Over the years we learned that product&#x2F;market fit is different for nonprofits. Not many people wake up and think, &quot;I&#x27;d love to donate to a nonprofit today&quot; with the same oomph that they think, &quot;I&#x27;d love a coffee&quot; or &quot;I&#x27;d like to make more money.&quot;<p>No matter how much effort we put into fundraising, donations grew linearly, while requests for care grew exponentially. I felt caught in the middle. After investing everything I had, I eventually burned out and transitioned to the board.<p>I made a classic founder mistake and intertwined my self-worth with Watsi&#x27;s success. I believed that if I could somehow help every patient, I was a good person, but if I let down some patients, which became inevitable, I was a bad person.<p>This was exacerbated by seeing our for-profit YC batch mates raise massive rounds. I felt like a failure for not scaling Watsi faster, but eventually we accepted reality and set Watsi on more of a slow, steady, and sustainable trajectory.<p>Now that I have perspective, I&#x27;m incredibly proud of what the org has accomplished and grateful to everyone who has done a tour of duty to support us. Watsi donors have donated over $20M to fund 33,241 surgeries, and we have a good shot of helping patients for a long time to come.<p>In a world of fast growth and fast crashes, here&#x27;s a huge thank you to the HN users who have stuck by Watsi, or any other important cause, even when it&#x27;s not on the front page. I believe it embodies the best of humanity. Thanks HN!<p>[1] <a href=\"http:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=4424081\">http:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=4424081</a>",
      "is_ask_hn": false,
      "matched_keywords": [
        "mistake",
        "failure",
        "success",
        "learned"
      ],
      "comments": [
        {
          "top": "I have been a Universal Fund member since 2014.\nWatsi has this Impact page where you can see every person you've helped — their photo, their story, the country. I visit it more often than I'd like to admit.\nI have been building a startup since the last couple of years and as we all know it is relentless. There are weeks where nothing seems to work, where you question every decision. In those moments, pulling up that page and seeing real people whose lives changed because of a few dollars a month — it resets something. It reminds me why building things that matter is worth the grind.\nThank you to everyone at Watsi for creating something that gives back to donors just as much as it gives to patients.",
          "author": "aaur0",
          "replies": [
            {
              "text": "Thank you aaur0 - you have no idea how much this means to us. Grateful for every ounce of good news and good health we can spread in this world.",
              "author": "watsi",
              "depth": 1
            },
            {
              "text": "> I have been a Universal Fund member since 2014.\nI couldn't remember when I joined, but it turns out 2014 too. From that date and dang's comment below, I found the HN submission that motivated me to join:\nhttps://news.ycombinator.com/item?id=7550005",
              "author": "js2",
              "depth": 1
            },
            {
              "text": "That’s a very long time - thank you both!",
              "author": "chaseadam17",
              "depth": 2
            },
            {
              "text": "@chaseadam17 -\nThis is where I learned about Watsi - \nhttps://www.youtube.com/watch?v=WlT3UhC7NwQ\nI attended it in person. Very inspiring!",
              "author": "aaur0",
              "depth": 3
            },
            {
              "text": "Another 2014 batch member here. Hard to believe it is over 10 years I've been contributing to Watsi.",
              "author": "aswerty",
              "depth": 1
            }
          ]
        },
        {
          "top": "Thank YOU Chase :) (I work at Watsi)\nIf you'd like to see an example of what Watsi's about, check out Philip's profile: \nhttps://watsi.org/profile/2286cb03a5bd-philip\nAlso, fun fact: 619 of our current \"Universal Fund\" monthly donors first made a donation 10 or more years ago, and I'm pretty sure many of those were/are Hacker News readers.\nIf you're interested, see \nhttps://watsi.org/universal-fund",
          "author": "kalvin",
          "replies": [
            {
              "text": "I've long played around with the thought of what would happen if someone started something like the universal-fund you mentioned, but had it snowball like a sovereign fund? (ie, instead of spending the in flow, invest it and only spend the profits from the investments, for example) ...\nParticularly for basic needs like housing,food,clothes... Like what if instead of giving a charity $100 we created 41c per month? of UBI (roughly the cashflow from investing that same $100). Yes it would seem too little today, but in time it would be massive because it would never dissipate.\nIDK, just my musing while claude takes, err does, my job.",
              "author": "maerF0x0",
              "depth": 1
            },
            {
              "text": "Plenty of those have existed, but in the end they always get stolen and given to the dogs trust.\nThere’s nothing people hate more than lasting charitable foundations. They take them to court so that they can crack them open and wank away the entire fund in 6 months.\nThere was one which was supposed to pay off the entire national debt. They cracked and spaffed it.\nAnother was supposed to end piracy. Cracked and spaffed.\nYou could save a million people a year, but that won’t save you from being cracked and spaffed. They’re already rubbing their trotters at the thought.",
              "author": "MagicMoonlight",
              "depth": 2
            },
            {
              "text": "This sounds like a strange set of examples that may have been scams from the start. Can you name them?\nThe UK is full of long lasting charitable foundations. Many attached to schools and universities, but the highest profile example is probably the National Trust and its collection of historic buildings.",
              "author": "pjc50",
              "depth": 3
            },
            {
              "text": "A lot of those charities are precisely in the process of being \"cracked open\", or have been captured by small groups who manage them as their personal fiefdom. The level of everyday corruption in this country is incredible.",
              "author": "toyg",
              "depth": 4
            },
            {
              "text": "> captured by small groups who manage them as their personal fiefdom\nIsn't that intrinsic to what a charity \nis\n? They don't have customers, they're not trusts set up on behalf of someone else specific, they're a tax exemption with an ideological mission.\n(still short on named examples in this subthread)",
              "author": "pjc50",
              "depth": 5
            }
          ]
        },
        {
          "top": "I made the biggest donations in my life via Watsi. Thank you for building this site. I love you guys have an API as well. I thought of building an app on top of your API but never got round to complete it. If you are curious, I can share; I think there may be an opportunity to capture value in free giveaways and turn it into charity. Many people try to give away their things quickly on fb marketplace or letgo, ...what if they could ask for a donation to a charity? I know there are challenges like, what if they want to return. But there has to be a way to solve this with an escrow service or something. A similar model already works in used, 2nd stores that work for charities.",
          "author": "mclightning",
          "replies": []
        },
        {
          "top": "Thank you for the incredibly inspiring work! At a time when 99% of the founders and VCs just want to bank on the next big hype cycle and accumulate power and wealth, it’s good to be reminded that actual life changing work with direct impact on people is still possible.",
          "author": "Karupan",
          "replies": []
        },
        {
          "top": "Watsi is an incredible organization doing incredible work.\nChase and Grace are both incredible people.\nWhen I was 15 and first starting Hack Club, I went to Startup School 2013 and watched Chase’s talk. It was the first time I had ever seen a startup founder who was starting a nonprofit instead of a for-profit. Afterwards he showed me the kindness of speaking with me.\nLater as the years went on, both of them always replied to emails and gave great advice.\nMany nonprofit founders understandably feel very protective of their experience and relationships because nonprofits can be zero-sum in a way that for-profits aren’t, but Chase and Grace are two of the most generous people you’ll ever meet.\nThank you for starting an incredible organization and being such an inspiration.",
          "author": "zachlatta",
          "replies": []
        }
      ]
    },
    {
      "id": "47049426",
      "title": "CBS didn't air Rep. James Talarico interview out of fear of FCC",
      "link": "https://www.nbcnews.com/business/media/stephen-colbert-cbs-james-talarico-fcc-rcna259341",
      "domain": "www.nbcnews.com",
      "author": "theahura",
      "score": 519,
      "comment_count": 245,
      "created_ts": 1771346261,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "interview"
      ],
      "comments": [
        {
          "top": "It is a great illustration of how transition to the authoritarianism happens (I've seen it happen in Russia in 2000s). At first you don't even need censorship, you just need to scare owners of channels/newspapers enough, so that they self-censor.",
          "author": "sega_sai",
          "replies": [
            {
              "text": "Fear is the enforcement mechanism because it can't be challenged in court.\nIt is long past time for everyone in tech to take a long hard look at the current situation and stop doing anything that financially benefits Musk, Ellison, or Thiel.",
              "author": "dsl",
              "depth": 1
            },
            {
              "text": "Chilling effect has a long history of being well considered as unconstitutional harm in the courts\nhttps://firstamendment.mtsu.edu/article/chilling-effect/",
              "author": "CGMthrowaway",
              "depth": 2
            },
            {
              "text": "A history of anything in the courts doesn’t seem to be given too much consideration nowadays.",
              "author": "appplication",
              "depth": 3
            },
            {
              "text": "Who would have standing to challenge this though?",
              "author": "amanaplanacanal",
              "depth": 3
            },
            {
              "text": "There is no \"who\", once stabilizing institutions 'fall' the only remaining option is social pressure (which can come in various forms) but that does require a critical mass as it's very much reliant on network effects.",
              "author": "f_devd",
              "depth": 4
            }
          ]
        },
        {
          "top": "The interview in YouTube \nhttps://www.youtube.com/watch?v=oiTJ7Pz_59A",
          "author": "MyHonestOpinon",
          "replies": [
            {
              "text": "Barbara Streisand",
              "author": "sixsevenrot",
              "depth": 1
            },
            {
              "text": "1.5M views",
              "author": "sixsevenrot",
              "depth": 2
            },
            {
              "text": "Now at over 3M",
              "author": "financetechbro",
              "depth": 3
            },
            {
              "text": "It's kind of ironic, so much drama all for a safe centrist corporate democrat. Although perhaps that's why it's such a big deal for liberals, it's oligarchical infighting. It's even more confusing that he's funded by the same billionaires that trump is.\nhttps://www.politico.com/news/2025/08/21/james-talarico-miri...",
              "author": "lyu07282",
              "depth": 1
            },
            {
              "text": "Not about being a democrat.\nA man in seminary renounced christian nationalism. Ruling party wants to own the religion-party entanglement",
              "author": "kylehotchkiss",
              "depth": 2
            }
          ]
        },
        {
          "top": "I'm sure the CBS political officer^W^Wombudsman advised against airing the interview:\nhttps://www.npr.org/2025/09/12/nx-s1-5537152/cbs-news-elliso...",
          "author": "mikestew",
          "replies": [
            {
              "text": "If only they could \"slip on some tea\"...",
              "author": "CodeSalad",
              "depth": 1
            }
          ]
        },
        {
          "top": "Weird how Larry Ellison manages to do this to everything he touches",
          "author": "mcs5280",
          "replies": [
            {
              "text": "If its any consolation, I think CBS news will fail miserably. The new captains are at the helm of a sinking ship, which has been taking on water for decades.\nMaybe a cynic will say \"this was the plan\", but if it was, its not a very good plan? If anything, tech executives benefited enormously from their opponents being overly attached to legacy media communication strategies. When Bezos kills the Post or Ellison kills CBS, the talent doesnt magically disappear.",
              "author": "biophysboy",
              "depth": 1
            },
            {
              "text": "Not Larry, David his son. For some reason people want to keep pretending that the apple doesn't fall far from the tree though. Seen multiple puff pieces about how David just loves movies so much and his dad is the political one.",
              "author": "jajuuka",
              "depth": 1
            },
            {
              "text": "It's always daddy's money funding these projects",
              "author": "mcs5280",
              "depth": 2
            },
            {
              "text": "“They were careless people, David, Megan, and Larry- they smashed up things and creatures and then retreated back into their money or their vast carelessness or whatever it was that kept them together, and let other people clean up the mess they had made.”",
              "author": "Centigonal",
              "depth": 1
            }
          ]
        },
        {
          "top": "Rough spot in time to be:\n- Once print newspapers were no longer a thing, even local news outlets are struggling to stay alive, and are resulting to sensationalism and entertainment as news\n- Corporate sponsors retain a huge influence in mainstream news (or have outright purchased it and use it for partisan politics).\n- \"Social\" media resides in (you guessed it) corporate-owned walled gardens.\n- Even those willing to speak out are being targeted by federal agencies\nWondering where others are finding great places to learn what's going on, what's actually relevant to me, and what I can actually do about it.",
          "author": "web-cowboy",
          "replies": [
            {
              "text": "This is just an opinion.\nFollow trusted journalists that have a history of superb journalism. You have to decide what is good for yourself. Also industry specific journalists for deeper insight into industry you care about. Many of the greats realize that all the news companies are sinking ships and are trying to establish their own thing before things completely collapse.\nFocus on what each journalist specializes in and don't read too much into it when they report on topics that are not their forte (like Breaking points talking about AI). Many journalists stay in their lane but the groups covering all the news don't. I wish all journalists would stay in their lane but this is not the world we live in anymore.\nFor everything else that you are not willing to invest the time in, just accept you are not going to get great coverage.\nMy (typically far left) biases are comfortable with the following (these are not all far left)\nZeteo + dropsite for foreign middle east leaning coverage\nBreaking points for daily news\nKen Klippenstein, Glenn greenwald for national security state/us government news. Klippenstein is more fun (when he gets an FBI email asking for info but also politely asking to not release it, he goes ahead and provides a download link). Greenwald feels a bit more dry.\nIndustry specific: autoline (youtube+website) for automotive, semianalysis for semi.\nAgain this is just my opinion, please decide for yourself.",
              "author": "nebula8804",
              "depth": 1
            },
            {
              "text": "There's a decent amount of non-profit news. I read NPR a lot and donate to them and Propublica. I think one of the big issues is advertising so news you actually pay for is a lot less likely to clickbait you.",
              "author": "tdb7893",
              "depth": 1
            },
            {
              "text": "Pablo Torre, the last true sports journalist in America.",
              "author": "kjkjadksj",
              "depth": 2
            },
            {
              "text": "Ah yes, NPR who famously doesn't advertise but just tells us about new products! That sponsor programs!",
              "author": "ctoth",
              "depth": 2
            },
            {
              "text": "There's something \"Very HN\" to see a comment in a discussion about literal political censorship of the news media pointing out the horrifying hypocrisy in one of those media sources running... something sort of like advertisement.\nIs this what kids mean when they tell people to touch grass?  My generation would accuse you of having lost the plot.",
              "author": "ajross",
              "depth": 3
            }
          ]
        }
      ]
    },
    {
      "id": "47051852",
      "title": "Show HN: AsteroidOS 2.0 – Nobody asked, we shipped anyway",
      "link": "https://asteroidos.org/news/2-0-release/index.html",
      "domain": "asteroidos.org",
      "author": "moWerk",
      "score": 450,
      "comment_count": 67,
      "created_ts": 1771356295,
      "is_internal": false,
      "post_text": "Hi HN,\nAfter roughly 8 years of silently rolling 1.1 nightlies, we finally tagged a proper stable 2.0 release.\nWe built this because wrist-sized Linux is genuinely fun to hack on, and because a handful of us think it&#x27;s worth keeping capable hardware alive long after manufacturers move on. Smartwatches don&#x27;t really get old — the silicon is basically the same as it was a decade ago. We just keep making it useful for us.<p>No usage stats, no tracking, no illusions of mass adoption. The only real signal we get is the occasional person who appears in our Matrix chat going &quot;hey, it booted on my watch from 2014 and now it&#x27;s usable again&quot; — and that&#x27;s plenty.<p>Privacy is non-negotiable: zero telemetry, no cloud, full local control. Longevity is the other half: we refuse to let good hardware become e-waste just because support ended.\nOn the learning side, it&#x27;s been one of the best playgrounds: instant feedback on your wrist makes QML&#x2F;Qt, JavaScript watchfaces and embedded Linux feel tangible. The community is small and kind — perfect for people who want to learn open-source dev without gatekeeping.<p>Technically we&#x27;re still pragmatic: libhybris + older kernels on most devices since it just works, but we&#x27;ve already mainlined rinato (Samsung Gear 2) and sparrow (ASUS ZenWatch 2) — rinato even boots with a usable UI. That&#x27;s the direction we&#x27;re pushing toward.<p>Repo: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;AsteroidOS\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;AsteroidOS</a> \nInstall images &amp; docs: <a href=\"https:&#x2F;&#x2F;asteroidos.org\" rel=\"nofollow\">https:&#x2F;&#x2F;asteroidos.org</a> \n2.0 demo video : <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=U6FiQz0yACc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=U6FiQz0yACc</a> \nAnnouncement post: <a href=\"https:&#x2F;&#x2F;asteroidos.org&#x2F;news&#x2F;2-0-release&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;asteroidos.org&#x2F;news&#x2F;2-0-release&#x2F;</a><p>Questions, port requests, mentoring offers, criticism, weird ideas — all welcome. We do this because shaping a tiny, open wearable UX and infrastructure is oddly satisfying, and because Linux on the wrist still feels like a playground worth playing in.<p>Cheers, the AsteroidOS Team",
      "is_ask_hn": false,
      "matched_keywords": [
        "feedback",
        "team"
      ],
      "comments": [
        {
          "top": "Wow, this looks pretty cool! It seems you have quite a few features going... The main reason I haven't gotten a smartwatch yet is because of privacy concerns. But now seems like a good time to experiment with one of the watches you support.\nI also still dream of one day daily driving a Linux smartphone, but that feels a bit more unrealistic to me, as I have more expectations from a phone, like being able to use bank apps and having a good battery life. But for a smartwatch, which I only expect to show me some biometrics and pass notifications from my phone, this seems perfect.\nOn this note: aren't JavaScript and QML/Qt too heavy/bloated for a device so small? I expect them to constrain performance and battery life quite a bit, but I admit I don't have a clue and would love to be proven wrong...",
          "author": "coffeeenjoyer",
          "replies": [
            {
              "text": "QML runs interpreted at runtime and Qt is very close to native C++, so both are actually quite lean and fast on these devices — the overhead is surprisingly small compared to full Android Wear, and we've tuned it heavily over the years to keep battery and UI responsiveness solid.\nIf you see devices lagging, like the sawfish (Huawei Watch 2), its usually due to updating the android base to a newer one as the manufacturer planned for and losing some of those optimizations in the process.",
              "author": "moWerk",
              "depth": 1
            },
            {
              "text": "Thanks for clarifying and wish you all the best with the project! I'll see what watch I can get my hands on.",
              "author": "coffeeenjoyer",
              "depth": 2
            },
            {
              "text": "BangleJS has an embedded JS interpreter and runs just fine for days without a battery recharge.",
              "author": "dariosalvi78",
              "depth": 1
            }
          ]
        },
        {
          "top": "Wild to see such fragmentation in such a niche space.  It's an aftermarket Linux flash for smartwatches, and there are companion apps for SailfishOS and Ubuntu Touch, which are extremely niche flavors of the already very niche mobile Linux.",
          "author": "bsimpson",
          "replies": [
            {
              "text": "This is a feature, not a bug. Like the many Linux distros we have or the many UI/WM you can use on desktop Linux.",
              "author": "darkwater",
              "depth": 1
            },
            {
              "text": "Not being much of a watch person let alone a smartwatch aficionado, I had no idea there were even that many smart watches. The long list looks impressive. I wonder if there are a lot of the same guts so it's not as bad of a nightmare to maintain as it looks. Either way, the list of supported devices is impressive.",
              "author": "dylan604",
              "depth": 1
            },
            {
              "text": "Indeed quite some watches share the same platform as can be seen in this list:\n\nhttps://wiki.asteroidos.org/index.php/Technical_Details_of_A...\n\nBut the manufacturers all cook their own soups and its surprising how much adaption is still necessary per device.",
              "author": "moWerk",
              "depth": 2
            },
            {
              "text": "> niche space\nThink of the space as less \"I want Linux on my wrist\", and more \"I want a [cheap || not 1st world expensive] smartwatch as a gift.\"\nThese folks do gods work of making them supported and a real shared platform (c.f. their self-post \"The only real signal we get is occasional [chat visitor] going \"hey, it booted on my watch from 2014 and now it's usable again\"\")",
              "author": "refulgentis",
              "depth": 1
            },
            {
              "text": "I am running HarmonyOS on my watch (moved from Apple Watch to Huawei GT-6 41mm) now. Turns out it doesn't matter as third party apps on watches generally suck anyway (low functionality, mostly just companions to iOS/Android app, bad/not many options for UI).",
              "author": "ulfw",
              "depth": 1
            }
          ]
        },
        {
          "top": "Initially, I read Asteroids 2 :P If someone clicked like me thinking of the game, I recommend playing this one :D \nhttps://coderai.itch.io/clashroids",
          "author": "coderai",
          "replies": [
            {
              "text": "Turns out you can play Asteroids on AsteroidOS \nhttps://github.com/moWerk/asteroid-blaster",
              "author": "morrisjm",
              "depth": 1
            }
          ]
        },
        {
          "top": "Thanks for sharing, indeed it is good to reuse and improve hardware whenever possible rather than just going to waste. Had never heard of this project before, so it was a good find.\nI see the supported watches, still have a doubt: what is scenario looking like for the cheap smarwatches from Aliexpress and similar? Any chance to also flash a new firmware or is this limited to more CPU-powerful watches?",
          "author": "nunobrito",
          "replies": [
            {
              "text": "Most cheap watches are microcontroller-only. AsteroidOS is a Linux distro and therefore needs a chip capable of running some Linux variant.",
              "author": "casept",
              "depth": 1
            }
          ]
        },
        {
          "top": "These are all Linux kernel-based WearOS watches (not just smartbands running a barebones microcontroller), so could they be running a mainlined kernel and Linux OS such as pmOS? Of course the UI layer might be specific to the form factor, but everything else could just be standard.",
          "author": "zozbot234",
          "replies": [
            {
              "text": "In theory yes. Asteroidos has experimental support for a mainline watch.\nMost vendors don't upstream their drivers and kernel mods. Also Android drivers use an abstraction layer and a different format to some extentent. So you have to reverse and write your own driver.\nSo they could run mainline if the vendor or a user bothers to upstream drivers and hardware quirks.\nA lot of the vendors don't meet quality expectations of the kernel team and sources are usually for older kernel versions and the code would need changes or refactoring.",
              "author": "verin0x",
              "depth": 1
            },
            {
              "text": "The mainlining work is usually done by the community, not necessarily vendors. The relevant pmOS wiki page is \nhttps://wiki.postmarketos.org/wiki/Category:Watch\n but it may be less comprehensive or up-to-date than the AsteroidOS hardware support list.  Everyone can help by adding technical info about hardware to the wiki!",
              "author": "zozbot234",
              "depth": 2
            }
          ]
        }
      ]
    },
    {
      "id": "47051793",
      "title": "Stephen Colbert says CBS forbid interview of Democrat because of FCC threat",
      "link": "https://arstechnica.com/tech-policy/2026/02/stephen-colbert-says-cbs-forbid-interview-of-democrat-because-of-fcc-threat/",
      "domain": "arstechnica.com",
      "author": "voxadam",
      "score": 218,
      "comment_count": 71,
      "created_ts": 1771356046,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "interview"
      ],
      "comments": [
        {
          "top": "Conservatism has largely been unpopular outside of rural townships, and the nation continues to undergo a process of urbanization as young people continue to move to cities.\nNormally, a healthy response to this would be to realign and target a more popular set of messaging and policy objectives. Instead the American Right has decided instead that this popularity (and the reflection in media) is a threat to its ability to continue serving a shrinking pool of wealthy benefactors.\nIt should come as no surprise that the moment they were handed the power, they began to push the boundaries of what is acceptable when it comes to censoring media they see as a threat.\nRepublicanism doesnt work for anyone but the wealthy, it will do everything in its power here.",
          "author": "SimianSci",
          "replies": [
            {
              "text": "People who responded as \"very conservative/conservative\" was 36% in 1992 and 37% in 2024. \nhttps://news.gallup.com/poll/655190/political-parties-histor...\n\"Very liberal/liberal\" has increased though (at the expense of moderates).",
              "author": "bitshiftfaced",
              "depth": 1
            },
            {
              "text": "Language changes over time, and I remember recent memes where a cute girl says something like \"claiming you're moderate means you know conservatives don't get laid\" (presumably because of abortion politics).  It makes me wonder if the moderates actually became liberal or if they just don't want to use that word any more.\nAfter all the polarism in \"reality show politics\", my diehard liberal friends seem less liberal to me, but they'll state which team they're on more fervently than ever.",
              "author": "xscott",
              "depth": 2
            },
            {
              "text": "> It should come as no surprise that the moment they were handed the power, they began to push the boundaries of what is acceptable when it comes to censoring media they see as a threat.\nTo be clear, they were “handed power” by decisively winning a national election, which sort of undercuts your opening statement about how unpopular they are.",
              "author": "snowwrestler",
              "depth": 1
            },
            {
              "text": "The GOP won the popular vote, all the swing states, and control of both houses of congress and the White House in the last election.\nHard to do that on just rural townships.",
              "author": "RickJWagner",
              "depth": 1
            },
            {
              "text": "Is it? Citizens in Wyoming, South Dakota, North Dakota have ~3x the voting power as citizens of California, seems pretty easy to win many of the things you mentioned on rural townships.",
              "author": "nullocator",
              "depth": 2
            }
          ]
        },
        {
          "top": "This is why I find Social Media regulation to be so dangerous.\nWe shouldn't give our[1] government too much leverage over any company that controls what people can say. If we do, we may be solving a very serious problem, but creating one which is even more serious. If the government can apply large fines to social media companies, and also has a large amount of discretion about which companies it prosecutes, it's very easy for them to make a deal where a company won't be prosecuted if they remove speech that the government doesn't like.\n[1] Use whichever definition of \"our\" you like, the point is equally valid regardless of country.",
          "author": "miki123211",
          "replies": []
        },
        {
          "top": "I think it’s funny that while GOP supporters are investing tens of $billions to take over popular broadcast and social media brands to privilege their point of view, Brendan Carr threatens to invoke the equal time rule, which would completely negate their structural advantage.\nThis is kind of like when conservatives spent years wrapping their advocacy in the banner of free speech, and then Brendan Carr announced that free speech is over, actually, because Jimmy Kimmel was mean. Oops! Nevermind.",
          "author": "snowwrestler",
          "replies": [
            {
              "text": "> which would completely negate their structural advantage.\nYou think it’s going to be enforced against their side ?\nRead the room\nMy favorite dictator quote:\n> To my friends everything, to my enemies the law",
              "author": "foogazi",
              "depth": 1
            },
            {
              "text": "> I think it’s funny that while GOP supporters are investing tens of $billions to take over popular broadcast and social media brands to privilege their point of view, Brendan Carr threatens to invoke the equal time rule, which would completely negate their structural advantage.\nWhy assume the rule would be applied fairly? Carr said they would not enforce it against right wing radio.",
              "author": "pseudalopex",
              "depth": 1
            },
            {
              "text": "It is unlikely Carr will be FCC chair past January 20, 2029. (If he makes it that long.)\nHowever, all those conservative billionaires will still own their media companies. Expanding the coverage of the equal time rule would hand the next Democratic administration a big club to swing at them.\nHey maybe for his next act, Carr will revive the Fairness Doctrine that was repealed under Reagan.",
              "author": "snowwrestler",
              "depth": 2
            }
          ]
        },
        {
          "top": "[dupe] Earlier: \nhttps://news.ycombinator.com/item?id=47049426",
          "author": "ChrisArchitect",
          "replies": []
        },
        {
          "top": "This is higly abusive. Talks shows have been generally considered exempt from the Equal Time provision since the Regan administration. It it was applied consistently Fox News is basically violating it 24 hours a day.",
          "author": "josefritzishere",
          "replies": [
            {
              "text": "Fox News is doesn't use airwaves, so it's not subject to this requirement.",
              "author": "apparent",
              "depth": 1
            },
            {
              "text": "Conservative talk radio hosts then. Still hypocritical and clear evidence for further politicalization by Carr",
              "author": "miltonlost",
              "depth": 2
            },
            {
              "text": "Yeah, should apply there for sure. I wonder if Democratic politicians would want to go on conservative talk shows, though.\nMy general understanding is that Republican politicians are more often refused speaking slots on non-Right media, whereas Democratic politicians don't want to go on Right media.",
              "author": "apparent",
              "depth": 3
            },
            {
              "text": "You’re saying Republican politicians are demanding to be interviewed by Steven Colbert? And even if they were, that would matter? (I would think Mr. Colbert would \nlove\n to have a bunch of R politicians lined up to skewer on his show.)",
              "author": "wrs",
              "depth": 4
            },
            {
              "text": "I know what Colbert said, and what Colbert claims CBS said. But I feel like something is being left out.\nThe equal time requirement wouldn’t prevent Colbert from interviewing a political candidate. And it wouldn’t require Colbert to send invitations to anybody. It would require Colbert to allow a competing political candidate to appear if the candidate demanded it.\nCBS could decide they don’t want that hassle. Colbert could decide he doesn’t want that hassle. But the law as it stands doesn’t prevent the interview.\nI actually remember when Reagan’s FCC decided to stop enforcing equal time. Plenty of people complained about how the change would ruin America. Now they seem to believe Reagan was right after all.",
              "author": "maxlybbert",
              "depth": 5
            }
          ]
        }
      ]
    },
    {
      "id": "47063950",
      "title": "Warren Buffett dumps $1.7B of Amazon stock",
      "link": "https://finbold.com/warren-buffett-dumps-1-7-billion-of-amazon-stock/",
      "domain": "finbold.com",
      "author": "fauria",
      "score": 144,
      "comment_count": 156,
      "created_ts": 1771437368,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "stock"
      ],
      "comments": [
        {
          "top": "Berkshire Hathaway has my favorite website (or, WEB page, as they style it) of any big company: \nhttps://www.berkshirehathaway.com/",
          "author": "semiquaver",
          "replies": [
            {
              "text": "<meta name=\"GENERATOR\" content=\"MSHTML 8.00.6001.18828\">\n\n\n\n*Jurassic Park taking off glasses.gif*",
              "author": "meindnoch",
              "depth": 1
            },
            {
              "text": "I mean, what did you expect?\n    Copyright © 1978-2025 Berkshire Hathaway Inc.",
              "author": "tharkun__",
              "depth": 2
            },
            {
              "text": "Incredibly clear and direct. Amazing to see a big company like that keeping it so old school. Thanks for pointing it out!",
              "author": "chickensong",
              "depth": 1
            },
            {
              "text": "I half expected to see an \"under construction\" gif and a \"powered by GeoCities\" tag at the bottom",
              "author": "scottious",
              "depth": 1
            },
            {
              "text": "It's definitely missing a website hits counter.",
              "author": "forinti",
              "depth": 2
            }
          ]
        },
        {
          "top": "Maybe the novelty of Amazon has worn off. I occasionally purchase from their UK site, and it’s filled with tricks to get me to sign up for Prime upon checkout. Really horrible workflow and design decisions, cheapening the experience. I now see similar changes to the US version: ‘you saved $15 in shipping by being a Prime member with this purchase’ and ‘last year you made 211 sustainable product purchases’.\nGuys, quit being so desperate. Concentrate on quality items at competitive pricing and fast delivery. Don’t turn into TJ Maxx.\nMy Echo, that I use solely to voice activating lights and switches, is now an ad machine and one bad day away from going in the trash. Next time you do a wave of layoffs, please include everyone involved in these horrible decisions.",
          "author": "xvxvx",
          "replies": [
            {
              "text": "Amazon has been quite useful for me as a single bachelor living in an Indian metropolitan city.\n1. I get very useful items at very good prices, many of which I would have to wander the city for hours to find, or couldnt find at all:\n  - Eg: I got a pair of adjustable dumbbells at <2K INR. Some of you would call it a cheap knock. But it has been super useful and I would have not bought it if it cost 8k INR. I brought a whole bosch repair toolkit at good price and it has been invaluable for fixing electric/plumbing etc.. issues. I got a high volume travel bag - I didn't even know 40L travel bags existed and wouldnt have brought one if not for amazon. I could go on.\n2. Amazon Fresh is usually cheaper for groceries and maintain consistent quality compared to local supermarkets. I will also avoid the need to walk long with the grocery bag.\n3. Electronics are significantly cheaper on amazon and again the need to search.\nMaybe all of this can be even better as you said. But bottom line is that their operations look pretty efficient to me. Their catalogue is pretty much unmatched. (They may be losing money on retail business - but that's not my position to care as a customer. As other commenter pointed out, it may not even matter much for stock price.)",
              "author": "never_inline",
              "depth": 1
            },
            {
              "text": "amz is beholden to cheap products and labor. you have both in india.\nelsewhere it's awful, for the exact same features you describe.\nthey even bought a premium supermarket chain so their produce stop being returned in the US.",
              "author": "iririririr",
              "depth": 2
            },
            {
              "text": "Yeah this is something really beautiful about India: life is cheap and there are tons of desperate people who will kill themselves for you.\nIn the Netherlands you'll be waiting an hour for your meal to be delivered by a bored teenager on an ebike. And you're going to be grateful.",
              "author": "TitaRusell",
              "depth": 3
            },
            {
              "text": "> In the Netherlands you'll be waiting an hour for your meal to be delivered by a bored teenager on an ebike\nIt takes less than an hour to make a dinner oneself",
              "author": "kombine",
              "depth": 4
            },
            {
              "text": "Yeah, but then you have to make dinner. Delivery is asynchronous.",
              "author": "gzread",
              "depth": 5
            }
          ]
        },
        {
          "top": "My view of Amazon's decline comes from being a \"partner\" in their seller and publisher ecosystems for years.\nThe seller platforms in particular (Brand Registry, Vendor Central, Seller Central, Transparency, etc.) have crippling levels of technical debt. The situation has only gotten worse with Jassy's reckless directive for the entire organization to push into Generative AI (\nhttps://www.aboutamazon.com/news/company-news/amazon-ceo-and...\n). So much basic stuff is just breaking down, and seller support is overwhelmed or unable to intervene to fix the mess.\nYou can see a small sample here involving problems with product attributes (\nhttps://sellercentral.amazon.com/seller-forums/discussions?s...\n). Google \"Amazon AWD delays\" or \"Amazon CSBA problems\" or \"Amazon remote fulfillment problems\" to see examples of programs that are unable to provide even basic levels of the services promised to sellers.\nMeanwhile, Amazon has been so greedy with fees since Jassy took over that sellers of all sizes and many small to midsized brands are being squeezed out of existence or driven off Amazon. Its PPC ad platform is completely predatory, loaded with dark patterns and hidden defaults that add billions to top-line revenue while strip-mining the accounts of sellers who often have no choice but to participate in the auctions.\nIt's clear that Amazon is running scared when it comes to dealing with new competition, including the Chinese shopping sites and the looming prospect of agentic AI and other new AI-powered shopping tools eating its lunch. For the first time ever last month, I saw an Amazon search results (via Rufus) that actually directed shoppers to third-party brand sites. This would have been heresy 5 years ago.",
          "author": "ilamont",
          "replies": [
            {
              "text": "Oh god, was working within seller central when brand registry was being spun up.  Id rather not relive some of those experiences (or use them).",
              "author": "Nicook",
              "depth": 1
            },
            {
              "text": "Blaming AI for Amazon’s accelerating downturn is a cop-out. This has been going on long before genAI was allowed there. Even now many teams within the products you called out aren’t using it at all.",
              "author": "bespokedevelopr",
              "depth": 1
            },
            {
              "text": "> Its PPC ad platform is completely predatory, loaded with dark patterns and hidden defaults that add billions to top-line revenue while strip-mining the accounts of sellers who often have no choice but to participate in the auctions.\nAt least they mark ads as 'sponsored', even though it isn't super prominent.\nI always scroll until I see organic results, myself.",
              "author": "mooreds",
              "depth": 1
            },
            {
              "text": "They mark some of them. Not all of them. Last article I read said 80% of placements on the search results page are paid ads. And they only mark like 4-5 of them as \"sponsored\"",
              "author": "malfist",
              "depth": 2
            },
            {
              "text": "I think Amazon should cede the cheap chineesium to Temu or SHEIN and focus on its own products and products from companies who actually exist",
              "author": "mghackerlady",
              "depth": 1
            }
          ]
        },
        {
          "top": "Berkshire Hathaway, not Warren Buffett.\nLarge stock sales always make headlines but they don't automatically signal bearishness or really anything else. After all what's the point of investing if you never realize gains?",
          "author": "paxys",
          "replies": [
            {
              "text": "I think in Berkshire case they do, as they are swimming in cash and notoriously don't sell unless their business outlook changes dramatically.\nIn any case, I would not take what Berkshire does with much weight.\nAs Buffett himself said, if you took out their 5/6 best performing investments out of their equation they would be matching the sp500, and if you took out 20, they would be trailing it.\nThey know that their over performance came from a small number of incredibly well performing bets.",
              "author": "epolanski",
              "depth": 1
            },
            {
              "text": "Modesty is as important as \nnot\n making \nBAD\n bets.",
              "author": "DANmode",
              "depth": 2
            },
            {
              "text": "That's typical in the stock market, though. You're not going to have a 50% edge. You're going to have a 1-2% edge if you're the absolute best, and you're going to milk that for all it's worth.",
              "author": "gzread",
              "depth": 2
            },
            {
              "text": "Yes, but you’d be foolish to realize your gains if you think the stock still has a long way to run. That just triggers taxes and eliminates any further upside. So, we can reasonably conclude that either BH thinks Amazon’s run is nearly exhausted, or it’s one of the stocks with minimal forward prospects in BH’s portfolio and they want to deploy the capital with something that they feel will have a greater return (maybe Amazon still rises, but whatever else they want to invest in they think will rise more/faster).",
              "author": "drob518",
              "depth": 1
            },
            {
              "text": "Kind of both. It’s the last direct decision that he made for Berkshire as the guy in charge.",
              "author": "koolba",
              "depth": 1
            }
          ]
        },
        {
          "top": "Amazon's core business does not make sense. Despite being so massive, their retail operation makes almost no money. There is little market share left for them to win, the best they can do to grow is shave expenses.\nAWS has been their real money maker, but also the explosion of AI and server farms has worked against them in threes ways: there is much more competition on infrastructure, the costs to run infrastructure keep going up, if you're looking for a growth industry there are other more appealing stocks now to park your capital.",
          "author": "legitster",
          "replies": [
            {
              "text": "> Amazon's core business does not make sense. Despite being so massive, their retail operation makes almost no money.\nNet profit margins for retail are only around 3% across the industry.\nAmazon isn't actually doing anything unusual in that regard. Retail is just a very low profit margin business whether it's physical or online.\nThese numbers are always confusing to those of us in the tech world where SaaS net profit margins are always very high.",
              "author": "Aurornis",
              "depth": 1
            },
            {
              "text": "This is correct, but it doesn't explain why Amazon would have a 2x market cap over Walmart when they both roughly make the same revenue.\nYou have to believe that Amazon is poised for much higher growth than they are to justify their current stock price.",
              "author": "legitster",
              "depth": 2
            },
            {
              "text": "> This is correct, but it doesn't explain why Amazon would have a 2x market cap over Walmart when they both roughly make the same revenue\nBecause Amazon and Walmart are two different companies with very different product offerings.\nRetail can only grow so far. AWS continues to grow at a relatively incredible rate compared to Walmart's business.",
              "author": "Aurornis",
              "depth": 3
            },
            {
              "text": "The revenue curves do indeed look a bit different:\nhttps://www.macrotrends.net/stocks/stock-comparison?s=revenu...\nEven more so if you compare EBITDA:\nhttps://www.macrotrends.net/stocks/stock-comparison?s=ebitda...",
              "author": "jcheng",
              "depth": 3
            },
            {
              "text": "It seems like AMZN has significant growth priced-in to the stock, but retail growth will become increasingly challenging as their market share increases.",
              "author": "nickff",
              "depth": 4
            }
          ]
        }
      ]
    },
    {
      "id": "47043751",
      "title": "Long-term unemployment is becoming 'a status quo' in today's job market",
      "link": "https://www.cnbc.com/2026/02/16/long-term-unemployment-becoming-a-status-quo-in-todays-job-market.html",
      "domain": "www.cnbc.com",
      "author": "rustoo",
      "score": 83,
      "comment_count": 83,
      "created_ts": 1771303018,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "job market"
      ],
      "comments": [
        {
          "top": "* Tariffs are hurting most real-world jobs - you don't know what your inputs will cost in 6-12 months and so can't plan\n* Political Corruption - you don't know if your permit, M&A, or regulatory rule-change will go through without a bribe to the right person\n* Tech, which makes up most of the market, is all in on AI - these companies are late stage and the AI narrative is the only growth story so the market doesn't reward them for investing in anything else\n* Cheap globally accessible labor\n* Lack of enforcement of anti-trust means stodgy uncompetitive markets with players that make their  margin through rent-seeking rather than increasing production or quality of goods and services.\n* Poor investments and corruption in our healthcare system make it really expensive to hire Americans\n* Poor investments and corruption in education make many Americans unsuitable for high skilled work.",
          "author": "siliconc0w",
          "replies": [
            {
              "text": "Not to be rude, but is this just a list of your feelings on the matter or is there real data and consensus behind them?\nhttps://fred.stlouisfed.org/series/LNS13025703\nThe biggest jumps in the past 50 years appear to coincide with W Bush and Obama administrations. They certainly did have tariffs then, but were they responsible there? How about corruption? AI was not, but there was an analogous dot com bubble but by 2000 and beyond we were on the other side of it and tech demand was actually bursting! Not long after which unemployment went up, so it wasn't the overinflated bubble that caused unemployment. Cheap globally accessible labor has not just recently become available. Anti-trust was pretty weak for a long time. Healthcare system is terribly expensive and corrupt and arguably Obamacare made it worse.",
              "author": "stinkbeetle",
              "depth": 1
            },
            {
              "text": "Obama and Bush came after Clinton pushed through the WTO stuff with China. Free trade most definitely had a positive factor in the economy in the next 16 years, even if tariffs still existed. A lot of the blowback from the Trumpers is that not everyone benefitted equally, not that the economy didnt benefit from it overall (ironically speaking they elected a billionaire due to equality issues).",
              "author": "seanmcdirmid",
              "depth": 2
            },
            {
              "text": "Right, so my question is why did those enormous unemployment surges happen without the same kind of tariffs that Trump has? They certainly aren't a necessary trigger, could they even cause a major contribution?\nI think the true answer is that nobody really knows what pieces are in play let alone how they all interact -- very few economists predicted the housing crash. So when you see lists of things like this, who knows? It looks like throwing spaghetti at a wall to see what sticks.",
              "author": "stinkbeetle",
              "depth": 3
            },
            {
              "text": "I thought it was pretty obvious there was going to be a housing crash myself, there were actually quite a few very high rollers who agreed once we had discussed it a bit.  Made plans with my elderly father to sell their resort home ASAP, it was the peak.  A year later it was only worth half.\nFortunately, I'm no economist ;)",
              "author": "fuzzfactor",
              "depth": 4
            },
            {
              "text": "Yes it's interesting how obvious many of these things were obvious to people when you ask them to recount the details after the fact :)",
              "author": "stinkbeetle",
              "depth": 5
            }
          ]
        },
        {
          "top": "Them starting their graph at 2021 made me look up the actual data: \nhttps://fred.stlouisfed.org/series/LNS13025703\nIt's heavily cyclical for reasons I don't understand. It skyrocketed to 45% after the housing crash. It tends to peak in the low to mid 20s. We're currently at 25%. Definitely yellow journalism for now. And as for the article - if your parents name you Tequila, get a name change.",
          "author": "somenameforme",
          "replies": [
            {
              "text": "What looks unusual in this graph is that the line usually spikes rapidly during and after a recession. It's not clear what we're in right now, since recessions are declared after the fact, but the slow trend upwards without a declared recession does look like a break from past decades.",
              "author": "sxyuan",
              "depth": 1
            },
            {
              "text": "It's different this time because the build-up since the last recession (excluding pandemic which didn't cause real recession but instead added more coal to the fire) has been the longest in history by far. Unless economists learned to prevent recessions, which is very unlikely, long build-up may mean spectacular crash. On the other hand, it may indicate that we are in a recession, hence the graph's similarities to 2007-2009 period, but it's just going to take a long time and then crash spectacularly, too. I am just speculating but it \"feels\" that way.",
              "author": "pllbnk",
              "depth": 2
            },
            {
              "text": "I was about to post the same thing. It is cyclical, and over the last several decades, the percentage of long-term unemployed during low unemployment periods seems to have steadily increased more than the rate during high unemployment periods, covid excepting.",
              "author": "1123581321",
              "depth": 1
            },
            {
              "text": "The level seems to be increasing, clearly, despite the cyclical components",
              "author": "zwaps",
              "depth": 1
            },
            {
              "text": "Between 1950 and 2008 it briefly spiked above 20 six times total. Since 2008, the number never meaningfully fell below 20, staying in the 30-40 zone between 2008 and 2015, and then hovering between 20 and 25 since then. Yes, it's obvious that the status quo has changed.\nIMO the reason is that there's simply more paper trail behind you. If you fall behind once, it's not like you can get your things, change name, and start a new life in another state.\n> if your parents name you Tequila, get a name change.\nI want to be named Charizard but my country doesn't allow name change.",
              "author": "anal_reactor",
              "depth": 1
            }
          ]
        },
        {
          "top": "It seems increasingly likely the U.S. is running full hog into one of the worst economic disasters we’ve ever seen with no contingency plan or strategy for resolution. [1]\n[1]: \nhttps://www.npr.org/transcripts/nx-s1-5704756#:~:text=Are%20...",
          "author": "SlightlyLeftPad",
          "replies": [
            {
              "text": "I guess the real question is: is there anywhere for the layperson to hide? Whose acorns will survive?",
              "author": "teeray",
              "depth": 1
            },
            {
              "text": "Just be ready to make practical quality of life adjustments. Learn about self sustenance, even if you can't practice it yet. It's not going to be Mad Max all of a sudden, but a lot of little things we've come to expect someone else to do will degrade or disappear.",
              "author": "tencentshill",
              "depth": 2
            },
            {
              "text": "Seems?",
              "author": "fuzzfactor",
              "depth": 1
            },
            {
              "text": "Especially when you realise that our tolerance for AI propping up the rest of the economy has stifled the \"natural selection\" that weeds out poor performers and poor business choices and rewards innovation and success. An imprecise economy is a worrying thing.",
              "author": "t0lo",
              "depth": 1
            }
          ]
        },
        {
          "top": "> He’s also noticed the interview process getting longer as companies get “more picky,” he says. One recent company required eight rounds, and he still didn’t get the role.\nNo one can truely understand how grueling this is until they see this happen. My girlfriend recently had a hard time finding a new gig. Entry level office jobs are doing >7 rounds. Phone, recruiter, HR, manager, manager + team member, manager + skip level, ... etc.\nWhats even worse is all the people in your life who are older can't understand this at all.\nI tried to explain getting ghosted, ghost jobs, online applying, multi-round interviews to my grandma. It just does not make sense. It has never been like this, why is it like this now?",
          "author": "gravypod",
          "replies": [
            {
              "text": "The eight round interviews are incredibly stupid from the hiring side as well. My job’s thankfully not gone quite that far, but I’ve had a bunch of hiring panels where I don’t have anything to add that the four other people who interviewed the candidate didn’t already cover and my involvement in the process was just a complete waste of time.",
              "author": "plorkyeran",
              "depth": 1
            },
            {
              "text": "> Whats even worse is all the people in your life who are older can't understand this at all.\nThat's people over 50. Millenials are basically out of job market once losing the current job. I haven't heard anyone from younger generations in my vicinity getting a serious stable job either, and there is nowhere to emigrate to this time.\n> I tried to explain getting ghosted, ghost jobs, online applying, multi-round interviews to my grandma. It just does not make sense.\nThere is no job.",
              "author": "lifestyleguru",
              "depth": 1
            },
            {
              "text": ">That's people over 50.\n50 is not well-enough experienced.\nYou're talking to the ones who were not among this category of unemployment statistics.\nTheir experience is just as real if they never faced as tough a market personally, but it is pure survivor bias.\nFor many of the other over-70's now, the ones who are still living could often tell you how in the 1970's there would be hundreds of applicants for every entry-level job of any kind.  Many with advanced degrees.\nYou want to work for minimum wage, bus tables in a restaurant or collect trash for the sanitation department?  Too bad, the odds are overwhelmingly against you whether you have current experience in the field or not.\n>There is no job.\nExactly.  That's the way it was, only much worse then.\nStill, right now things are looking gradually worse as misguided financial macro forces are gathering steam, without the more mature influence that would make a positive difference.\nAs for \"status-quo\" that actually \ncan be\n something stable, and worth working your way up to reach sometimes.  Although very often regarded as mediocrity OTOH.\nThis type of financial malfeasance is so familiar that I think the better terminology is the SNAFU.\nRoger.  Situation Normal: All Fucked Up.\nThere's just a new normal now you're expected to accept.\nSame situation though :(",
              "author": "fuzzfactor",
              "depth": 2
            },
            {
              "text": "> It has never been like this, why is it like this now?\nImagine you have a hiring panel of 20 people, and you are a member of it. It's obvious that the whole process is completely broken. What's your correct move? If you improve the hiring process, the size of the hiring panel will be reduced from 20 people to 5, which means there's 75% chance you'll be fired. Congratulations, you played yourself. Instead, the correct move is to keep making the hiring process as bad as possible, so that the company expands the hiring panel even further, which lowers the risk of you being fired.\nWhen you take a look at why soviet economy failed, the biggest issue was that the system actually rewarded inefficient institutions, allocating to them more resources, while punishing efficient institutions. Exactly the same problems exist within a single capitalist company.\nOn top of that, the employment has shifted from small business to large corporations. The best example is food delivery - 10 years ago you would've been hired directly by the restaurant, which means that either restaurants would freely compete for workers or workers would compete for restaurants, depending on the market. But nowadays either everyone deals with whatever bullshit UberEats pulls off or you're out of the game.",
              "author": "anal_reactor",
              "depth": 1
            },
            {
              "text": "> If you improve the hiring process, the size of the hiring panel will be reduced from 20 people to 5, which means there's 75% chance you'll be fired.\nWait, what?\nThat only makes sense if the hiring panel is made up \nexclusively\n of people whose job is \nnothing but hiring\n.\nThat has never been the case anywhere I have worked or seen.",
              "author": "danaris",
              "depth": 2
            }
          ]
        },
        {
          "top": "This is cyclical. There is nothing particularly onerous about the current situation compared to previous cycles at this point. An adult will experience a few of these cycles over their career. You should be prepared for it to happen.\nI understand that it might be shocking for a young person who has never lived through this before. It also sucks to enter the job market at the bottom of one of these cycles. The bottom almost never lasts more than a year or two, which seems like an eternity while you are in it.\nThe article opens with someone who was making six-figures at 47 years old in a low-cost-of-living part of the country. They’ve seen a few of these cycles already and with a modicum of prudent planning would be well-positioned to ride it out.",
          "author": "jandrewrogers",
          "replies": [
            {
              "text": "The average non cyclical component of longterm unemployment has been rising steadily since the 50s tho",
              "author": "zwaps",
              "depth": 1
            },
            {
              "text": "Hostility to labor has been accelerating throughout my 25 years in the workforce. Graduated into dotcom bust then global financial crisis then another massive transfer of wealth to the already ultra-wealthy in response to covid. If you don't already have yours good luck getting it.",
              "author": "moneycantbuy",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47055786",
      "title": "Advice, not control: the role of Remote Assistance in Waymo's operations",
      "link": "https://waymo.com/blog/?modal=short-advice-not-control-the-role-of-remote-assistance",
      "domain": "waymo.com",
      "author": "xnx",
      "score": 78,
      "comment_count": 69,
      "created_ts": 1771377555,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "advice",
        "remote"
      ],
      "comments": [
        {
          "top": "That it's 70 remote assistance people for 3,000 cars is pretty good counter-evidence to the \"they're not driverless, they're remote controlled\" claims.",
          "author": "jefftk",
          "replies": [
            {
              "text": "70 active on average at any given time per the article, which then lists total fleet size, as opposed to number of active cars on average, so it's not a fair comparison.\nAlthough then it says they drive about 4m miles per week, which works out to 57,000 miles per active RA agent per week. A person driving ~25 mph on average 24/7 would do ~4000 miles in a week (and we can assume 24/7 here because they reported active agents, so we assume a team of ~3 people swapping out as driver in this hypothetical).\nSo that gives you a car/operator ratio of at least 14, and probably more since I bet the average speed is less than 25 mph.",
              "author": "actinium226",
              "depth": 1
            },
            {
              "text": "I think anyone who goes for a drive in Los Angeles can attest that there are way mo than 70 cars active at any point. It's not unusual to see multiple Waymos at intersections.\nAlso, the average speed is way less than 25 mph, considering it may take 30 minutes to go 3-4 miles in city traffic.",
              "author": "oceliker",
              "depth": 2
            },
            {
              "text": "I see what you did there…",
              "author": "hawaiianbrah",
              "depth": 3
            },
            {
              "text": "Yeah that sentence struck me as very carefully worded. They also don't mention how often RA is needed or invoked. We'll encounter a lot of these autonomous systems (cars, robots, equipment) that escalate decisions and edge cases to human employees until they are trained enough that reliability goes up.",
              "author": "toddmorey",
              "depth": 2
            },
            {
              "text": "It's tricky to give a number for \"RA required\" that isn't wildly misleading, or contextualize one you're given. The common case for most AV RAs is confirmation of what the vehicle already has planned. Does that count as \"required\"?\nAn AV company can also tune how proactive vehicles are in reaching out to RA for confirmation, which is a balancing act between incident rate, stoppages, RA availability, and rider metrics. There's other ways to tune RA rate by also adjusting when and where the vehicles operate, which comes down to standard taxi fleet management tools (e.g. price and availability).\nWaymo chooses a target that they're comfortable with and probably changes it every so often, but those numbers aren't the only possible targets and they're not necessarily well-correlated to the system's \"true\" capabilities (which are themselves difficult to understand).",
              "author": "AlotOfReading",
              "depth": 3
            }
          ]
        },
        {
          "top": "Style nit: weird that it's in a modal dialog, unlike their other blog posts. Also, it doesn't come up when searching their blog.",
          "author": "skybrian",
          "replies": [
            {
              "text": "I instinctively closed it as a cookie popup, and then wondered where the article was.",
              "author": "treesknees",
              "depth": 1
            },
            {
              "text": "It's not a nit at all. This is some of the worst web design from a tech company that I've seen in a long time.",
              "author": "dddgghhbbfblk",
              "depth": 1
            },
            {
              "text": "That doesn't seem to be unique to this blog post, I got the same thing clicking the other ones linked at the bottom of the page. I see the word \"short\" in the URL, maybe they have a separate category of \"shortform\" posts and the modal is for those?",
              "author": "ameliaquining",
              "depth": 1
            },
            {
              "text": "It's also a peeve of mine that their \"blog\" has no feed.",
              "author": "xnx",
              "depth": 1
            },
            {
              "text": "Rather inelegant.",
              "author": "esafak",
              "depth": 1
            }
          ]
        },
        {
          "top": "This seems like it’s in response to the congressional testimony last week to clarify some things about their remote assistance systems.\nIt’s interesting that they only have 70 people for this - I can understand the outside the US ones for nighttime assistance and they need to be able to scale for other countries too in the future.\nWhat I’m still wondering is what is limiting the scaling for Waymo - just cars or also the sensor systems? They’ve had their new test vehicles in SF for a while but I still think that most customers only get their Jaguars right now (and still limited on highway driving to specific customers in the Bay Area).",
          "author": "Flux159",
          "replies": [
            {
              "text": "> What I’m still wondering is what is limiting the scaling for Waymo\nI'm also very curious about this. Probably a mix of many things: training the driver to handle tricky conditions better (e.g. flooded roads), getting more Ohai vehicles imported and configured, configuring the backlog of Jaguar iPace and trucking them out to new markets, mapping roads and non-customer testing in new markets, getting regulatory approval/cooperation in other market (e.g. DC), finding depot space, hiring maintenance team, etc.",
              "author": "xnx",
              "depth": 1
            }
          ]
        },
        {
          "top": "Why is anyone even bothered by this??\nWaymo is level 4 self drive.  Level 4 is required to autonomously handle all situations it might encounter (they are geofenced, so outside the geofence is not something it's expected to encounter) safely.  That does not preclude stopping and calling for help, it just requires that it be able to safely stop itself.\nWhy do I feel like this whole bit is being stirred up by Tesla to distract from the fact that they aren't making it at level 4?",
          "author": "LorenPechtel",
          "replies": []
        },
        {
          "top": "OT, but why in the world would you have your blog posts pop up in a little modal dialog in the middle of the screen and force readers to scroll more than they have to?",
          "author": "spankalee",
          "replies": [
            {
              "text": "How does that choice effect archive? \"This is different, remember they said... ...but I can't find it.\"",
              "author": "harry8",
              "depth": 1
            },
            {
              "text": "Absolute laziness by everyone involved. If you use modals, you're a bad designer.",
              "author": "halapro",
              "depth": 1
            },
            {
              "text": "It's annoying, but they divide their blog posts into big public-relation type articles at the top of the page, and minor/informational ones at the bottom.",
              "author": "xnx",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47062096",
      "title": "Show HN: VectorNest responsive web-based SVG editor",
      "link": "https://ekrsulov.github.io/vectornest/",
      "domain": "ekrsulov.github.io",
      "author": "ekrsulov",
      "score": 70,
      "comment_count": 23,
      "created_ts": 1771428717,
      "is_internal": false,
      "post_text": "I’ve just released VectorNest — an open-source, browser-based SVG editor.<p>If you have an SVG and need quick edits (paths, alignment, small fixes, animations, LLM assistance) without installing software, this is for you.<p>Try the demo: <a href=\"https:&#x2F;&#x2F;ekrsulov.github.io&#x2F;vectornest&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ekrsulov.github.io&#x2F;vectornest&#x2F;</a>\nGitHub repo: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;ekrsulov&#x2F;vectornest\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;ekrsulov&#x2F;vectornest</a><p>Feedback, issues and contributions are welcome.",
      "is_ask_hn": false,
      "matched_keywords": [
        "feedback"
      ],
      "comments": [
        {
          "top": "I liked the simplistic UI, but it is not quite ready for serious use.\nI tried using it on a simple svg that i had (around 1KB, just few simple lines and shapes). But it did not rendered them properly. Colors were off (black-box instead of original colors), and in one place it was showing at triangle instead of an L shaped line.\nAlso when I move an object, a single Cmd+Z wont undo the action. Have to repeat twice for object to go back (I am using Chrome on macbook)",
          "author": "israrkhan",
          "replies": [
            {
              "text": "Thank you — this is exactly the kind of feedback I’m looking for. If you’re able to share the SVG that caused the issue, I’d love to take a look and reproduce the problem.\nThe undo behavior you described is a known issue — some interactions currently require multiple undo steps, and I’ll be looking for a proper solution in the medium term. Really appreciate you taking the time to test and report this.",
              "author": "ekrsulov",
              "depth": 1
            }
          ]
        },
        {
          "top": "How much time did it take you to build it? For the past several years I have been working full time on an SVG editor myself (\nhttps://boxy-svg.com\n) and I get a bit anxious when I see what LLMs are capable of nowadays.",
          "author": "jarek-foksa",
          "replies": [
            {
              "text": "First of all — I’ve seen Boxy before, and congratulations on the product you’ve built. It’s genuinely impressive, especially considering how much depth a serious SVG editor requires.\nThis result is actually the fourth iteration of VectorNest. In previous versions I would build something, then restart from scratch — but always reusing pieces and, more importantly, the learning from the prior attempts. The big leap happened in the last few months, mainly due to an architectural decision (moving to a plugin-based core) and the noticeable improvement in LLM precision, which made iteration much more reliable.\nFor me this is a side project, so I only dedicate a few hours per day. I started the first iteration less than a year ago, and the current iteration began about four months ago.\nI completely understand the anxiety around what LLMs can now produce — but I also think building something robust and production-ready still requires a lot of architectural thinking and long-term iteration.",
              "author": "ekrsulov",
              "depth": 1
            },
            {
              "text": "Wow! I'd never heard of it. Just checked it out and it's fantastic. Great job!",
              "author": "djfobbz",
              "depth": 1
            },
            {
              "text": "Huge thanks for Boxy! I’ve always wanted to know who made it - it’s an impressive piece of software and has been for many years.\nTaught me a lot about SVG!",
              "author": "cadamsdotcom",
              "depth": 1
            }
          ]
        },
        {
          "top": "Pen tool control points/curves are rendered in the wrong location: \nhttps://imgur.com/a/QXQoqOI",
          "author": "meindnoch",
          "replies": [
            {
              "text": "I believe I’ve been able to reproduce the issue and implemented a fix. Could you please try again and let me know if it’s resolved now?",
              "author": "ekrsulov",
              "depth": 1
            },
            {
              "text": "Now it's good! Great job!",
              "author": "meindnoch",
              "depth": 2
            },
            {
              "text": "Thanks for reporting this! Would you be able to share the SVG you’re testing with and the browser/version you’re using? That would really help me reproduce and investigate the issue.",
              "author": "ekrsulov",
              "depth": 1
            }
          ]
        },
        {
          "top": "Great potential here! I like the easy and friendliness of the tools to use. It would be nice to weld paths. I find myself having to clean up disjointed paths in svgs from time to time. Shapebuilding operations would be incredible, too. Great work!",
          "author": "blorenz",
          "replies": [
            {
              "text": "Thank you! Advanced shape building tools are already available in the third button of the bottom menu (Advanced Tools), and it also includes Trim Path. Boolean operations are implemented as well. I’ll add proper path welding/union to the roadmap. Cleaning messy SVG paths is one of the core problems VectorNest wants to solve, so this feedback is super valuable. Really appreciate you trying it!",
              "author": "ekrsulov",
              "depth": 1
            }
          ]
        },
        {
          "top": "This is awesome! One piece of feedback: on my gesture controlled phone the bottom menu is a bit too low, low enough to overlap with the \"gesture bar\" at the bottom.",
          "author": "sureglymop",
          "replies": [
            {
              "text": "Thank you for the feedback! I’ve created an issue in the repository to investigate this further.\nIf you’re able to share a bit more detail (device model, OS version, browser, and whether you’re using gesture navigation), that would really help me reproduce the behavior and validate a proper fix.\nReally appreciate you taking the time to report it.",
              "author": "ekrsulov",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47050872",
      "title": "Show HN: Pg-typesafe – Strongly typed queries for PostgreSQL and TypeScript",
      "link": "https://github.com/n-e/pg-typesafe",
      "domain": "github.com",
      "author": "n_e",
      "score": 67,
      "comment_count": 32,
      "created_ts": 1771352136,
      "is_internal": false,
      "post_text": "Throughout my career, I tried many tools to query PostgreSQL, and in the end, concluded that for what I do, the simplest is almost always the best: raw SQL queries.<p>Until now, I typed the results manually and relied on tests to catch problems. While this is OK in e.g., GoLang, it is quite annoying in TypeScript. First, because of the more powerful type system (it&#x27;s easier to guess that updated_at is a date than it is to guess whether it&#x27;s nullable or not), second, because of idiosyncrasies (INT4s are deserialised as JS numbers, but INT8s are deserialised as strings).<p>So I wrote pg-typesafe, with the goal of it being the less burdensome: you call queries exactly the same way as you would call node-pg, and they are fully typed.<p>It&#x27;s very new, but I&#x27;m already using it in a large-ish project, where it found several bugs and footguns, and also allowed me to remove many manual type definitions.",
      "is_ask_hn": false,
      "matched_keywords": [
        "career"
      ],
      "comments": [
        {
          "top": "Somewhat off topic, as someone who hasn't used PostgreSQL and only has experience with mysql/MariaDB... I've never liked writing queries with numbered parameters from an array with placeholders like $1 in this example. I find them much easier to read and debug when I pass them with string keys, basically:\n`UPDATE t SET x=:x WHERE 1`\n`{x:42}`\nI found that the original node-mysql didn't even allow this, so I wrote my own parser on top of it. But I don't see this style of binding used in examples very often. Is it frowned upon for some reason?",
          "author": "noduerme",
          "replies": [
            {
              "text": "PostgreSQL uses the format $1, $2 in the protocol, so I think it's just that nobody has bothered to implement named parameters in clients.\nIn another style, postgres.js uses calls such as sql`select * from t where id = ${variable}` (which is safe because it's a tagged template, not string interpolation).",
              "author": "n_e",
              "depth": 1
            },
            {
              "text": "A sometimes easier solution now in TS/JS is to use a simple template interpolation function (template tag) to inline the parameters and let the library autonumber them.\n    const x = 42\n    const id = 'example'\n    const { rows } = pgquery`Update t set x = ${x} where id = ${id}`\n\n\nThe pgquery function can convert that into the $1 and $2 that Postgres expects, but the source code is a little easier to read and has named parameters.\nOf course, it potentially makes debugging the query from the database side a little harder because the query itself in its running form is still going to show the $1 and $2 placeholders so you'd have to count \"holes\" to figure which is which when trying to grep which source line is generating that query. I know that's why some frown on this template-based auto-placeholders because they want the code to better resemble the queries as they run in Postgres.\n(Also yeah, it might be nice if Postgres also supported named placeholders like some of the other SQL databases do.)",
              "author": "WorldMaker",
              "depth": 1
            },
            {
              "text": "This is basically how we do it in .NET. With Dapper it’s particularly neat sometimes because you can just pass an object that you were using anyway, and it will match parameter names to its properties case-insensitively.\nI.e.\nQuery(\"select * from MyTable where Id = @Id\", myEntity)\nThe idiom is to use anonymous objects which you can new up inline like “new { id, age = 5 }”, where id is an existing variable that will automatically lend its name. So it’s pretty concise.\nThe syntax is Sql Server native (which supports named params at the protocol level), but the Npgsql dat provider converts it to PG’s positional system automatically.",
              "author": "wvbdmp",
              "depth": 1
            },
            {
              "text": "Clorinde does this. It lets you write raw sql (with keyword arguments) and generate  strongly typed Rust API (that deals with things like Option for nullable columns, etc)\nhttps://github.com/halcyonnouveau/clorinde/?tab=readme-ov-fi...",
              "author": "nextaccountic",
              "depth": 1
            }
          ]
        },
        {
          "top": "How do you guys solve the problem of conforming DB schema to TS interfaces (or vice versa depending on what you like)?\nDo you manually keep them in-sync (that's what I'm leaning into as the most practical solution)? Do you introspect the DB schema? Or maybe use something like Drizzle which autogenerates sql migration to keep the db schema in-sync",
          "author": "blue_pants",
          "replies": []
        },
        {
          "top": "How is this different than kysely + kysely-codegen (or hand-made types)?",
          "author": "barishnamazov",
          "replies": [
            {
              "text": "Kysely is a query builder: you build queries by calling javascript functions, while with pg-typesafe you write SQL directly.\nI've used kysely before creating pg-typesafe, and came to the conclusion that writing SQL directly is more convenient.\nA query builder works well for simple cases (db.selectFrom(\"t\").where(\"id\",\"=\",\"1\") looks a lot like the equivalent SQL), however, for more complicated queries it all falls apart. I often had to look at the docs to find how to translate some predicate from SQL to the required idiom. Also, I don't think kysely can automatically infer the return type of PostgreSQL functions, while pg-typed does (it asks PostgreSQL for it).",
              "author": "n_e",
              "depth": 1
            },
            {
              "text": "It only changes the types; not the code.",
              "author": "ZiiS",
              "depth": 1
            }
          ]
        },
        {
          "top": "If you're into Haskell prior art, there's postgresql-typed \nhttps://hackage.haskell.org/package/postgresql-typed-0.6.2.5...\n where you write queries, it safely(?) puts in your variables, and you automatically get back typed values.",
          "author": "1-more",
          "replies": [
            {
              "text": "Very interesting, thanks!\nI see they use the same global approach as pg-typed (asking for a ParameterDescription / RowDescription, which aren't usually exposed by the PG drivers), but there are interesting differences in the details. Also this made me realise that I could also type enums automatically.",
              "author": "n_e",
              "depth": 1
            },
            {
              "text": "I think plenty of ML languages have similar things. In F# SQL Type Providers have long been a mainstay (which makes using an ORM with F# almost meaningless IMO)\nhttps://learn.microsoft.com/en-us/dotnet/fsharp/tutorials/ty...\nSQLProvider is probably the most well known one: \nhttps://fsprojects.github.io/SQLProvider/\nIt’s really beautiful. You get type safety with SQL. If your code compiles, you guaranteed to have valid executable both F# code and SQL. Also you get to create composable queries.\nAnd there are other, thinner/leaner type providers as well. My favourite Postgres one is: \nhttps://github.com/Zaid-Ajaj/Npgsql.FSharp\nThis simple sample executes query and read results as table then map the results\nopen Npgsql.FSharp\ntype User = {\n    Id: int\n    FirstName: string\n    LastName: string\n}\nlet getAllUsers (connectionString: string) : User list =\n    connectionString\n    |> Sql.connect\n    |> Sql.query \"SELECT * FROM users\"\n    |> Sql.execute (fun read ->\n        {\n            Id = read.int \"user_id\"\n            FirstName = read.text \"first_name\"\n            LastName = read.text \"last_name\"\n        })",
              "author": "aryonoco",
              "depth": 1
            }
          ]
        },
        {
          "top": "Very nice! I am the author of Kanel* which generates types for each table, view, etc. I tend to use it together with Knex which gives me strong type safety from simple selects and updates and sporadic type safety from complex queries with joins etc.\nThe advantage to your approach (I guess) is increased type safety for complex queries, trading off the loss of \"fundamental\" types with, say, branded ID types? I guess the two approaches are quite complementary, perhaps I should try that.\n* \nhttps://github.com/kristiandupont/kanel",
          "author": "kristiandupont",
          "replies": [
            {
              "text": "Kanel is great! That's what I used before pg-typesafe, and I still use it for dynamic queries.\nRegarding the nominal/branded types, the typegen is configurable\n, so instead of e.g. mapping oid 20 to a bigint, you could map the field id of table foo to Foo[\"id\"] from kanel.\nsee this example \nhttps://github.com/n-e/pg-typesafe?tab=readme-ov-file#type-j...",
              "author": "n_e",
              "depth": 1
            },
            {
              "text": "Very cool! I'll try it out!",
              "author": "kristiandupont",
              "depth": 2
            }
          ]
        }
      ]
    },
    {
      "id": "47049884",
      "title": "Ask HN: How do you motivate your humans to stop AI-washing their emails?",
      "link": "https://news.ycombinator.com/item?id=47049884",
      "domain": "news.ycombinator.com",
      "author": "causal",
      "score": 26,
      "comment_count": 33,
      "created_ts": 1771348189,
      "is_internal": true,
      "post_text": "I see it more and more in email, Slack, text, etc: People too scared to share their own thoughts so they AI-wash it and send an exhausting page of &quot;It&#x27;s not X, it&#x27;s Y!&quot; slop instead.<p>I&#x27;m not the CEO, I can&#x27;t order people to stop. The CEO does it too.<p>I try talking to people directly, but people get defensive and there&#x27;s always the chance they didn&#x27;t use AI. I need indirect means of socializing change.<p>Looking for anything I can use to socialize against AI-washing: Articles, memes, policies that other companies have successfully used- whatever.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Put a culture of stopping work at 40 hours. Allow the work to be the work and stop deadlines.\nOtherwise, people will take every time savings possible. If I'm using AI for anything, it's because it's important enough to someone else for me to do but not important enough to sacrifice my own time.\nI don't think it's about people being scared, at least from what I've seen. It's about people being exhausted.",
          "author": "ebiester",
          "replies": [
            {
              "text": "If people are limited in how much time they work, they'll use AI to try to get more work done in that time. You'd have to also limit how much work people are expected to do. Good luck advocating for that change in modern corporations.",
              "author": "antonvs",
              "depth": 1
            },
            {
              "text": "> Otherwise, people will take every time savings possible\nAnd you're saying they won't if you only cap the maximum amount of time they can work?\n> It's about people being exhausted\nWork can be difficult and exhausting and I don't think that's necessarily a bad thing. When I started my job I was tired often because it was hard. I got better at it over time.\nI'm really not into any job where my value is strictly tied to the time I put into it. I much prefer a job that some weeks takes me a lot of time and some weeks takes not as much time.",
              "author": "paulcole",
              "depth": 1
            },
            {
              "text": "It’s not always exhaustion, though. I work with several people who blindly spout AI responses out of sheer laziness.",
              "author": "mfro",
              "depth": 1
            }
          ]
        },
        {
          "top": "If people are scared to share their thoughts, then \nthat\n seems like the problem.\nAlso, how much of this communication is actually necessary? If someone doesn't care about an issue enough to write their own email, then why are they sending an email about it in the first place?",
          "author": "impendia",
          "replies": []
        },
        {
          "top": "If the AI does spelling and grammar fixups, I'll root for the AI.\nWhen I was in corporate IT, I got \nway\n too much internal email that looked like it had been pecked out by an autistic second-grader, with random spelling, capitalization, and punctuation. Which wasn't as much of a problem as the chain-of-consciousness blather of jumbled words that often made no sense at all.\nSome of those people were Ph.Ds in charge of multimillion-dollar subsidiaries and dozens or hundreds of employees, but they may have well have been trying to communicate by interpretive farting and tap-dancing.",
          "author": "Froedlich",
          "replies": [
            {
              "text": "I feel like this could have done without the ableist quip, however I also see this in my industry as well, especially among higher-ups. Funnily enough this was the topic of another discussion yesterday[0].\n0: \nhttps://news.ycombinator.com/item?id=47038125\nEdit: Which I see was just shared by someone else here hours before me, so I guess I'm not all that safe from the brain rot myself haha.",
              "author": "samtheDamned",
              "depth": 1
            },
            {
              "text": "> Some of those people were Ph.Ds\nRead any of the Epstein emails? Many are nearly unintelligible, despite the \"world-renowned luminaries\" that wrote them.\nThe phenomenon was discussed in a post here yesterday that linked to post titled \"Privilege is bad grammar\": \nhttps://news.ycombinator.com/item?id=47038125",
              "author": "NietzscheanNull",
              "depth": 1
            }
          ]
        },
        {
          "top": "I tried to write my first blog posts using AI. I created dozens of restrictions and rules so that it would produce human-like text, which I then edited. The text contained only my thoughts, but the AI formatted them. However, no matter how much I tried to prohibit constructions such as \"It's not X, it's Y!\", it still added them. I had to revise 10 drafts before I had the final version. When I stopped using AI for my texts, my productivity increased, and I can now complete an essay in 1-2 drafts, which is 5 times faster than when using AI.\nThis is strikingly different from development. In development, AI increases my productivity fivefold, but in texts, it slows me down.\nI thought, maybe the problem is simply that I don't know how to write texts, but I do know how to develop?\nBut the thing is, AI development uses standard code, with recognized patterns, techniques, and architecture. It does what (almost) the best programmer in their field would do. And its code can be checked with linters and tests. It's verifiable work.\nBut AI is not yet capable of writing text the way a living person does. Because text cannot be verified.",
          "author": "theorchid",
          "replies": [
            {
              "text": "Verifiability is part of it, but I think the \"semantic ablation\" article on the front page really captures my problem with AI-washed writing: \nhttps://www.theregister.com/2026/02/16/semantic_ablation_ai_...\nI think any use of AI \"unrolls\" the prompt into a longer but thinner form. This is true of code too I think, but it's still useful because so much of coding is boilerplate and methods that have been written a thousand times before. Great, give me the standard implementation, who cares.\nBut if you're doing hard algorithmic work and really trying to do novel \"computer science\", I suspect semantic ablation would take an unacceptable toll.",
              "author": "causal",
              "depth": 1
            }
          ]
        },
        {
          "top": "A noble but essentially Sisyphean goal, you might as well try to get people to stop playing with their phones.",
          "author": "jjgreen",
          "replies": [
            {
              "text": "Fair but I have seen workplaces keep phone use largely curtailed. Surely it's not so impossible with AI...right? Right...? :/",
              "author": "causal",
              "depth": 1
            },
            {
              "text": "How have you seen workplaces keep phone use curtailed? I spent a month visiting an office we had in India. Phones were not allowed in the work area. There were lockers outside where people were supposed to lock up their phones before going through the gates to get into the work area. I locked up my phone at the start, but then realized almost everyone still had their phones, they were just sly about using them. By the end of the trip I stopped using the locker.",
              "author": "al_borland",
              "depth": 2
            }
          ]
        }
      ]
    },
    {
      "id": "47039747",
      "title": "Ask HN: Why is YouTube's recommendation system so bad?",
      "link": "https://news.ycombinator.com/item?id=47039747",
      "domain": "news.ycombinator.com",
      "author": "mr-pink",
      "score": 14,
      "comment_count": 15,
      "created_ts": 1771272960,
      "is_internal": true,
      "post_text": "I watch one Steve jobs video all year, happens to be last week. I don&#x27;t need 30% of recommendations to be related to Steve Jobs from here on out.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "That's why I started Tech Talks Weekly \nhttps://www.techtalksweekly.io/\nYouTube's algorithm is built to maximize engagement for a broad audience. Especially shorts with animated \"jumping\" captions and videos that zoom in and out every three seconds providing no useful content most of the time.\nI found it really frustrating that almost every tech conference talk ends up on YouTube, yet it's surprisingly hard to discover the ones I'd find interesting.\nSo I wrote a script that fetches all the talks from the channels I follow each week, groups them by conference, and sorts them by view count. That way, I spend about five minutes a week and quickly find the really good ones.\nIn 2024, I turned it into a newsletter. I use the exact same script and I just copy and paste the results into Substack. It turns out many people are facing the same problem because it grew to over 8,400 subscribers as of today.",
          "author": "techtalksweekly",
          "replies": []
        },
        {
          "top": "Because for every one person that finds the recommendation system bad there must be ten others that find it so spot on that they spend 8 hours watching and clicking. It's the only explanation that makes sense.",
          "author": "avian",
          "replies": []
        },
        {
          "top": "YouTube's recommendation system is great... for children.",
          "author": "fraaancis",
          "replies": []
        },
        {
          "top": "Having your feed full of a thing you've recently watched at least makes sense.\nWhat boggles my mind is videos that have been sitting in my Recommended for a few months now - if I haven't clicked it the first 45 times, I probably won't click it the 46th.",
          "author": "nananana9",
          "replies": []
        },
        {
          "top": "This is how people fall down YouTube rabbit holes for hours. This is by design.",
          "author": "al_borland",
          "replies": []
        }
      ]
    },
    {
      "id": "47027650",
      "title": "Ask HN: Ranking sliders on a personal blog?",
      "link": "https://news.ycombinator.com/item?id=47027650",
      "domain": "news.ycombinator.com",
      "author": "incognito124",
      "score": 13,
      "comment_count": 1,
      "created_ts": 1771190298,
      "is_internal": true,
      "post_text": "Hi,<p>A few months ago, I came across a personal blog here on HN with the main feature being about ~4 sliders that change the weights of all posts and rank them in real time. I think some of the sliders were for &quot;popularity&quot;, &quot;recency&quot; and perhaps &quot;author&#x27;s score&quot;. I also think, but I&#x27;m not sure, that the blog featured general ML topics.<p>I played with the sliders for sometime and had a great time exploring the blog, but I have since failed to find it again. I should&#x27;ve bookmark it then.<p>Does anyone have some clue about it? Much appreciated",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "No, but I have wanted to implement this on my site, and I have seen examples of it in the wild (maybe even the same one).\nIt seems like the hard part would be categorizing the posts accurately, and picking the axes to filter.",
          "author": "Curiositry",
          "replies": []
        }
      ]
    },
    {
      "id": "47060234",
      "title": "Tell HN: We analyzed our dev time.80% is still infrastructure'setup',notfeatures",
      "link": "https://news.ycombinator.com/item?id=47060234",
      "domain": "news.ycombinator.com",
      "author": "thesssaism",
      "score": 12,
      "comment_count": 4,
      "created_ts": 1771417213,
      "is_internal": true,
      "post_text": "We recently did a deep dive into our engineering time allocation for a standard 5-person team building a B2B SaaS application. The results were pretty depressing: we spent roughly 960 hours (annualized) on &quot;setup&quot; tasks—environment config, auth flows, RBAC, CI&#x2F;CD pipelines, and database scaffolding—before we built a single unique feature that actually differentiated the product.<p>I’m sharing this because I think we’ve become numb to the &quot;Setup Tax&quot; in web development. We assume it&#x27;s just the cost of doing business, but when you look at the economics, it’s a disaster.<p>The problem isn&#x27;t just &quot;writing boilerplate.&quot; It&#x27;s the decision fatigue and integration cost that comes with it. Even with modern frameworks, we found that for a standard CRUD app, about 80% of our engineering effort went into the &quot;commodity layer&quot;—the stuff that every SaaS has, but no customer pays for. Only 20% went into the unique business logic.<p>We tried to fix this by throwing more bodies at it, but that just increased coordination overhead. So we tried something different: instead of using AI to write code snippets (Copilot style), we used it to generate the entire architectural foundation at once. I&#x27;m talking about the full repo structure, the Docker configs, the auth integration, the API gateways—the whole boring 80%.<p>The goal was to invert that ratio. To get to a point where 70% of our time is on features and only 30% on glue code.<p>The results from our initial runs suggest it works, but the math is what’s interesting. Moving from 20% feature focus to 70% feature focus isn&#x27;t just a linear improvement. It’s a 3.5x multiplier on <i>feature velocity</i>. The total lines of code produced might be similar, but the amount of <i>valuable</i> code shipping to production skyrockets.<p>Obviously, there are massive trade-offs here.<p>First, you end up with a very generic architecture initially. If you need something novel or specialized (like high-frequency trading or deep tech), this approach is useless. It only works for the &quot;standard web app&quot; pattern.<p>Second, there&#x27;s a real risk of &quot;black box&quot; infrastructure. If the team doesn&#x27;t understand the generated auth flow, they can&#x27;t debug it when it inevitably breaks. We have to enforce strict governance to stop this from becoming generated spaghetti.<p>Third, I&#x27;m not sure if this efficiency holds up long-term. Maintenance is always the real killer, not day-one setup. We haven&#x27;t been doing this long enough to see if the generated foundations rot faster than bespoke ones.<p>I&#x27;m curious what others are seeing:<p>- Does anyone else track &quot;time to first feature&quot;?\n- What is your ratio of infrastructure&#x2F;boilerplate vs. actual business logic?\n- Have internal developer platforms (IDPs) actually solved this for you, or did they just hide the maintenance cost elsewhere?<p>It feels like we&#x27;re at a weird inflection point where &quot;starting from scratch&quot; is becoming economically irresponsible for standard software, but the alternative feels like cheating.",
      "is_ask_hn": false,
      "matched_keywords": [
        "team"
      ],
      "comments": [
        {
          "top": "It seems like your priorities are backwards. CI/CD is meant to keep your product stable, there's no point if there's no product to keep stable. DB scaffolding & proper environment config is meant to help you maintain velocity & allow for the proper dev/staging/prod pipeline for testing & scale up to meet your customer needs. But there's no velocity to maintain and no scale to meet.\nAuth flows are important for enterprise customers, but just use an existing off the shelf library for oauth/SSO. Depending on your customers, this is a feature. If you mean auth flows between your own services, then you've overengineered it.\nBasically none of the things you've listed are as important as having features that attract customers. Those things you build afterwards for stability and velocity.\nI'm biased, but in 2026 I would just use a Ruby on Rails monolith with Postgres. You don't even need to containerize it until the stack becomes too complex to run locally.",
          "author": "ativzzz",
          "replies": []
        },
        {
          "top": "Unfortunately only Ruby on Rails world seems to systematically care about devx and infra friction. Others just got used to throwing more money and people on it.",
          "author": "aristofun",
          "replies": []
        },
        {
          "top": "Did you explore any of the libraries or frameworks that are meant to bootstrap a SaaS with all of the batteries included?",
          "author": "phone_book",
          "replies": []
        },
        {
          "top": "Try Rails or Django.",
          "author": "the__alchemist",
          "replies": []
        }
      ]
    },
    {
      "id": "47039805",
      "title": "Ask HN: Companies that advertise being a \"best place to work\", is it a red flag?",
      "link": "https://news.ycombinator.com/item?id=47039805",
      "domain": "news.ycombinator.com",
      "author": "jrs235",
      "score": 12,
      "comment_count": 15,
      "created_ts": 1771273194,
      "is_internal": true,
      "post_text": "When companies push, advertise, and promote that they are or were voted a &quot;best place to work&quot;, is that a red flag when considering to work there? I feel like it&#x27;s more about convincing current workers than anything. Thoughts?",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "So when I was at Bank of America they did advertise about being a “best place to work”, but it was well earned. Their benefits were great, they were super inclusive, and management really focused on taking care of people.\nI left the bank for a small company that also claimed to be a best place to work. I didnt like the project I was on and they were quick to fire people to keep metrics like this up.\nI currently work for a small company that does not advertise about this and just might be the best employer I have ever had. It’s all about the people you work with and the quality of your leaders.",
          "author": "austin-cheney",
          "replies": []
        },
        {
          "top": "You should look at the organization / methodology of the survey, but generally it's a positive to get ranked IMO. I used to get surveys these yearly at a past job from the Boston Globe / Best Places to Work and it was basically a third-party email to all employees with a survey you'd fill out.\nThe most anyone could realistically ask you to do was please fill out the survey positively to try and support the company if you believe it's a best place to work and remind more people to complete the surveys. I don't think companies are really out here trying to game the more reputable surveys, and it would be pretty easily for single employees to defect/report if they were. They also required some level of basic written comments from employees.\nProbably a mild green flag for quality of life / general happiness from current employees for the past year.",
          "author": "natdempk",
          "replies": []
        },
        {
          "top": "I have no proof of this, but it feels like it’s pay-to-play. I assume it’s a way to attract talent and make customers feel good. Current employees shouldn’t need an external poll to tell them if people are happy or not.\nWhere I work is almost always on these lists. In my experience it is highly dependent on department. I didn’t realize this until transferring to an office that had very few IT workers. Everyone in IT seemed miserable, while everyone outside of IT seemed extremely happy. I once made a rather sarcastic and cynical joke in the elevator to someone in a customer support role and it went over like a led ballon… but that was the language of everyone I worked with in IT. It was wild to me how two departments sitting 50 feet from each other could have such drastically different cultures. On town halls, everyone in the chat is brimming with company pride, meanwhile the side chats from people in the IT org are full of cynicism and sarcasm, with everyone trying to understand if these people are real or just bots… but I think they’re real.",
          "author": "al_borland",
          "replies": []
        },
        {
          "top": "I never trust surveys of companies even if it is a reputable 3rd party.  There are too many ways to game such systems.  If I wanted real answers I would find out who works in the group(s) I might end up in and reach out to them via email if I can and then set up a call.  I would be honest and say I do not trust surveys of \"best places to work\" and would happily sign an NDA to not share their brutally honest answers.  Even that I would take with a grain of salt as they may think it is a test or trap.\nConvincing current employees may work on those that are isolated but if one works in a toxic environment they will likely know it.  There was a time I would have semi-trusted sites like \nf'd company\n of long ago but those get infiltrated, sued and ultimately compromised by corporations that do not like people airing their dirty laundry and also gamified by their competitors.\nIf a new position turns out to be a crap-show I would just leave and not add it to my CV.  If an individual manager is the issue, those come and go.  I have found it very easy to make them explore new opportunities.",
          "author": "Bender",
          "replies": []
        },
        {
          "top": "Its meaningless cause every single place I worked at had labelled itself a \"Great^TM\" place to work at, but I only was kinda happy at one, and the other two were toxic hellholes.\nGlassdoor, Indeed and Blind are more reliable. Also word of mouth.",
          "author": "anshumankmr",
          "replies": []
        }
      ]
    },
    {
      "id": "47019122",
      "title": "Ask HN: Want to move to use a \"dumb\" phone. How to make the switch?",
      "link": "https://news.ycombinator.com/item?id=47019122",
      "domain": "news.ycombinator.com",
      "author": "absoluteunit1",
      "score": 12,
      "comment_count": 13,
      "created_ts": 1771108659,
      "is_internal": true,
      "post_text": "Hi<p>I’m curious if anyone here has successfully moved to using a dumb phone. By dumb phone - I mean literally texting &#x2F; calling only. No internet, etc.<p>Immediate isssues I see is not being able to use Authenticator apps. Not being able to use maps. Etc.<p>Has anyone made the switch and how to best go about it?",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "For me it's mostly about your awareness and motivation, and you can test both with almost every phone on the market (well at least on Android).\nJust use the \"ultra\" power saving mode your current phone has. It's not a fully universal advise, but usually it will make your screen turn grayscale, disable background services, replace your launcher with a much simpler one and then allow you to add 3-5 apps to use. On my phones it's configurable (like, you can keep colors, etc).\nYou can still use 5G and read email, use an IM. But you have to prioritize and your notifications are severely limited.\nI personally consolidated all mail to Thunderbird mobile which checks mail every 3-4 hours only and it had zero impact on me (I can always refresh manually if I need to confirm login email etc).",
          "author": "szszrk",
          "replies": []
        },
        {
          "top": "This question gets asked quite a bit.\nhttps://hn.algolia.com/?q=dumb+phone\nMy take is: don't. There's very few dumb phones to choose from anymore, they are mostly slow, laggy, and insecure. The older classics are no longer compatible with existing cellular networks.\nIf you have no self-control, it's better to use a smart phone with the apps removed and the device locked down (give the \"key\" to someone you trust).",
          "author": "runjake",
          "replies": []
        },
        {
          "top": "I tried it for a few months. What helped was keeping a basic smartphone at home on Wi-Fi just for authenticator apps and maps planning before heading out. The key is not going fully offline — it is removing instant access during the day. The friction actually makes you more intentional.",
          "author": "allinonetools_",
          "replies": []
        },
        {
          "top": "For why? Get a pixel, install graphene. And use the utilities that serve you. Text/voice communications, GPS, MP3 music player (if you listen to music), a web browser. Maybe google translate and your banking apps (or use a browser for either).\nThere is no place for garbage like Instagram, Facebook, TikTok, or YouTube on your phone. It's a device for utility, not entertainment consumption.",
          "author": "7777332215",
          "replies": []
        },
        {
          "top": "As a note: there are almost no true dumb phones in existence anymore. Almost all flip phones are smart phones in disguise, with either a cut-down version of Android (with all the data collection that entails) or KaiOS under the hood.\nAt this point, you might be best served by obtaining a Rotary Un-SmartPhone (\nhttps://skysedge.com/RUSP/index.html\n ) once they start production up again. Now \nthat\n is a true dumb phone.",
          "author": "rekabis",
          "replies": [
            {
              "text": "What a beautiful little device",
              "author": "barbazoo",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47043484",
      "title": "Ask HN: How do companies that use Cursor handle compliance?",
      "link": "https://news.ycombinator.com/item?id=47043484",
      "domain": "news.ycombinator.com",
      "author": "Poomba",
      "score": 8,
      "comment_count": 4,
      "created_ts": 1771300080,
      "is_internal": true,
      "post_text": "I&#x27;m trying to decide whether to adopt Cursor for our company, but we&#x27;re in a heavily regulated industry and our compliance team is flagging concerns about HIPAA&#x2F;SOC2&#x2F;audit trails.<p>The thing is, there are companies in regulated industries using it [1][2]. But Cursor has no HIPAA BAA, no FedRAMP certification, and is cloud-only with all requests routing through their AWS infrastructure. (This is probably true for Claude and other coding assistants, though I&#x27;ve only looked seriously at Cursor.)<p>So how are regulated companies actually making this work? Or do most just avoid Cursor and other AI coding tools altogether?<p>[1] 165 healthcare companies use Cursor according to Bloomberry: https:&#x2F;&#x2F;bloomberry.com&#x2F;data&#x2F;cursor&#x2F;<p>[2] Cursor&#x27;s customers include Sanofi, Johnson &amp; Johnson, and Neuralink: https:&#x2F;&#x2F;cursor.com&#x2F;customers",
      "is_ask_hn": true,
      "matched_keywords": [
        "team"
      ],
      "comments": [
        {
          "top": "This has less to do with Cursor and more to do with standard processes.  Day to day use,  your developers development environment should not have access to any data that comes under HIPAA (the one compliance framework I’m familiar with)\nIf your developer machines don’t have access to regulated data, neither will Cursor.  As far as I know none of those compliance frameworks have anything to do with your code, it’s about accessing data and how you promote your code to production\nI’ve never used cursor.  But Claude Code gives you the option of using AWS Bedrock hosted models - including Anthropomorphic.  You can sign a BAA with AWS.  Notice this is using Anthropic models through an AWS account - not directly from Anthropic.",
          "author": "raw_anon_1111",
          "replies": [
            {
              "text": "HIPAA is one of the few that makes clear the types of data (PHI and PII) that come under the frameworks purview during development which makes masking mandatory for non-production environments. Other frameworks families, NIST RMF, FedRAMP and CMMC very much care about software development practices in depth.",
              "author": "notesinthefield",
              "depth": 1
            },
            {
              "text": "But do they care whether your \ncode\n was shared with a third party?",
              "author": "raw_anon_1111",
              "depth": 2
            }
          ]
        },
        {
          "top": "Copilot can be used in these situations, that's what most of our devs use. I suspect Claude Code is going to be evaluated in the near future. Personally, I have permission from the CTO to hook my custom agent up to the GCloud Vertex APIs because we know it all stays in Google, which is compliant across their portfolio. Microslop is too, which is why Copilot is available. All the frontier models are available as well between both Google and Microsoft, I have no need for OpenAI or xAI, so VertexAI has everything I personally want.",
          "author": "verdverm",
          "replies": []
        }
      ]
    },
    {
      "id": "47023094",
      "title": "Ask HN: LLMs helping you read papers and books",
      "link": "https://news.ycombinator.com/item?id=47023094",
      "domain": "news.ycombinator.com",
      "author": "amelius",
      "score": 8,
      "comment_count": 4,
      "created_ts": 1771157588,
      "is_internal": true,
      "post_text": "I&#x27;m curious what HN&#x27;s experiences are with using LLMs for reading and comprehending papers and textbooks. Do you use special tools that make the process easier? Do they work?<p>I&#x27;m thinking of a book that you can ask questions. It can explain topics in more detail, or it can tell you that the thing you asked will be explained later in the book. And it will allow you to skip material that you are already familiar with. Provide references to other resources, etc.<p>Maybe ingesting an entire book is too much for current LLMs, but I&#x27;m sure there are ways around that.<p>Note: I am __not__ trying to build such a tool myself.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "FWIW, I like the following simple prompt to rewrite text the way the author should have written it in the first place (in most cases):\n> Distill $content by condensing sentences without loss of meaning and then restructuring as a Minto Pyramid. Use point headings, not trite labels; prose, not bullet points; and up to four outline levels, as appropriate. Provide summary umbrella sections to enumerate upcoming sub-points.\nThat usually gets the main points toward the top and logically organizes supporting details. It lets me quickly grok the gist. But it's always lossy and doesn't convey all levels of the text.\nIf the text is worth reading and understanding, then I like to paste the original text into a plain text file or outliner; put each sentence on its own line (you can use an LLM for this but regex is better, faster, and cheaper); and both rewrite and reorganize it myself. (Sublime Text and outliners such as Bike and OmniOutliner make moving and indenting lines easy with keyboard shortcuts.)\nPS: People need to learn that they should either write better in the first place or else have an LLM properly structure their writing so that it gets done correctly once \"on the server side\" instead of forcing each reader to do it for them many times (inefficiently and more expensively) on the reader / \"client side\".\nPPS: Kagi's Research and Research (Experimental) models work well with the prompt suggested above.",
          "author": "treetalker",
          "replies": []
        },
        {
          "top": "From my experience I had more success asking LLMs to compare three different sources and ask it to identify common themes. Then go over each source giving me direct quotes supporting the theme. For complex writing, I usually find it cannot decipher circular references or poorly organized writing. It tends to always think the point or argument is up front even when it is buried in the middle.",
          "author": "rawgabbit",
          "replies": []
        },
        {
          "top": "400 pages at 400 words per page is 160,000 words. \nX1.33 tokens \n≈212,800 tokens\nMost models local or cloud have issues with very long contexts even if they “support” 1M context window.\nI’ve tried local models and around 30K context, it starts making up or summarizing content to store it in memory and will not fully reproduce the input.\nYou could try re-training a local model on a book or implementation of RAG.\nI don’t know how latest local models would handle 200k context window but RAG may help keep the memory context clean.",
          "author": "instagib",
          "replies": []
        },
        {
          "top": "NotebookLM?",
          "author": "isuckatcoding",
          "replies": []
        }
      ]
    },
    {
      "id": "47055450",
      "title": "Ask HN: How do you overcome imposter syndrome?",
      "link": "https://news.ycombinator.com/item?id=47055450",
      "domain": "news.ycombinator.com",
      "author": "fdneng",
      "score": 7,
      "comment_count": 10,
      "created_ts": 1771374543,
      "is_internal": true,
      "post_text": "I’ve been working at YC-backed startups since graduating from university. I’m now at a company building a deeply distributed systems product, and I’m surrounded by incredibly talented engineers who seem exceptionally strong at what they do. They often have knowledge and intuition about things I barely understand.<p>Lately, I’ve been feeling inadequate — like I’m contributing more to the less exciting parts of the product rather than the “cool” or core engineering challenges.<p>On top of that, I’m an immigrant and my wife and I are expecting. Balancing that with a fully remote job has been difficult, and at times I feel like I’ve lost some of my competence or sharpness. I’m taking steps to address this — I’ll be speaking with a psychologist soon — but I genuinely wonder: how does someone overcome these feelings while working within a high-functioning engineering team?",
      "is_ask_hn": true,
      "matched_keywords": [
        "team",
        "remote",
        "imposter"
      ],
      "comments": [
        {
          "top": "It goes away over time and with experience. As you become more situated in your current company your confidence will grow and you'll become more productive.\n'Are you contributing enough' is a less important question than 'are you passionate about the field and do you like what you're doing'. If you're just in it for the money and uninterested in learning that'll make it much harder to reach a higher level of productivity.",
          "author": "Desafinado",
          "replies": []
        },
        {
          "top": "Some of it may never go away, as there is always more to know and you’ll never know it all. That’s what the team is for; together you can know more than any one person alone. Each person ends up having their areas of expertise.\nSome acceptance of this and realization that you’re part of that team will come in time. When I first started working I felt like I should quit before they figured out I didn’t know anything. I felt like I always had to go ask other people questions. At a certain point, that dynamic flipped and I was spending all day answering questions from other people. These days, it’s more balanced. There are things I go to others for, and I think they’re brilliant at what they do. Those people also come to me for help on things I have more experience in. It’s a give and take. When you start, it will be more take than give, but that’s how everyone starts.",
          "author": "al_borland",
          "replies": []
        },
        {
          "top": "Imposter syndrome is a thinking trap.  A couple of things you can do to help:\nTry to separate out 'ruminating' from 'thinking'.  What's the difference? For our purposes 'thinking' has a fixed outcome and an end point.  Trying to solve a coding problem. Working out how to make dinner. Calculating your taxes. When you reach your goal, you're done and you stop.  'Ruminating' has no end point. There is not end or action associated with it.  The tricky part is that it often masquerades as thinking, so you feel like you're solving a problem.\nFor example, you do a job interview and you go over and over what happened in your mind. \"Maybe I should have answered this differently\". \"Maybe I should've prepared some more of these questions\".  Of course, you can't change what happened in the past. You're just rolling the ideas around in your head and probably making yourself feel worse and worse.  Rumination can be focused on the past, the future or even some hypothetical, imaginary situation (\"What if I lost my job\", \"What if my house burnt down\"). Again, actual preparation (Saving an emergency fund. Getting insurance) has an action associated, but rumination never ends, it just keeps going around in your head.\nThe other thing is to keep an accurate record of your performance. This will be different for everyone, and varies a lot depending on the job.  The key thing is to make the record as close in time to the action as possible.  For example, you feel like your pull requests aren't as good as other people's. Don't wait until the end of the week and then reflect on the quality of your work. Instead, every time your make a pull request, write down an accurate, objective assessment of the quality.\nPeople who suffer from imposter syndrome tend to forget their wins and remember their losses again and again (there's that rumination!). By having an accurate record that you made yourself you can cut through this and show to yourself your true performance.",
          "author": "laurieg",
          "replies": []
        },
        {
          "top": "You just do what you are supposed to do, learn, grow.\nThere’s nothing you can or should explicitly do about imposter syndrome feeling per se.\nBut what you describe doesn’t sound like this. So it’s a good move to first identify the problem correctly with help of others.",
          "author": "aristofun",
          "replies": []
        },
        {
          "top": "i am sorry, but this might not be imposter syndrome. others might work on more advanced stuff than you and might be more experienced in their domain. that is not imposter syndrome.\nbut either way, don‘t worry. it won‘t take long after birth of your child, until your outlook on most things will change profoundly. just ignore it for a while. your life until now was the intro. the real part is yet to come.\nbest wishes to you and your family. love yourself and keep enough room to be the father you want to be. everything else will fall into place. good luck.",
          "author": "endofreach",
          "replies": []
        }
      ]
    },
    {
      "id": "47055119",
      "title": "Ask HN: Claude web blocked its assets visit via csp?",
      "link": "https://news.ycombinator.com/item?id=47055119",
      "domain": "news.ycombinator.com",
      "author": "xgstation",
      "score": 6,
      "comment_count": 2,
      "created_ts": 1771371918,
      "is_internal": true,
      "post_text": "returned CSP header as following while all assets access to `https:&#x2F;&#x2F;assets-proxy.anthropic.com` is blocked<p><pre><code>    script-src &#x27;strict-dynamic&#x27; https: &#x27;nonce-0f2f&#x2F;yV7CL8nKlXr&#x2F;lFMPA==&#x27; https:&#x2F;&#x2F;via.intercom.io https:&#x2F;&#x2F;api.intercom.io https:&#x2F;&#x2F;api.au.intercom.io https:&#x2F;&#x2F;api.eu.intercom.io https:&#x2F;&#x2F;api-iam.intercom.io https:&#x2F;&#x2F;api-iam.eu.intercom.io https:&#x2F;&#x2F;api-iam.au.intercom.io https:&#x2F;&#x2F;api-ping.intercom.io https:&#x2F;&#x2F;nexus-websocket-a.intercom.io wss:&#x2F;&#x2F;nexus-websocket-a.intercom.io https:&#x2F;&#x2F;nexus-websocket-b.intercom.io wss:&#x2F;&#x2F;nexus-websocket-b.intercom.io https:&#x2F;&#x2F;nexus-europe-websocket.intercom.io wss:&#x2F;&#x2F;nexus-europe-websocket.intercom.io https:&#x2F;&#x2F;nexus-australia-websocket.intercom.io wss:&#x2F;&#x2F;nexus-australia-websocket.intercom.io https:&#x2F;&#x2F;uploads.intercomcdn.com https:&#x2F;&#x2F;uploads.intercomcdn.eu https:&#x2F;&#x2F;uploads.au.intercomcdn.com https:&#x2F;&#x2F;uploads.eu.intercomcdn.com https:&#x2F;&#x2F;uploads.intercomusercontent.com https:&#x2F;&#x2F;maps.googleapis.com https:&#x2F;&#x2F;maps.gstatic.com &#x27;wasm-unsafe-eval&#x27;; object-src &#x27;none&#x27;; base-uri &#x27;none&#x27;; frame-ancestors &#x27;self&#x27;; block-all-mixed-content; img-src &#x27;self&#x27; data: blob: *.anthropic.com *.claude.ai *.claude.com *.ant.dev *.gstatic.com * https:&#x2F;&#x2F;js.intercomcdn.com https:&#x2F;&#x2F;static.intercomassets.com https:&#x2F;&#x2F;downloads.intercomcdn.com https:&#x2F;&#x2F;downloads.intercomcdn.eu https:&#x2F;&#x2F;downloads.au.intercomcdn.com https:&#x2F;&#x2F;uploads.intercomusercontent.com https:&#x2F;&#x2F;gifs.intercomcdn.com https:&#x2F;&#x2F;video-messages.intercomcdn.com https:&#x2F;&#x2F;messenger-apps.intercom.io https:&#x2F;&#x2F;messenger-apps.eu.intercom.io https:&#x2F;&#x2F;messenger-apps.au.intercom.io https:&#x2F;&#x2F;*.intercom-attachments-1.com https:&#x2F;&#x2F;*.intercom-attachments.eu https:&#x2F;&#x2F;*.au.intercom-attachments.com https:&#x2F;&#x2F;*.intercom-attachments-2.com https:&#x2F;&#x2F;*.intercom-attachments-3.com https:&#x2F;&#x2F;*.intercom-attachments-4.com https:&#x2F;&#x2F;*.intercom-attachments-5.com https:&#x2F;&#x2F;*.intercom-attachments-6.com https:&#x2F;&#x2F;*.intercom-attachments-7.com https:&#x2F;&#x2F;*.intercom-attachments-8.com https:&#x2F;&#x2F;*.intercom-attachments-9.com https:&#x2F;&#x2F;static.intercomassets.eu https:&#x2F;&#x2F;static.au.intercomassets.com; frame-src a-cdn.claude.ai a.claude.ai a.claude-ai.staging.ant.dev b.stripecdn.com embedded-dashboards.metronome.com forms.hsforms.com googletagmanager.com js.stripe.com m.stripe.network newassets.hcaptcha.com pay.google.com r.stripe.com www.google.com accounts.google.com www.youtube-nocookie.com https:&#x2F;&#x2F;intercom-sheets.com https:&#x2F;&#x2F;www.intercom-reporting.com https:&#x2F;&#x2F;www.youtube.com https:&#x2F;&#x2F;player.vimeo.com https:&#x2F;&#x2F;fast.wistia.net https:&#x2F;&#x2F;www.claudeusercontent.com https:&#x2F;&#x2F;www.claudemcpclient.com *.claudemcpcontent.com https:&#x2F;&#x2F;claude.ai; font-src &#x27;self&#x27; assets.claude.ai https:&#x2F;&#x2F;js.intercomcdn.com https:&#x2F;&#x2F;fonts.intercomcdn.com; form-action &#x27;self&#x27; https:&#x2F;&#x2F;forms.hsforms.com https:&#x2F;&#x2F;intercom.help https:&#x2F;&#x2F;api-iam.intercom.io https:&#x2F;&#x2F;api-iam.eu.intercom.io https:&#x2F;&#x2F;api-iam.au.intercom.io; media-src &#x27;self&#x27; cdn.sanity.io https:&#x2F;&#x2F;assets.claude.ai https:&#x2F;&#x2F;js.intercomcdn.com https:&#x2F;&#x2F;downloads.intercomcdn.com https:&#x2F;&#x2F;downloads.intercomcdn.eu https:&#x2F;&#x2F;downloads.au.intercomcdn.com; upgrade-insecure-requests</code></pre>",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "DNS for that host is borked. Obligatory \"it's always DNS\"",
          "author": "yogipatel",
          "replies": []
        },
        {
          "top": "yeah same here",
          "author": "qrian",
          "replies": []
        }
      ]
    },
    {
      "id": "47015165",
      "title": "Ask HN: Info on the 1982 Apple 2 text game Abuse?",
      "link": "https://news.ycombinator.com/item?id=47015165",
      "domain": "news.ycombinator.com",
      "author": "jmount",
      "score": 6,
      "comment_count": 2,
      "created_ts": 1771082440,
      "is_internal": true,
      "post_text": "Does anyone have a source on info for the 1982 Apple 2 video game Abuse? The web&#x2F;ChatGPT seem to think it never existed. Here is an eBay link to an old disk: <a href=\"https:&#x2F;&#x2F;www.ebay.com&#x2F;itm&#x2F;306072842554\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ebay.com&#x2F;itm&#x2F;306072842554</a>",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Might be here:\nhttps://mirrors.apple2.org.za/ftp.apple.asimov.net/images/ga...\nSearch for Abuse.dsk.",
          "author": "jonahbenton",
          "replies": []
        },
        {
          "top": "Try this? \nhttps://archive.org/details/abusesoftsmithsoftware",
          "author": "bombcar",
          "replies": []
        }
      ]
    }
  ]
}