{
  "scraped_date": "2026-02-22",
  "source": "hacker_news",
  "total_scraped": 128,
  "nontech_count": 25,
  "posts": [
    {
      "id": "47049824",
      "title": "Thank HN: You helped save 33k lives",
      "link": "https://news.ycombinator.com/item?id=47049824",
      "domain": "news.ycombinator.com",
      "author": "chaseadam17",
      "score": 1138,
      "comment_count": 113,
      "created_ts": 1771347978,
      "is_internal": true,
      "post_text": "13 years ago, we launched Watsi.org with a Show HN [1].<p>For nearly a year, this community drove so much traffic that we couldn’t list patients fast enough. Then pg saw us on HN, wrote us our first big check, and accepted us as the first YC nonprofit (W13). The next few years were a whirlwind.<p>I was a young, naive founder with just enough experience to know I wanted Watsi to be more efficient, transparent, and innovative than most nonprofits. We spent 24&#x2F;7 talking to users and coding. We did things that don’t scale. We tried our best to be walking, talking pg essays.<p>Over the years we learned that product&#x2F;market fit is different for nonprofits. Not many people wake up and think, &quot;I&#x27;d love to donate to a nonprofit today&quot; with the same oomph that they think, &quot;I&#x27;d love a coffee&quot; or &quot;I&#x27;d like to make more money.&quot;<p>No matter how much effort we put into fundraising, donations grew linearly, while requests for care grew exponentially. I felt caught in the middle. After investing everything I had, I eventually burned out and transitioned to the board.<p>I made a classic founder mistake and intertwined my self-worth with Watsi&#x27;s success. I believed that if I could somehow help every patient, I was a good person, but if I let down some patients, which became inevitable, I was a bad person.<p>This was exacerbated by seeing our for-profit YC batch mates raise massive rounds. I felt like a failure for not scaling Watsi faster, but eventually we accepted reality and set Watsi on more of a slow, steady, and sustainable trajectory.<p>Now that I have perspective, I&#x27;m incredibly proud of what the org has accomplished and grateful to everyone who has done a tour of duty to support us. Watsi donors have donated over $20M to fund 33,241 surgeries, and we have a good shot of helping patients for a long time to come.<p>In a world of fast growth and fast crashes, here&#x27;s a huge thank you to the HN users who have stuck by Watsi, or any other important cause, even when it&#x27;s not on the front page. I believe it embodies the best of humanity. Thanks HN!<p>[1] <a href=\"http:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=4424081\">http:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=4424081</a>",
      "is_ask_hn": false,
      "matched_keywords": [
        "mistake",
        "failure",
        "success",
        "learned"
      ],
      "comments": [
        {
          "top": "I have been a Universal Fund member since 2014.\nWatsi has this Impact page where you can see every person you've helped — their photo, their story, the country. I visit it more often than I'd like to admit.\nI have been building a startup since the last couple of years and as we all know it is relentless. There are weeks where nothing seems to work, where you question every decision. In those moments, pulling up that page and seeing real people whose lives changed because of a few dollars a month — it resets something. It reminds me why building things that matter is worth the grind.\nThank you to everyone at Watsi for creating something that gives back to donors just as much as it gives to patients.",
          "author": "aaur0",
          "replies": [
            {
              "text": "Thank you aaur0 - you have no idea how much this means to us. Grateful for every ounce of good news and good health we can spread in this world.",
              "author": "watsi",
              "depth": 1
            },
            {
              "text": "> I have been a Universal Fund member since 2014.\nI couldn't remember when I joined, but it turns out 2014 too. From that date and dang's comment below, I found the HN submission that motivated me to join:\nhttps://news.ycombinator.com/item?id=7550005",
              "author": "js2",
              "depth": 1
            },
            {
              "text": "That’s a very long time - thank you both!",
              "author": "chaseadam17",
              "depth": 2
            },
            {
              "text": "@chaseadam17 -\nThis is where I learned about Watsi - \nhttps://www.youtube.com/watch?v=WlT3UhC7NwQ\nI attended it in person. Very inspiring!",
              "author": "aaur0",
              "depth": 3
            },
            {
              "text": "Another 2014 batch member here. Hard to believe it is over 10 years I've been contributing to Watsi.",
              "author": "aswerty",
              "depth": 1
            }
          ]
        },
        {
          "top": "Thank YOU Chase :) (I work at Watsi)\nIf you'd like to see an example of what Watsi's about, check out Philip's profile: \nhttps://watsi.org/profile/2286cb03a5bd-philip\nAlso, fun fact: 619 of our current \"Universal Fund\" monthly donors first made a donation 10 or more years ago, and I'm pretty sure many of those were/are Hacker News readers.\nIf you're interested, see \nhttps://watsi.org/universal-fund",
          "author": "kalvin",
          "replies": [
            {
              "text": "I've long played around with the thought of what would happen if someone started something like the universal-fund you mentioned, but had it snowball like a sovereign fund? (ie, instead of spending the in flow, invest it and only spend the profits from the investments, for example) ...\nParticularly for basic needs like housing,food,clothes... Like what if instead of giving a charity $100 we created 41c per month? of UBI (roughly the cashflow from investing that same $100). Yes it would seem too little today, but in time it would be massive because it would never dissipate.\nIDK, just my musing while claude takes, err does, my job.",
              "author": "maerF0x0",
              "depth": 1
            },
            {
              "text": "Plenty of those have existed, but in the end they always get stolen and given to the dogs trust.\nThere’s nothing people hate more than lasting charitable foundations. They take them to court so that they can crack them open and wank away the entire fund in 6 months.\nThere was one which was supposed to pay off the entire national debt. They cracked and spaffed it.\nAnother was supposed to end piracy. Cracked and spaffed.\nYou could save a million people a year, but that won’t save you from being cracked and spaffed. They’re already rubbing their trotters at the thought.",
              "author": "MagicMoonlight",
              "depth": 2
            },
            {
              "text": "This sounds like a strange set of examples that may have been scams from the start. Can you name them?\nThe UK is full of long lasting charitable foundations. Many attached to schools and universities, but the highest profile example is probably the National Trust and its collection of historic buildings.",
              "author": "pjc50",
              "depth": 3
            },
            {
              "text": "A lot of those charities are precisely in the process of being \"cracked open\", or have been captured by small groups who manage them as their personal fiefdom. The level of everyday corruption in this country is incredible.",
              "author": "toyg",
              "depth": 4
            },
            {
              "text": "> captured by small groups who manage them as their personal fiefdom\nIsn't that intrinsic to what a charity \nis\n? They don't have customers, they're not trusts set up on behalf of someone else specific, they're a tax exemption with an ideological mission.\n(still short on named examples in this subthread)",
              "author": "pjc50",
              "depth": 5
            }
          ]
        },
        {
          "top": "I made the biggest donations in my life via Watsi. Thank you for building this site. I love you guys have an API as well. I thought of building an app on top of your API but never got round to complete it. If you are curious, I can share; I think there may be an opportunity to capture value in free giveaways and turn it into charity. Many people try to give away their things quickly on fb marketplace or letgo, ...what if they could ask for a donation to a charity? I know there are challenges like, what if they want to return. But there has to be a way to solve this with an escrow service or something. A similar model already works in used, 2nd stores that work for charities.",
          "author": "mclightning",
          "replies": [
            {
              "text": "This idea is great!! I really think this can work,  i think its a win-win situation form the buyer and even the seller. Thanks for sharing it!",
              "author": "volteret4",
              "depth": 1
            }
          ]
        },
        {
          "top": "Thank you for the incredibly inspiring work! At a time when 99% of the founders and VCs just want to bank on the next big hype cycle and accumulate power and wealth, it’s good to be reminded that actual life changing work with direct impact on people is still possible.",
          "author": "Karupan",
          "replies": []
        },
        {
          "top": "I don't comment on Hacker News very much -- in fact, extremely rarely, but I do remember this more than a decade ago and its awesome that you've stuck with this for this long.\nCongratulations to you and all the work that you've done and the impact that you've had. That's pretty cool and something I think many of us aspire to.  Cheers Chase!",
          "author": "yakshaving",
          "replies": []
        }
      ]
    },
    {
      "id": "47085483",
      "title": "I tried building my startup entirely on European infrastructure",
      "link": "https://www.coinerella.com/made-in-eu-it-was-harder-than-i-thought/",
      "domain": "www.coinerella.com",
      "author": "willy__",
      "score": 721,
      "comment_count": 368,
      "created_ts": 1771578125,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "startup"
      ],
      "comments": [
        {
          "top": "Great post, I did a similar switch mid last year.\nHetzner was something I already used, so I just doubled down. I have a single OVH instance where I ma playing with Openclaw, but that was because I was having issues with Hetzner that day on their new instance page (was fixed the next day)\nI use Bunny for my CDN, I just wish they have the capabilityt to route IPv4 and IPv6 traffic to IPv6 only origins. If your origin doesn't have IPv4, it wont route IPv4 to an IPv6 origin. Something Cloudflare could do. Still a shame its not a high priority.\nFor Domains, I am still on porkbun, but i have like 20 domains, and moving them to EU registrars would be pricey. I will do it, just not looking forward to it. Also there are few registrars tht handle all the TLDs i have, nothing like Porkbun. I use dot.bs to optimize my registrars and keep track of them.\nI self-host a lot, but I haven't done github. I have a Forgejo instance with working CI/CD, but there are some painpoints mirroring 100s of repos and updating PATs. Also I minimize how much critical infra I host. I do it as my day job. Don't want to do it so much at home, and I still do some between NAS and self-hosted services I do run.\nI do plan to try out Hanko and Nebius, those sound good. and Hit up scaleway to see if there is stuff I want to use there. I know Scaleway can be pricey.",
          "author": "Daegalus",
          "replies": [
            {
              "text": "How has your experience with Bunny been? I'm quite split on it.\nI used to work for a business in a pretty competitive area, where tactics like fake DMCA requests and abuse cases are routinely used to attempt to take down information, be it from Google, or from the CDN/hosting provider. While at first Bunny support seemed understanding of it, later they unceremoniously blocked the account on the basis of too many complaints having been filed, despite all of them being responded to in due time and being proven false.\nOTOH, their support staff would respond lightning-fast, which was a breath of fresh air compared to other CDNs we used before.\nI could see myself using Bunny for personal projects, or some non-vital business, but probably not for anything with lots of competition.",
              "author": "throwaway772549",
              "depth": 1
            },
            {
              "text": "To be honest, it's been flawless but since I mostly use it for personal or self hosting, I haven't had or deal with your situation. I have had to contact support and they are very fast.\nI also use it to hide and protect my hetzner server.\nIt works well. My only gripe is the ipv6 thing",
              "author": "Daegalus",
              "depth": 2
            },
            {
              "text": "it's a super cheap \"CDN\" that runs on Hetzner and random hosts or their colo, it's not as proper as the other ones.\nfor anything DMCA heavy maybe just buying dedicated servers or something instead could work?",
              "author": "r_lee",
              "depth": 2
            },
            {
              "text": "We used to expose the dedicated servers directly (i.e. no CDN at all), and while that was fine latency-wise, the lack of DDoS protection was really the limiting factor. E.g. Hetzner will just blackhole your subnet if you get DDoSed.\nIt feels rather unviable nowadays to run a business without some CDN/DDoS protection service in front of your website.",
              "author": "throwaway772549",
              "depth": 3
            },
            {
              "text": "yeah, but dealing with DDoS is easier in terms of DMCA unlike with CDNs because it's you hosting it, not the service provider (this is how Cloudflare avoids DMCA when you cache with them iirc)\nso if you can just find a good dedicated server provider that won't cut you off, maybe that's a potential solution?\njust my 2 cents though",
              "author": "r_lee",
              "depth": 4
            }
          ]
        },
        {
          "top": "Thank you for this. I'm in Europe with an established SaaS that's been running in production for years and I've converged on a similar stack (OVHCloud instead of Hetzner). However, I've realized you can stay sovereign and independent in any jurisdiction (not just Europe) just by simplifying your stack and running a few baremetal servers in-house.\nJust buy a few Mac Studios and run them in-house with power supply backup and networking redundancy and you're good to go to serve more than 10k - 100k requests/second which is good enough to serve a million customers. You don't need VMs: a single Mac Studio gets you 2–4x the power of m7i.2xlarge on AWS, and pays for itself within a few months of AWS bills. You can do local AI inference and get Claude Opus-level performance (Kimi K2.5) over a cluster of Mac Studios with Exo.Labs (an unofficial Apple partner). You get free S3-compatible object storage with zero ongoing storage costs with MinIO (yes it's redundant even if you lose a server, and your hosting provider can't hold your data hostage by charging for egress). Postgres runs like a beast and is incredibly easy to setup - you get zero latency DB because it runs on the same machine, has access to lots of RAM and you're not paying per-GB or per-core. Managed databases are a scam. You don't need an Auth provider, just do passkeys yourself. And the great thing about Apple Silicon hardware is that it is amazingly quiet, reliable, and efficient - you can do thing like run headless browsers 3x faster and cheaper than on standard server hardware because of the unified memory and GPU acceleration, so you're not paying for CI/CD compute by-the-minute or headless browsers either.\nThis entire stack could give you computing power equivalent to a 25k euro/month AWS bill for the cost of electricity (same electricity cost as running a few fridges 24/7) plus about 50k euros one-time to set it up (about 4 Mac Studios). And yes, it's redundant, scalable, and even faster (in terms of per-request latency) than standard AWS/GCP cloud bloat. Not only is it cheaper and you own everything, but your app will work faster because all services are local (DB, Redis cache, SSD, etc.) without any VM overhead, shared cores, or noisy neighbours.",
          "author": "znnajdla",
          "replies": [
            {
              "text": "> \nManaged databases are a scam.\nI, too, once believed this. Then I had the displeasure of watching a $10,000 server fail during Christmas travel (about 20 years ago now). A single RAID drive failed. Then, during the rebuild, a second drive failed. Then the RAID controller \nitself\n failed catastrophically, losing all the RAID volume metadata. When we restored from backup, we discovered that the sysadmin who had just quit a few weeks before had lied to us about the backup system, and we had no backups.\nThis is the sort of black swan event that happens every 5-10 years. It's an unusually bad event, even by black swan standards, but stuff like this happens.\nThe fundamental problem of self-hosted databases is that you test the happy path every day, but you only test true disaster recovery every 5-10 years. And in practice, this means that disaster recovery will usually fail.\nWith a managed database service, most of what you're paying goes to making sure that disaster recovery works. And in my experience, it does. I've seen RDS database servers fail catastrophically, and completely rebuild in under 15 minutes with virtually no data loss, with almost no human intervention at all.\nIf you care about your customers' data, I think that a reputable managed database is the right move until roughly the point that you can pay for a full time database administrator. At that point, sure, roll your own. But do regular disaster recovery tests, lest you discover that a recently departed DBA has been lying to you.",
              "author": "ekidd",
              "depth": 1
            },
            {
              "text": "Yeah but even with managed database services you don't know if your provider has invested into proper testing of their recovery so you have to test it anyway. Major services like DigitalOcean have been known to shit the bed with your backups. If you don't test your backup recovery, you don't know if you're screwed even if you're paying for \"managed\" services.\nI test my backup recovery several times a month by actually baking into our CI/CD workflow under certain conditions. The entire production database gets restored from backup every week.",
              "author": "znnajdla",
              "depth": 2
            },
            {
              "text": "What about a hybrid approach?\nYou could use a managed db service as a live replica dedicated as a backup only. The queries would go to your local database on beefy hardware, while the replica would just have to be powerful enough to keep up with the WAL stream.",
              "author": "throwaway063_1",
              "depth": 2
            },
            {
              "text": "Yes, but a complete hardware mirror is only 2x the original cap. investment.\nIf bandwidth allows, you could even have local mirror in your office.",
              "author": "yobbo",
              "depth": 2
            },
            {
              "text": "Thanks for the post. How do you currently deal with HD failures/redundancy? That’s my main concern leaving a managed database provider.",
              "author": "zonkd1234",
              "depth": 1
            }
          ]
        },
        {
          "top": "> Your users expect \"Sign in with Google\" and \"Sign in with Apple.\"\nYou can add email/password and passkeys, but removing social logins entirely is a conversion killer.\nI know this is true, but I genuinely don't understand it. I want email/password and passkey, I will always go out of my way to avoid \"Sign in with ...\". I just don't get why people love this.",
          "author": "palata",
          "replies": [
            {
              "text": "You really don't? It's just a ton easier for most users: it's (almost) like already having an account. Just click a couple times and you're in, no typing at all, no email confirmation or anything like that.\nI also avoid it because I'm concerned about being over-reliant on google (what if they close my account?) and I know how to use a password manager, but I easily understand how 90-99% of the population doesn't care enough and goes the low-friction route.",
              "author": "williamdclt",
              "depth": 1
            },
            {
              "text": "Not to mention that B2B SaaS needs to provide the login methods that their customers need for their operations, and these typically rely on Google, Microsoft, Okta, etc.\nI work on auth for a European startup and this is the case.",
              "author": "yuppiepuppie",
              "depth": 2
            },
            {
              "text": "> I also avoid it because I'm concerned about being over-reliant on google (what if they close my account?)\nMost if the \"sign-in with google\" accounts I have seen treat it as a shortcut to creating and logging in with an account with the primary email address of the Google account. So you can hit \"reset password\" and get a conventional password log-in to an account you previously made with the Google auth. If you get locked out of google, it's NBD.\nOf course, this is probably not universally the case.",
              "author": "advisedwang",
              "depth": 2
            },
            {
              "text": "Does Google even let you create an account without Gmail anymore?",
              "author": "piperswe",
              "depth": 3
            },
            {
              "text": "Yes. There is a \"Use your existing email address\" button in the create account dialog.",
              "author": "advisedwang",
              "depth": 4
            }
          ]
        },
        {
          "top": "Good, honest write up! As users we need to make more efforts to move out of the American ecosystems. Cloudflare is just so convenient to take only one example.\nOT, about the finished product (hank.parts): the French translation and tone is a little rude. For one, it uses \"tu\" instead of \"vous\", which does have become customary on Social networks but is still a little bit agressive on a regular website. And \"bagnole\" or \"balance une photo\" is more than casual.\nMaybe the target are young people but I wouldn't bet on it. Average car ownership in Europe is 53, and 55 in France. Share of new vehicle registrations by adults aged 18-34 is below 10% in Europe.\nMy two cents.",
          "author": "bambax",
          "replies": [
            {
              "text": "Interesting. I actually had a human translator do the french translation because I didn't trust deepl/LLMs on certain languages. He was Belgian though. Thanks for the feedback, I will certainly consider it - I don't speak french myself.",
              "author": "willy__",
              "depth": 1
            },
            {
              "text": "I agree with them, the French translation is way too casual/aggressive compared to the English text.\nI wouldn't trust this website.\nIt comes across as influencer speech targeted to edgy young people with a touch of \"how do you do, fellow kids?\".\nPretty sure a modern LLM would yield a better one.",
              "author": "Spixel_",
              "depth": 2
            },
            {
              "text": "Speaking of translations, the Italian translation seems fine but it uses English Capitalization of Titles, but that doesn't work in Italian.\nIt should be \"Pronto a trovare il tuo ricambio?\", not \"Pronto a Trovare il Tuo Ricambio?\".",
              "author": "reddalo",
              "depth": 2
            },
            {
              "text": "Thank you!",
              "author": "willy__",
              "depth": 3
            },
            {
              "text": "> As users we need to make more efforts to move out of the American ecosystems.\nWhile I support the spirit, it's important to acknowledge the reality of the current situation with the US (and the rest of the world). It has little to do with SaaS services and everything to do with \nenergy\n and \ndefense\n.\nEurope \nimports\n more than \nhalf\n it's energy. The United States and Russia are both \nnet exporters\n (Russia significantly so), China would be close to self-sufficient if not for their limited access to oil.\nAnd while Trump may be ridiculous, he's not entirely wrong about Europe relying on the US for defense. Current estimates are that Europe needs to spent around one \ntrillion\n dollars on defense to replace American support [0], and even then faces large challenges in getting their defense up to standards fast enough. Meanwhile the Ukraine war has allowed Russia to completely rework their economy into a military one.\nWhile the popular narrative is that Trump is the sole cause of this souring relationship the reality is that geopolitics have been shifting a lot in recent decades and Europe is simply not the global position they were 50 years ago.\nEurope can rely entirely on European SaaS companies and will still face massive energy and defense dependency problems.\n0. \nhttps://www.wsj.com/world/europe/europes-1-trillion-race-to-...",
              "author": "crystal_revenge",
              "depth": 1
            }
          ]
        },
        {
          "top": "I’ve found Scaleway really good, I’m surprised it doesn’t come up more often here.\nIf it matters, I didn’t go to them because they were specifically an EU org either - when Packet became Equinix Metal and then that got shut down, SCW were the most equivalent in terms of cost / hardware specifications and I often used them in parallel when Packet was still around so as to not have all my eggs in one basket.",
          "author": "MrAlex94",
          "replies": [
            {
              "text": "I really like Scaleway too ! I went with them because Linode got bought and I thought, since I was moving my things anyway, let's go to a French provider. And I got a bad experience with OVH, so Scaleway it was.\nBut really, I wonder why it's not used more ? Price are maybe a bit high for some things ?",
              "author": "adamas",
              "depth": 1
            },
            {
              "text": "Price would be a bit more bearable if their reserved instance discounts were more generous",
              "author": "tcldr",
              "depth": 2
            },
            {
              "text": "They used to have competitive prices for a while, with their dedibox line.\nI think they are not as well known. It’s a bit of a side project of the parent company, Iliad. They could benefit from heavy investments and some more aggressive marketing, but perhaps it’s not worth the risk and a slow but steady growth is what they prefer.",
              "author": "speedgoose",
              "depth": 2
            },
            {
              "text": "I asked myself the same thing, trustpilot is pretty rough on them and a lot of people tell you online to stay away from them. I also had very good support experience so far. Their shared TEM IP had some deliverability issues at times, but they seem to have cracked down on this recently. I am on dedicated IP now, so I can't really judge if there have been improvements.",
              "author": "willy__",
              "depth": 2
            },
            {
              "text": "+1 for bad experience with OVH, their control panel is a mess (only the Italian provider Aruba is probably worse) and their backend is riddled with bugs. If something is broken in the control panel, the support team candidly invites you to do it via their APIs instead.",
              "author": "reddalo",
              "depth": 2
            }
          ]
        }
      ]
    },
    {
      "id": "47088166",
      "title": "Show HN: A native macOS client for Hacker News, built with SwiftUI",
      "link": "https://github.com/IronsideXXVI/Hacker-News",
      "domain": "github.com",
      "author": "IronsideXXVI",
      "score": 245,
      "comment_count": 174,
      "created_ts": 1771596125,
      "is_internal": false,
      "post_text": "Hey HN! I built a native macOS desktop client for Hacker News and I&#x27;m open-sourcing it under the MIT license.<p>GitHub: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;IronsideXXVI&#x2F;Hacker-News\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;IronsideXXVI&#x2F;Hacker-News</a><p>Download (signed &amp; notarized DMG, macOS 14.0+): <a href=\"https:&#x2F;&#x2F;github.com&#x2F;IronsideXXVI&#x2F;Hacker-News&#x2F;releases\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;IronsideXXVI&#x2F;Hacker-News&#x2F;releases</a><p>Screenshots: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;IronsideXXVI&#x2F;Hacker-News#screenshots\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;IronsideXXVI&#x2F;Hacker-News#screenshots</a><p>I spend a lot of time reading HN — I wanted something that felt like a proper Mac app: a sidebar for browsing stories, an integrated reader for articles, and comment threading — all in one window. Essentially, I wanted HN to feel like a first-class citizen on macOS, not a website I visit.<p>What it does:<p>- Split-view layout — stories in a sidebar on the left, articles and comments on the right, using the standard macOS NavigationSplitView pattern.<p>- Built-in ad blocking — a precompiled WKContentRuleList blocks 14 major ad networks (DoubleClick, Google Syndication, Criteo, Taboola, Outbrain, Amazon ads, etc.) right in the WebKit layer. No extensions needed. Toggleable in settings.<p>- Pop-up blocking — kills window.open() calls. Also toggleable.<p>- HN account login — full authentication flow (login, account creation, password reset). Session is stored in the macOS Keychain, and cookies are injected into the WebView so you can upvote, comment, and submit stories while staying logged in.<p>- Bookmarks — save stories locally for offline access. Persisted with Codable serialization, searchable and filterable independently.<p>- Search and filtering — powered by the Algolia HN API. Filter by content type (All, Ask, Show, Jobs, Comments), date range (Today, Past Week, Past Month, All Time), and sort by hot or recent.<p>- Scroll progress indicator — a small orange bar at the top tracks your reading progress via JavaScript-to-native messaging.<p>- Auto-updates via Sparkle with EdDSA-signed updates served from GitHub Pages.<p>- Dark mode — respects system appearance with CSS and meta tag injection.<p>Tech details for the curious:<p>The whole app is ~2,050 lines of Swift across 16 files. It uses the modern @Observable macro (not the old ObservableObject&#x2F;Published pattern), structured concurrency with async&#x2F;await and withThrowingTaskGroup for concurrent batch fetching, and SwiftUI throughout — no UIKit&#x2F;AppKit bridges except for the WKWebView wrapper via NSViewRepresentable.<p>Two APIs power the data: the official HN Firebase API for individual item&#x2F;user fetches, and the Algolia Search API for feeds, filtering, and search. The Algolia API is surprisingly powerful for this — it lets you do date-range filtering, pagination, and full-text search that the Firebase API doesn&#x27;t support.<p>CI&#x2F;CD:<p>The release pipeline is a single GitHub Actions workflow (467 lines) that handles the full macOS distribution story: build and archive, code sign with Developer ID, notarize with Apple (with a 5-retry staple loop for ticket propagation delays), create a custom DMG with AppleScript-driven icon positioning, sign and notarize the DMG, generate an EdDSA Sparkle signature, create a GitHub Release, and deploy an updated appcast.xml to GitHub Pages.<p>Getting macOS code signing and notarization working in CI was honestly the hardest part of this project. If anyone is distributing a macOS app outside the App Store via GitHub Actions, I&#x27;m happy to answer questions — the workflow is fully open source.<p>The entire project is MIT licensed. PRs and issues welcome: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;IronsideXXVI&#x2F;Hacker-News\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;IronsideXXVI&#x2F;Hacker-News</a><p>I&#x27;d love feedback — especially on features you&#x27;d want to see. Some ideas I&#x27;m considering: keyboard-driven navigation (j&#x2F;k to move between stories), a reader mode that strips articles down to text, and notification support for replies to your comments.",
      "is_ask_hn": false,
      "matched_keywords": [
        "feedback"
      ],
      "comments": [
        {
          "top": "Congrats and building and releasing something.  I guess for reading things like this, I'm just a browser kind-of guy.  But I still appreciate youre building a NATIVE app that's using around 85MB of working memory (according to my Activity Monotor), and not some Electron thing.\nI'm probably just a anti-app guy, but I tried it out.\nFirst thing I went to do was CMD-F to search for some strings in the comments section.\nActually, the real first thing I did, was click on the left-side article preview  on the text that said \"1 hr ago | 63 comments\" thinking it'd navigate me to the comments.  See, I like my native hyper-links.",
          "author": "taude",
          "replies": [
            {
              "text": "I've never understood the concept of an app wrapper for a link aggregator (HN, reddit, etc).  The whole goal is to provide links to external sources, and now I'm browsing the web in a limited web browser without all my extensions etc.\nAm I missing some core concept here?  Why would I want to browse the web in this app as opposed to a web browser?",
              "author": "luma",
              "depth": 1
            },
            {
              "text": "Some people love giving up as much customization and control over their software as possible. iOS over Android. MacOS over Linux. Chrome over Firefox. App stores over installing programs yourself. Apps over websites.\nThere are various arguments for it (better compatibility/cohesiveness, minimalism, less debugging) but it overall seems like the opposite of the \"hacker\" mindset which makes how much market share MacOS has in the space very strange.",
              "author": "snigsnog",
              "depth": 2
            },
            {
              "text": "That’s not really fair in the case of a third-party app like this one.  Swapping out the website’s default UI for an app \nis\n customization.",
              "author": "comex",
              "depth": 3
            },
            {
              "text": "You can swap out the website’s default UI in a browser and preserve the innate customization power you get from being in a browser.",
              "author": "snigsnog",
              "depth": 4
            },
            {
              "text": "Meh. I use a native app to access HN (NetNewsWire), and \nthis\n apps launches the browser for things I want to read and/or for comments.\nIMHO your comment is unfair. Native apps really \nare\n, when done right, much better. Sadly they are rarely done right.",
              "author": "frizlab",
              "depth": 3
            }
          ]
        },
        {
          "top": "Side note:\nSimon Halvdansson runs \"Harmonic\", an Android client for Hacker News, I am using it daily for 2+ years and I sincerely recommend it.\nI even asked him a feature (mark a story as read), and he implemented it shortly after.\nShout-out to you Simon!\nhttps://github.com/SimonHalvdansson/Harmonic-HN\nhttps://play.google.com/store/apps/details?id=com.simon.harm...",
          "author": "mike31fr",
          "replies": []
        },
        {
          "top": "Opening the app and getting a new sparkle update dialog everytime is getting very annoying…especially for updates that are relatively minor.\njust today its gone from 1.1.3 -> 1.1.4 -> 1.1.5 -> 1.1.6 -> 1.1.7 -> 1.1.8 -> 1.1.9 -> 1.2 -> 1.2.2 (skipped 1.2.1?) in under 5 hours. A lot of these could wait until theyre put in a relatively bigger release!",
          "author": "marcelox86",
          "replies": [
            {
              "text": "Hi there, are you not able to just uncheck “Automaticly check for updates” in settings?",
              "author": "IronsideXXVI",
              "depth": 1
            },
            {
              "text": "I already have, but I wish I didn't have to...I don't see a reason for updates to be this granular especially when the only release notes are the diffs and the commit messages in between tags.\nI understand \"shipping at the speed of inference\", but it makes the people who opt into updates more like testers on a \"nightly\" release cycle. At that point, I'd call it a nightly.",
              "author": "marcelox86",
              "depth": 2
            },
            {
              "text": "Yeah I get it, I mean to implement a better release system moving forward, allowing users to only choose large releases if they want, and include release notes. For now i’ve been focused on meaningful quick improvemnts until the app feels more finished.",
              "author": "IronsideXXVI",
              "depth": 3
            }
          ]
        },
        {
          "top": "Nice work shipping this. The 2k lines of Swift for a fully functional native app is impressive - shows how much SwiftUI has matured. The CI/CD pipeline for macOS code signing is genuinely hard, so thanks for open-sourcing that part. For anyone building side projects: this is the kind of portfolio piece that actually demonstrates real engineering skills. Much more valuable than yet another todo app when you're applying for jobs.",
          "author": "iriisatremotely",
          "replies": []
        },
        {
          "top": "This is fantastic. The app is simple, useful and feels de-cluttered.\nTwo of my feature requests:\n1. Allow cmd+f search on the whole app - I wanted to search your post on the app but I couldn't\n2. A browser button to open the current page on an external browser.\nSide note: I am trying to minimize my HN time via getting push notifications for relevant HN posts, and that's how I discovered your post. Would it be cool if one could write custom agents on top of an app? Maybe?",
          "author": "vb7132",
          "replies": [
            {
              "text": "A link to my experiment: \nhttps://www.bvaibhav.info/knos-digest",
              "author": "vb7132",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47094179",
      "title": "'A Big Fuck You to Big Tech': New Jersey Residents Defeat AI Data Center",
      "link": "https://www.commondreams.org/news/new-brunswick-ai-data-center",
      "domain": "www.commondreams.org",
      "author": "abdelhousni",
      "score": 54,
      "comment_count": 18,
      "created_ts": 1771622685,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "big tech"
      ],
      "comments": [
        {
          "top": "Been amazing to see how far tech companies have fallen in public esteem (good). I remember when my friends and I would get together to watch the new MacBook announcements, eager to see what was coming. Feels as distant now as sk8erboi culture.",
          "author": "olivierestsage",
          "replies": [
            {
              "text": "Doesn’t help that they’ve gotten so big. They’ve become “the man” the establishment that has a direct line to everyone’s brains.\nAnd have in so many cases abused their power.\nAll that not counting the stagnation and enshittification.\nI also used to get together with friends to watch Apple Keynotes. They were so much fun.\nBut now they’re just extremely sanitized pre produced videos (basically ads) that lack any sort of soul.\nYes yes I know they were always mainly ads. But there was something to be said for people presenting on stage.",
              "author": "atonse",
              "depth": 1
            },
            {
              "text": "Back in the day, these companies stayed in their lane, so to speak.\nWhen you bought a computer, that’s all it was. It had much more of a toy or appliance like appeal rather than this deeply integrated life augmenter. The idea that a company like Apple or even a bigger (at the time) company like Microsoft would own a movie/TV studio and broadcast major league sports was an insane idea.\nI will say regarding keynotes, it wasn’t limited to the genuine nature of the companies. The 90s and 2000s were just on different levels of the pace of technology development. I am sure that even Microsoft had an exciting keynote or two and they were the evil empire in those days.",
              "author": "dangus",
              "depth": 2
            },
            {
              "text": "I mean what do these data centers provide for the locals? They are big ugly boxes were nobody actually works. All the money goes to faceless mega corporations.\nAt least with a nuclear power plant you can have the patriotic pride of doing something for the nation.",
              "author": "PearlRiver",
              "depth": 1
            }
          ]
        },
        {
          "top": "I think the one benefit people are overlooking is that there is an opportunity to increase power generation.\nRather than saying \"no\", how about making the new datacenters fund nuclear, solar, and grid battery?",
          "author": "exabrial",
          "replies": [
            {
              "text": "New datacenters aren't harmless (noise or NoX pollution is real), and they'll consume more than they generate.\nYours better off mandating solar panels on parking lots (especially in the US!), etc.",
              "author": "subscribed",
              "depth": 1
            },
            {
              "text": "I mean there are a number of places where datacenters have been built and claim to be putting 100% of the money forward to power their data centers with plants and infrastructure, however with everyone around those areas still claiming to be paying more for power afterwards.",
              "author": "AngryData",
              "depth": 1
            },
            {
              "text": "> how about making the new datacenters fund nuclear, solar, and grid battery?\ngood luck with that\nany promises will be ignored, avoided or dumped onto regular people the very moment the approval is granted",
              "author": "blibble",
              "depth": 1
            },
            {
              "text": "What about a making it prerequisite? Demonstrate you have built the nuclear/solar/whatever capacity to cover your own energy before you're allowed to build a datacenter?",
              "author": "icwtyjj",
              "depth": 2
            },
            {
              "text": "Solar doesn't work well with 24/7 demand requirements, provisioning enough storage to fully even out intermittency drastically raises costs (most battery storage systems are for only 2-4 hours).\nNuclear has extremely onerous regulatory requirements.",
              "author": "Manuel_D",
              "depth": 3
            }
          ]
        }
      ]
    },
    {
      "id": "47095420",
      "title": "Judge scolds Zuckerberg's team for wearing Meta glasses to social media trial",
      "link": "https://www.cbsnews.com/news/meta-trial-mark-zuckerberg-ai-glasses/",
      "domain": "www.cbsnews.com",
      "author": "ColinWright",
      "score": 51,
      "comment_count": 5,
      "created_ts": 1771629531,
      "is_internal": false,
      "post_text": "",
      "is_ask_hn": false,
      "matched_keywords": [
        "team"
      ],
      "comments": [
        {
          "top": "Hope they reselected the jury. Meta has the ability to do facial recognition on the jurors if they were snuck cameras into court.",
          "author": "trillic",
          "replies": []
        },
        {
          "top": "Mission success, they got free advertising",
          "author": "nothercastle",
          "replies": [
            {
              "text": "Tax dollars",
              "author": "downboots",
              "depth": 1
            }
          ]
        },
        {
          "top": "It's like he wants to be despised.",
          "author": "starkeeper",
          "replies": [
            {
              "text": "close, they are trying to be bad boy, rebels\nbut continue to give off the poodle with a bad haircut vibe",
              "author": "metalman",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47085255",
      "title": "Ask HN: Is it worth learning Vim in 2026?",
      "link": "https://news.ycombinator.com/item?id=47085255",
      "domain": "news.ycombinator.com",
      "author": "zekejohn",
      "score": 29,
      "comment_count": 31,
      "created_ts": 1771576049,
      "is_internal": true,
      "post_text": "With everyone using Claude Code, Cursor, Codex, and the other 100 AI coding agents that i missed, I’m wondering how much editor mastery still matters like w&#x2F; Vim<p>Being honest the real reason i wanna learn Vim is to boost my ego &amp; assert my dominance, so i can tell people &quot;i use vim btw&quot;, but also part of me thinks investing time could still pay off for speed, ergonomics, and working over SSH overall...<p>but a bigger part also suspects the marginal gains i would gain would disappear when more of the work is delegated to AI anyway, like why would i learn Vim if i&#x27;m just going to be prompting Opus all day?<p>For anyone who&#x27;s been using Vim for while AND uses AI to code (i&#x27;m assuming everyone codes with AI to some degree) my question is: Does learning Vim still meaningfully improve your day to day productivity EVEN with AI, or is it mostly personal preference at this point?",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "I think learning vim is definitely relevant. To me, vim is the fastest and most effective way to navigate and interact with text. Even with AI, I think those skills are not going out of style.",
          "author": "roland35",
          "replies": []
        },
        {
          "top": "Do you already do any work over SSH? What do you do if you need to edit any files in that context?\nLearning the essentials of vim was the sort of skill that for me took about 10 min per day over a couple months and has come in handy almost every day since then. Can you get by without it? I guess, if you do absolutely everything via a GUI. Or delegate all CLI work to LLMs without ever questioning or second guessing their output.\nAnd yes, I use vim for almost every git commit or interactive rebase. Access to the full power of CLI git is something I value very much and has saved me countless hours.  Not to mention using it for editing any config file that’s not part of a repo.\nEvery time you’re able to keep your fingers on the keyboard instead of reaching for a mouse saves you both time and precious context switching energy.",
          "author": "apothegm",
          "replies": [
            {
              "text": "Aficionados of modal editing often insinuate that one would require mouse use in non-modal editing. Yet I have always fully keyboard-operated my non-modal editors, whether VSCode in the last 9 years or previously, Sublime and others, all the way back to Turbo Pascal in the late 90s. I don't ever use the mouse in them, whether I'm inside a text buffer or in the Command Palette (or in menus for the pre-Sublime editors back when). For example, F1 is bound to show \"hover\" doc tips over the symbol that the caret is in. A couple function keys and ctrl/alt/shift-plus-some-mnemonic letter are soo swiftly and easily muscle-memoried, I never felt any need for mousing, or for \"modes\" and typing just to switch from one to another.\nI'm sure once one is used to modal editing, one can be speedy with it. So can I, entirely without modal yet without mousing  =)",
              "author": "dualogy",
              "depth": 1
            },
            {
              "text": "I also use VSCode and derivatives. Also mostly without mousing. But I don’t HAVE to, because I know how to use CLI tooling to not only edit files as needed but also handle things like version control — which I’ve noticed a disappointing percentage of my colleagues, even those with a decade in the field, are mystified by. I haven’t touched VSCode’s git integrations, but the astonishment at being introduced to CLI rebasing — followed by interactive rebasing — was eye-opening.",
              "author": "apothegm",
              "depth": 2
            }
          ]
        },
        {
          "top": "Pretty much every engineer needs to use Vim/vi when logged into any server, so from that point of view, this shouldn’t even be a question. I don’t think knowing how to use a modal editor in 2026 is a flex anymore, it’s just standard. But if you’re planning to commit to modal editing as a lifestyle, you should be using Helix, not Neovim.",
          "author": "bgar",
          "replies": [
            {
              "text": "Why Helix and not Neovim?",
              "author": "Gooblebrai",
              "depth": 1
            },
            {
              "text": "It’s one of those tools that’s well designed and you don’t need a thousand line configuration file to be productive. The modal editing style is also an improvement over vim/neovim because you do selection -> action rather than action -> selection. Lastly, it’s written in Rust, which is not a plus purely because of that but because it’s a lot easier to contribute code changes to or tweak a modern Rust codebase.",
              "author": "bgar",
              "depth": 2
            }
          ]
        },
        {
          "top": "It's a handy skill to have if you interact with Linux machines.\nYou'll need to edit files sometimes, and Vim (or Vi) is usually present. I don't think I've seen an install without it.\nThe basics (opening files, writing, and closing) can be learnt in an hour. It's enough to make simple changes to .conf files.",
          "author": "grugdev42",
          "replies": []
        },
        {
          "top": "It seems like tools like Vim are less about specific productivity gains in isolation and more about developing a particular mental model of interacting with text and systems. Even as AI takes over more of the generation work, the ability to navigate, inspect, and make precise edits efficiently still seems valuable. In that sense it feels less like an either/or question and more like whether someone finds that model aligns with how they prefer to work.",
          "author": "pearlos",
          "replies": []
        }
      ]
    },
    {
      "id": "47049884",
      "title": "Ask HN: How do you motivate your humans to stop AI-washing their emails?",
      "link": "https://news.ycombinator.com/item?id=47049884",
      "domain": "news.ycombinator.com",
      "author": "causal",
      "score": 27,
      "comment_count": 36,
      "created_ts": 1771348189,
      "is_internal": true,
      "post_text": "I see it more and more in email, Slack, text, etc: People too scared to share their own thoughts so they AI-wash it and send an exhausting page of &quot;It&#x27;s not X, it&#x27;s Y!&quot; slop instead.<p>I&#x27;m not the CEO, I can&#x27;t order people to stop. The CEO does it too.<p>I try talking to people directly, but people get defensive and there&#x27;s always the chance they didn&#x27;t use AI. I need indirect means of socializing change.<p>Looking for anything I can use to socialize against AI-washing: Articles, memes, policies that other companies have successfully used- whatever.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Put a culture of stopping work at 40 hours. Allow the work to be the work and stop deadlines.\nOtherwise, people will take every time savings possible. If I'm using AI for anything, it's because it's important enough to someone else for me to do but not important enough to sacrifice my own time.\nI don't think it's about people being scared, at least from what I've seen. It's about people being exhausted.",
          "author": "ebiester",
          "replies": [
            {
              "text": "> Otherwise, people will take every time savings possible\nAnd you're saying they won't if you only cap the maximum amount of time they can work?\n> It's about people being exhausted\nWork can be difficult and exhausting and I don't think that's necessarily a bad thing. When I started my job I was tired often because it was hard. I got better at it over time.\nI'm really not into any job where my value is strictly tied to the time I put into it. I much prefer a job that some weeks takes me a lot of time and some weeks takes not as much time.",
              "author": "paulcole",
              "depth": 1
            },
            {
              "text": "If people are limited in how much time they work, they'll use AI to try to get more work done in that time. You'd have to also limit how much work people are expected to do. Good luck advocating for that change in modern corporations.",
              "author": "antonvs",
              "depth": 1
            },
            {
              "text": "It’s not always exhaustion, though. I work with several people who blindly spout AI responses out of sheer laziness.",
              "author": "mfro",
              "depth": 1
            }
          ]
        },
        {
          "top": "What worked for us: make brevity the default. We added a team norm: max 5 lines unless someone asks for detail, plus first line must be the ask/decision. AI fluff dropped fast because long vague messages stopped getting replies.",
          "author": "lyaocean",
          "replies": []
        },
        {
          "top": "If the AI does spelling and grammar fixups, I'll root for the AI.\nWhen I was in corporate IT, I got \nway\n too much internal email that looked like it had been pecked out by an autistic second-grader, with random spelling, capitalization, and punctuation. Which wasn't as much of a problem as the chain-of-consciousness blather of jumbled words that often made no sense at all.\nSome of those people were Ph.Ds in charge of multimillion-dollar subsidiaries and dozens or hundreds of employees, but they may have well have been trying to communicate by interpretive farting and tap-dancing.",
          "author": "Froedlich",
          "replies": [
            {
              "text": "I feel like this could have done without the ableist quip, however I also see this in my industry as well, especially among higher-ups. Funnily enough this was the topic of another discussion yesterday[0].\n0: \nhttps://news.ycombinator.com/item?id=47038125\nEdit: Which I see was just shared by someone else here hours before me, so I guess I'm not all that safe from the brain rot myself haha.",
              "author": "samtheDamned",
              "depth": 1
            },
            {
              "text": "> Some of those people were Ph.Ds\nRead any of the Epstein emails? Many are nearly unintelligible, despite the \"world-renowned luminaries\" that wrote them.\nThe phenomenon was discussed in a post here yesterday that linked to post titled \"Privilege is bad grammar\": \nhttps://news.ycombinator.com/item?id=47038125",
              "author": "NietzscheanNull",
              "depth": 1
            }
          ]
        },
        {
          "top": "A noble but essentially Sisyphean goal, you might as well try to get people to stop playing with their phones.",
          "author": "jjgreen",
          "replies": [
            {
              "text": "Fair but I have seen workplaces keep phone use largely curtailed. Surely it's not so impossible with AI...right? Right...? :/",
              "author": "causal",
              "depth": 1
            },
            {
              "text": "How have you seen workplaces keep phone use curtailed? I spent a month visiting an office we had in India. Phones were not allowed in the work area. There were lockers outside where people were supposed to lock up their phones before going through the gates to get into the work area. I locked up my phone at the start, but then realized almost everyone still had their phones, they were just sly about using them. By the end of the trip I stopped using the locker.",
              "author": "al_borland",
              "depth": 2
            }
          ]
        },
        {
          "top": "If people are scared to share their thoughts, then \nthat\n seems like the problem.\nAlso, how much of this communication is actually necessary? If someone doesn't care about an issue enough to write their own email, then why are they sending an email about it in the first place?",
          "author": "impendia",
          "replies": []
        }
      ]
    },
    {
      "id": "47092914",
      "title": "Reddit Ads support is leaking PII and actively crossing user sessions",
      "link": "https://news.ycombinator.com/item?id=47092914",
      "domain": "news.ycombinator.com",
      "author": "arashvakil",
      "score": 17,
      "comment_count": 1,
      "created_ts": 1771616740,
      "is_internal": true,
      "post_text": "I have been dealing with a Reddit Ads account issue over the last week, and it has quickly escalated into a severe privacy and security red flag. It appears their customer support tools (or the agents themselves) are actively bleeding PII and crossing user sessions entirely.<p>Over the last week, I have experienced three separate incidents in their live chat:<p>Incident 1: Account Cross-Contamination (Feb 14)\nWhile chatting with an agent (Sonam B), they managed to associate my personal email to a completely unrelated, bizarrely named ad account (&quot;No Panties Games Ad Account&quot;). When I pointed out they were pasting data related to someone else&#x27;s account alongside my email, they tried to brush it off as an &quot;error&quot; and told me to &quot;kindly ignore.&quot;<p>Incident 2: Direct PII Leak (Feb 20)\nToday, while following up on the issue with a different agent (Naheeda M), they inexplicably dropped the email address (info@<i>REDACTED</i>.com) and the full legal business entity name of an entirely different advertiser into our chat.<p>Incident 3: Total Session Confusion and Misattribution (Feb 20)\nJust minutes later in that same chat, things got much worse. While I was clearly logged into my own account, the agent told me: &quot;The ad account you&#x27;re currently signed into is u&#x2F;Teor<i>REDACTED</i>, and ads are getting published with this username. Is that correct?&quot;<p>This is no longer just a clipboard issue. This strongly suggests a severe backend mapping failure in their support dashboard (Zendesk&#x2F;Salesforce or an internal admin tool) that is completely misattributing active sessions, user accounts, and ad publishing data.<p>If their support agents are seeing me as logged into someone else&#x27;s account and claiming ads are publishing under that username, it raises massive questions:\n1. Are agents making changes to other people&#x27;s ad campaigns thinking it&#x27;s my account?\n2. Is ad spend being billed to the wrong accounts?\n3. Who is currently seeing my billing details, legal name, and campaigns?<p>Given how broken their Tier 1 tools appear to be right now, I wanted to raise the flag here immediately. Has anyone else running Reddit Ads noticed their support agents leaking data or confusing accounts recently?",
      "is_ask_hn": false,
      "matched_keywords": [
        "failure"
      ],
      "comments": [
        {
          "top": "https://www.cisa.gov/reporting-cyber-incident\n at the federal level, if you have a state regulator where PII is in scope, report to them too. Document everything for your complaint as evidence. A GitHub Gist collecting your documentation, archived by the Wayback Machine is an effectively public timestamp mechanism if relevant.",
          "author": "toomuchtodo",
          "replies": []
        }
      ]
    },
    {
      "id": "47094857",
      "title": "Ask HN: Are you a SWE that lost job purely due to AI? Share your story",
      "link": "https://news.ycombinator.com/item?id=47094857",
      "domain": "news.ycombinator.com",
      "author": "matijash",
      "score": 17,
      "comment_count": 3,
      "created_ts": 1771626355,
      "is_internal": true,
      "post_text": "",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Haven’t seen a clean “AI replaced me” case yet; mostly I’ve seen hiring freezes plus one engineer expected to do 1.5x with copilots. A clearer signal is this: was the role removed and budget moved to tooling, or just cut with no replacement?",
          "author": "lyaocean",
          "replies": []
        },
        {
          "top": "prior ask HN thread from early feb 2026:  \nhttps://news.ycombinator.com/item?id=46867190",
          "author": "shoo",
          "replies": []
        },
        {
          "top": "AI? No. Geopolitical reasons? Yes.",
          "author": "GoToRO",
          "replies": []
        }
      ]
    },
    {
      "id": "47055450",
      "title": "Ask HN: How do you overcome imposter syndrome?",
      "link": "https://news.ycombinator.com/item?id=47055450",
      "domain": "news.ycombinator.com",
      "author": "fdneng",
      "score": 12,
      "comment_count": 17,
      "created_ts": 1771374543,
      "is_internal": true,
      "post_text": "I’ve been working at YC-backed startups since graduating from university. I’m now at a company building a deeply distributed systems product, and I’m surrounded by incredibly talented engineers who seem exceptionally strong at what they do. They often have knowledge and intuition about things I barely understand.<p>Lately, I’ve been feeling inadequate — like I’m contributing more to the less exciting parts of the product rather than the “cool” or core engineering challenges.<p>On top of that, I’m an immigrant and my wife and I are expecting. Balancing that with a fully remote job has been difficult, and at times I feel like I’ve lost some of my competence or sharpness. I’m taking steps to address this — I’ll be speaking with a psychologist soon — but I genuinely wonder: how does someone overcome these feelings while working within a high-functioning engineering team?",
      "is_ask_hn": true,
      "matched_keywords": [
        "imposter",
        "team",
        "remote"
      ],
      "comments": [
        {
          "top": "I have never in my life felt imposter syndrome between 30 years and 10 jobs.  I was honest at the outset about my strengths and weaknesses and they hired me knowing what they were getting.\nFor me for instance, I’m very honest about not doing web dev and failing miserably every time I tried (of course I know JS).  I want to be filtered out if that’s a requirement.",
          "author": "raw_anon_1111",
          "replies": []
        },
        {
          "top": "I can relate. It sucks, but it also keeps you grounded.\nThink about it. There are things that you're able to do but you will never do because you think you can't. There are also things that some people cannot do, but they'll half-ass it the whole way to hell because they think they're doing just fine.\nKnowing your own shortcomings is a superpower, it keeps you on your toes, also keeps your goals realistic. Being unaware of your shortcomings is also a superpower, assuming you're isolated from the consequence. Mercifully, my experience indicates this does not happen very often.\nThe right path is allegedly somewhere in the middle.",
          "author": "dormento",
          "replies": []
        },
        {
          "top": "Some of it may never go away, as there is always more to know and you’ll never know it all. That’s what the team is for; together you can know more than any one person alone. Each person ends up having their areas of expertise.\nSome acceptance of this and realization that you’re part of that team will come in time. When I first started working I felt like I should quit before they figured out I didn’t know anything. I felt like I always had to go ask other people questions. At a certain point, that dynamic flipped and I was spending all day answering questions from other people. These days, it’s more balanced. There are things I go to others for, and I think they’re brilliant at what they do. Those people also come to me for help on things I have more experience in. It’s a give and take. When you start, it will be more take than give, but that’s how everyone starts.",
          "author": "al_borland",
          "replies": []
        },
        {
          "top": "Well you're about to do one of the hardest tasks any human can do, which is raise a child. It takes a ton a patience, care, and work to do it right.\nYou're company will hopefully be tuned into this and be reasonable and show you some grace through a life changing experience. You also need to be kind to yourself through the journey. You will have to make adjustments, but it will be worth it.\nAs for imposter syndrome, everyone puts their pants on one leg at a time. Just keep learning and doing your best and you'll be fine. The fact you're asking this question at all is a good sign.\nCongratulations!",
          "author": "lyfeninja",
          "replies": []
        },
        {
          "top": "Imposter syndrome is a thinking trap.  A couple of things you can do to help:\nTry to separate out 'ruminating' from 'thinking'.  What's the difference? For our purposes 'thinking' has a fixed outcome and an end point.  Trying to solve a coding problem. Working out how to make dinner. Calculating your taxes. When you reach your goal, you're done and you stop.  'Ruminating' has no end point. There is not end or action associated with it.  The tricky part is that it often masquerades as thinking, so you feel like you're solving a problem.\nFor example, you do a job interview and you go over and over what happened in your mind. \"Maybe I should have answered this differently\". \"Maybe I should've prepared some more of these questions\".  Of course, you can't change what happened in the past. You're just rolling the ideas around in your head and probably making yourself feel worse and worse.  Rumination can be focused on the past, the future or even some hypothetical, imaginary situation (\"What if I lost my job\", \"What if my house burnt down\"). Again, actual preparation (Saving an emergency fund. Getting insurance) has an action associated, but rumination never ends, it just keeps going around in your head.\nThe other thing is to keep an accurate record of your performance. This will be different for everyone, and varies a lot depending on the job.  The key thing is to make the record as close in time to the action as possible.  For example, you feel like your pull requests aren't as good as other people's. Don't wait until the end of the week and then reflect on the quality of your work. Instead, every time your make a pull request, write down an accurate, objective assessment of the quality.\nPeople who suffer from imposter syndrome tend to forget their wins and remember their losses again and again (there's that rumination!). By having an accurate record that you made yourself you can cut through this and show to yourself your true performance.",
          "author": "laurieg",
          "replies": []
        }
      ]
    },
    {
      "id": "47076058",
      "title": "Ask HN: (Your) Request for Startups?",
      "link": "https://news.ycombinator.com/item?id=47076058",
      "domain": "news.ycombinator.com",
      "author": "dontoni",
      "score": 12,
      "comment_count": 9,
      "created_ts": 1771520638,
      "is_internal": true,
      "post_text": "Like what YC partners do at https:&#x2F;&#x2F;www.ycombinator.com&#x2F;rfs but for the community. What&#x27;s your personal request for startups, or solutions you&#x27;d like to see and you&#x27;d pay for?",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Healthy food as a service, but you have to cook it.\nOne for last mile. Maybe something like Blue Apron, but healthier. The stuff you can make without butter. Cleaned fish, ready to cook. Cut costs by cutting down on the expensive packaging, target market four servings and above.\nAnother startup for the distribution layer here, from the farms. This is basically your AWS. The farm to restaurant flow already exists, it just needs to be retrofitted.\nThe reason is it's a lot of work to create recipes that work every day, take photos, build up some fancy chef profile. Heck just prepping food saves enough work to charge 30% more.\nThere's probably room for a Heroku style layer as well. The user facing one takes orders, this layer handles distribution.\nThe margins today are already inefficient. These companies should be able to grow quickly.",
          "author": "muzani",
          "replies": [
            {
              "text": "I feel like there's no market for this. Or at the very least, it's an incredibly niche market. Hear me out :)\nFirstly, this is a pretty expensive approach to cooking, so you're already in a narrow space (people with money). There are a lot of products in this space already, from restaurants to (high quality) frozen meals etc.\n(Aside - meals for 4 implies kids, and people with kids tend to have financial boundaries.)\nSecond you want health food. So again, more niche inside your niche. My instinct (since I've done no actual market research) is that people who are into health food aren't great candidates for subscriptions. They're into provenance, minimizing waste, and so on.\nThirdly, you're asking people to cook the meal. (Which I applaud, cooking meals is a good thing.) But cooking is easy. Once you've learned 10 dishes it's easy to learn another one. And you tweak to suit your taste. At which point your \"service\" is little more than grocery delivery.\nPrepping food actually takes minimal time (in the real world). To a novice getting an onion peeled or chopped might be a time saver, but in reality it takes seconds to do it manually. Honestly the time spent ordering etc would dwarf savings here.\nLastly, there's little incentive for people to remain on this service long-term. Maybe it's useful in the learning phase. But it's a quick cut as skills develop. So short term, high turnover customer base.\nObviously it could be done. In a rich neighborhood you might even get enough customers to keep a delivery guy busy. But outside of SF I don't see it catching on.\nBut don't worry about what I think, I've been wrong many times. All I suggest is lots of market research first (perhaps outside California. )",
              "author": "bruce511",
              "depth": 1
            },
            {
              "text": "It's the other way around. It won't work in expensive places like SF or NYC, because the people who move there are happy to pat paprika on a chicken and toss them into an air fryer. Or live on rice and beans.\nHere there's some cultural pressure on people to cook for their families. Especially Asian moms. Someone feeding their kids McDonald's and frozen meals is going to be judged, but what's a parent who works 996 supposed to do? Though back when I was in uni, we'd take turns preparing dinner; I can see it working for students as well.\nCooking is also always cheaper than buying it off the shelf. We buy the frozen spinach despite it being 3x the cost of fresh spinach because we don't want to wash the sand out of spinach and then wash the sand out of the sink.\nMy problem is we have a bunch of stuff in the fridge. Prep is less about time, more about energy. I'm hungry, I don't want to peel carrots. We buy large batches of fish over the weekend and clean them up and prepare them, but they're in the sink 4 days a week and 2 of those days we just end up eating outside.\nI think everyone wants healthy food as a core meal. We're talking something other than pasta with butter - the health ministry suggests dishes of 1/4 carbs, 1/4 protein and 1/2 veggies. But what choices do you have here? Nobody wants to retrofit their usual dishes to have less carbs and more veggies, lol. Cutting down on protein also cuts cost. Tim Ferris says eat the same thing every other day but most people don't do this, especially not kids. There are plenty of healthy options. Grilled veggies do taste great and so are things like minestrone. Burgers can pass the health food bar too.",
              "author": "muzani",
              "depth": 2
            },
            {
              "text": "hm",
              "author": "dontoni",
              "depth": 1
            }
          ]
        },
        {
          "top": "Hey, I'm in a similar boat as you. I'm looking for ideas to start a business. I'm considering starting an agency, becoming a contractor for cloud products, or looking for product ideas... anything to help me start my own business. If you would like to get in touch to share ideas let me know.",
          "author": "19sblanco",
          "replies": []
        },
        {
          "top": "inspired by a recent thread on here, a usability testing service for apps and websites where the testers are old people",
          "author": "gradschool",
          "replies": []
        },
        {
          "top": "This is a very common question here and most will scroll right by, so don't feel bad.  It's an impossible question to answer, really.\nBut these are the things you need to consider first when choosing an area to work in for developing a product and ultimately a business:\n1. What do you know really well?  These are things that come from your personal experiences.  Note: this is generally not about software or coding skills--it's about everything else in the world.\n2. What are the problems or valuable opportunities in the areas you know well?  Where there are serious problems, there are opportunities for valuable solutions.\n3. Timing.  What's happening in the world and how do the changes open doors for new solutions?\n4. Market and Value.  How many people suffer with the problems you are trying to solve?  How well do you understand them?  How much money will they spend for a solution?  How many of these people have you spoken with: 25, 50, 100?\n5. Who is competing in your market?  What can you learn from them?  How does your solution compare?\nIt's best to consider several problems and conceptual solutions before settling on one.  Talk with people, build small prototypes, figure out if you truly understand the requirements.\nIf you do all of these things, you will have a much better shot at bringing forward a viable product and business idea.\nThere are some really good books out there on this whole process.  Good luck.",
          "author": "jschveibinz",
          "replies": [
            {
              "text": "awesome reply thanks dude",
              "author": "dontoni",
              "depth": 1
            }
          ]
        },
        {
          "top": "A universal part search. Google used to be able to do this with simple quotes, however it is steadily becoming terrible at this.",
          "author": "1970-01-01",
          "replies": []
        }
      ]
    },
    {
      "id": "47077312",
      "title": "Ask HN: Are hackathons still worth doing?",
      "link": "https://news.ycombinator.com/item?id=47077312",
      "domain": "news.ycombinator.com",
      "author": "kwar13",
      "score": 10,
      "comment_count": 9,
      "created_ts": 1771526214,
      "is_internal": true,
      "post_text": "I used to love attending hackathons and also participating as mentor&#x2F;judge at times. With the explosion of vibe coded submissions, 1- the number of submissions has exploded, 2- it&#x27;s much harder to judge quality of project as it&#x27;s mostly become judging the quality of tool they used.<p>I&#x27;m not really throwing shade at using ai. There are parts where the vibe coding really shines, such as front-end dev which tends to do a great job at, but anything more complex I&#x27;m still not convinced.",
      "is_ask_hn": true,
      "matched_keywords": [
        "mentor"
      ],
      "comments": [
        {
          "top": "Exactly this. At a recent hackathon, I spent the bulk of my time actually engineering, building custom model architecture in Lua, wrangling a dataset, and waiting on training loops. The winning project? A slick UI wrapped around a basic LLM API call.\nIt’s incredibly frustrating. The incentive structure at these events has completely shifted away from actual technical complexity toward whoever can build the prettiest ChatGPT wrapper in 6 hours..",
          "author": "foxandmouse",
          "replies": [
            {
              "text": "As far as my experience goes, hackathons have never been about technical meritocracy but pitching and presentation",
              "author": "Gooblebrai",
              "depth": 1
            },
            {
              "text": "I never found that engineering helped much at the hackathons I went to. It was always a slick UI that didn't really do anything, and a good presentation.",
              "author": "idontwantthis",
              "depth": 1
            }
          ]
        },
        {
          "top": "They are now vibeathons. \nSame thing but now it's how much do you write by hand, it's  how much   can  you delegate to the LLM while you're writing by hand.\nThat act of juggling has become an important part.\nPeople will just look for harder problems to solve. It will remain but differently",
          "author": "kbrannigan",
          "replies": []
        },
        {
          "top": "Still worth it if you optimize for learning and people, not podiums. I only do events with explicit judging weights, then include a short architecture note so judges can see beyond the demo polish. The best outcome is usually meeting one solid future teammate, not winning.",
          "author": "lyaocean",
          "replies": []
        },
        {
          "top": "Last hackathon I participated in was merely \"best presentation\". Code, app did not matter, it was idea and presentation what mattered.\nThankfully, properly working app won that one, nonetheless they suck now.",
          "author": "red_Seashell_32",
          "replies": [
            {
              "text": "In my experience they've always been this way. Real engineers lose to idiots that can knock out a nice Wordpress website. Now the way real engineers lose to idiots that can vibe out a nice UI.\nSame same, but different.",
              "author": "OccamsMirror",
              "depth": 1
            }
          ]
        },
        {
          "top": "Before AI people already used preexisting projects for hackathons.",
          "author": "atleastoptimal",
          "replies": []
        }
      ]
    },
    {
      "id": "47096593",
      "title": "Ask HN: What happens to all the hardware when data centers upgrade?",
      "link": "https://news.ycombinator.com/item?id=47096593",
      "domain": "news.ycombinator.com",
      "author": "givemeethekeys",
      "score": 9,
      "comment_count": 8,
      "created_ts": 1771638300,
      "is_internal": true,
      "post_text": "It seems like there will be a lot of hardware that gets discarded every couple of years as new, more powerful systems are made available.<p>AWS put out a video and article on how it recycles a large amount of its hardware, since it is built for maintainability and repairability.<p>How true is that? Does it apply to other datacenter operators as well?<p>What will happen to all the parallel compute cards that will get upgraded soon? They can&#x27;t be reused as GPU&#x27;s for gamers, can they?",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "Generally large companies will have an existing vendor that they use to dispose their IT equipment through. They will shred parts like storage devices and anything that can reasonably be resold will be sold through various auction houses.\nSticks of ram will certainly be resold, custom aws motherboards - not so much.\nI have seen custom (unpublished) intel cpu parts on ebay before which are almost certainly aws's custom ones.\nAlmost nothing will get used by consumers - enterprise server gear is designed for heat/air speed/noise/energy cost requirements which are incompatible with consumer requirements. It's recycled only in the sense that a smaller business might be interested in it because at the end of its economic life its now cheap to buy (but not cheap to run).\nhttps://cloudninjas.com/\nhttps://savemyserver.com/\nhttps://unixsurplus.com/",
          "author": "everfrustrated",
          "replies": [
            {
              "text": "I broadly agree with you in regards to \nserver-class\n equipment \nas a whole\n.\nSimply put, your average gamer isn’t going to snag a 16-unit rackmount blade server to game with. Not only is it supidly inappropriate for home use, but it is also wildly out-of-spec with what gaming requires.\nHowever, normal rackmount servers - especially 3U+ units that have a decent number of PCIe slots - can be extracted from rackmount cases and put into eATX cases that can better serve them on a desktop. It’s what I have done before, to great effect. With the right heatsinks and case fans, it can end up being a moderately quiet system. Loud for a consumer system, sure, but nothing like the “Boeing Dreamliner at full takeoff power” that an actual server setup would generate for sound.",
              "author": "rekabis",
              "depth": 1
            }
          ]
        },
        {
          "top": "Most of it goes through ITAD channels: storage gets wiped or shredded, reusable gear gets resold, and the rest is recycled by weight. Accelerator cards usually get a second life with smaller clouds/labs, but older SXM generations fall off fast. The useful metric I wish providers published is split by class: reused vs recycled vs trashed.",
          "author": "lyaocean",
          "replies": []
        },
        {
          "top": "It depends on what it is. A lot of these places don't own any of the hardware they just lease it. When the lease is up is when they cycle it out. Then it goes to resellers and often ends up on eBay or bulk sold to lower tier data centers. Depending on what it is maybe even shipped to other countries.",
          "author": "elmerfud",
          "replies": []
        },
        {
          "top": "huge ITAD/ITAM companies. G / AWS mega datacenters have their own processes but ITAD companies will then upgrade, recycle, or straight up sell devices or full machines. they of course, have government standards when wiping hard drives / dram etc.",
          "author": "BorisMelnik",
          "replies": []
        },
        {
          "top": "What will happen to all the parallel compute cards that will get upgraded soon? They can't be reused as GPU's for gamers, can they?\nYou're right; V100/A100/H100 \"GPUs\" do not have the hardware to display graphics and they generally require custom SXM motherboards. Most of them will sit on eBay for a while and then be scrapped when no one buys them.",
          "author": "wmf",
          "replies": [
            {
              "text": "If they can't display graphics they're not really GPU's at all. Maybe someone will think of a use for them. With an SXM-to-PCIe adapter board.",
              "author": "lostworld",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47100289",
      "title": "Ask HN: What (other) jobs do you think of doing?",
      "link": "https://news.ycombinator.com/item?id=47100289",
      "domain": "news.ycombinator.com",
      "author": "penguin_booze",
      "score": 8,
      "comment_count": 17,
      "created_ts": 1771677773,
      "is_internal": true,
      "post_text": "With AI infesting and eating into all kind of crafts--and I being one of those faceless &quot;craftsmen&quot;--I&#x27;m rather forced to consider alternative jobs. Setting the monetary rewards aside, I was thinking of jobs that could give me a sense of agency, purpose, and satisfaction (however limited). The few I think of are:<p>- Parcels delivery driver<p>- Train driver<p>- Electrician or plumber<p>- Mechanic (with auto-mobiles hardly repairable these days, maybe this doesn&#x27;t qualify)<p>Surely, I can&#x27;t be alone in thinking along those lines. What else have you thought of?",
      "is_ask_hn": true,
      "matched_keywords": [
        "purpose"
      ],
      "comments": [
        {
          "top": "I started my own business when I left tech. It's a bar.\nI do my own mechanic work, but I have old trucks. I would never sign up to work on modern vehicles and the entitled customers trying to get one over on you.\nI drove a route (not delivery) many years ago and I liked that. I tend to like jobs where you start with a pile of work, and finish with none left, rather than perpetually working towards something that's never done, like maybe a software project.",
          "author": "qup",
          "replies": []
        },
        {
          "top": "I have felt that shift too. One thing that helped me was focusing on skills where you build and ship something yourself — even small tools or utilities. That sense of ownership and direct usefulness is hard to replace and still very satisfying.",
          "author": "allinonetools_",
          "replies": []
        },
        {
          "top": "I keep a short list of jobs where the output is visible by the end of the day: electrician, field technician, rail operations, even property maintenance. Shadowing someone for one real shift helped me separate fantasy from fit much faster than more online reading.",
          "author": "lyaocean",
          "replies": []
        },
        {
          "top": "Delivery drivers and train conductors are both headed for automation. I think trains are mostly already there. They mostly have a human for emergencies, as far as I know.\nThis is something I’ve been thinking about, but nothing speaks to me enough to jump ship. Anything I think of also means taking a huge pay cut, so it seems to make sense to stay on the current track until the wheels fall off to maximize my savings to soften the transition. It’s also possible that I may never need to switch careers before retirement, so it could be a moot point.",
          "author": "al_borland",
          "replies": []
        },
        {
          "top": "I think people would do best to retool away from “coder” towards some specilaization where coding is part of the job. Don’t be a coder, be an X that codes.\nIf we think of coding becoming like writing, then you can see how it might be a ubiquitous skill - but still some differentiation. Some small number of highly skilled people do it full time. Some people do is as a big part of their job (journalists, etc). Still others it’s not core to the job, but it helps (a lot of white collar work).",
          "author": "softwaredoug",
          "replies": []
        }
      ]
    },
    {
      "id": "47064523",
      "title": "Ask HN: Why are there no talks about Seedance 2.0 on Hacker News?",
      "link": "https://news.ycombinator.com/item?id=47064523",
      "domain": "news.ycombinator.com",
      "author": "ElectroNomad",
      "score": 8,
      "comment_count": 7,
      "created_ts": 1771440005,
      "is_internal": true,
      "post_text": "Generated videos that I see from ByteDance’s Seedance 2.0 model are pretty ground breaking (compared to Sora, Google Veo and such).<p>Genuinely surprised not to see a lot of chatter about it on HN!",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "HN is very interested in coding agents, and many are interested in voice AI.  Not so much video generation, perhaps because its still so limited .",
          "author": "kristianp",
          "replies": []
        },
        {
          "top": "I see quite a lot on X.\nThe specs they have for Seedance 3.0 look insane, I wonder if they can pull it off.",
          "author": "tmaly",
          "replies": [
            {
              "text": "That one looks like fake news to me. But we will see. I think the next iteration may reach 1-2 minutes instead of 15 seconds, so we will see 5 minutes of stitched together videos instead of 1-2 mins.",
              "author": "ferguess_k",
              "depth": 1
            }
          ]
        },
        {
          "top": "I hate to sound like a broken record, but the HN crowd is mostly uninterested in AI use. Much of the news is commentary \naround\n AI, but there's less interest in using it as a technology.\nSeedance 2 is a lot like the DeepSeek moment last year. I fully expect it to blow up and then degrade into conversations about politics. But usually the hype overwhelms X first.",
          "author": "muzani",
          "replies": []
        },
        {
          "top": "Probably because it isn't officially released yet.",
          "author": "atleastoptimal",
          "replies": []
        },
        {
          "top": "AI Fatigue.  I'm a fan of AI but I've stopped clicking on stories about it because it's mostly hype, slop, fomo, and flat-out lies.",
          "author": "fraaancis",
          "replies": []
        }
      ]
    },
    {
      "id": "47106013",
      "title": "Ask HN: If the \"AI bubble\" pops, will it really be that dramatic?",
      "link": "https://news.ycombinator.com/item?id=47106013",
      "domain": "news.ycombinator.com",
      "author": "moomoo11",
      "score": 7,
      "comment_count": 4,
      "created_ts": 1771715714,
      "is_internal": true,
      "post_text": "I&#x27;m building software for a sector that is massive, but one where you don&#x27;t really need AI. At least, not AI == LLM.<p>And before I go further, let me state up front that I do like AI coding agents. They are great as assistive tools.<p>People say that if the AI bubble pops, the economy tumbles. And okay, I mean the M7 will certainly get rekt but everyone else? Things will recover within a few years. We didn&#x27;t make it to 2026 AD taking the easy road.<p>You still need to visit the doctor. Goods still need to be delivered. Homes need to be built. We need to drill for oil. People still need to eat. And yes, unfortunately or not, we still need millions of administrators because humans are not 0&#x2F;1 systems.<p>Am I crazy to think that maybe it won&#x27;t be that bad? There are still infinite number of things to do, and maybe (call me stupid, whatever) it would be a good turning point for our species if we realize that speculative bubbles are absolutely destructive and not worth it.<p>I don&#x27;t need a personal assistant to make calls for me to get a restaurant reservation, and I certainly don&#x27;t care for AI slop videos. I would much rather we have better products and services that actually work, and even if they have rough edges I would prefer people are employed and busy doing something with their lives.<p>Maybe a world where we don&#x27;t chase endless growth (to escape inflation, pay off debts, whatever the case) would be good. And also we put nerds (not people like us, the engineers, I mean the evil dorks who cosplay as movie super villains) in the toy box again and pick up different toys this time.",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "No the economy doesn’t tumble. All of the major public tech companies have real businesses that were profitable before AI and will be profitable after AI.  All except Amazon are spending money out of their own revenues.\nBusinesses aren’t going to stop growing because of AI, the only public company really dependent on AI are NVidia and Oracle. Oracle because it is borrowing money to support build out for OpenAI.",
          "author": "raw_anon_1111",
          "replies": [
            {
              "text": "lol @ “all except amazon are spending their own revenues…”\nhttps://www.cnbc.com/amp/2026/02/12/alphabet-100-year-bond-d...",
              "author": "bdangubic",
              "depth": 1
            },
            {
              "text": "Apple also borrowed money - pre AI when it had plenty of cash,  have you checked Google’s last year earnings and cash on hand?",
              "author": "raw_anon_1111",
              "depth": 2
            }
          ]
        },
        {
          "top": "Well, the Great Fiscal Crisis did not result in mass starvation, so in some sense, it \"wasn't all that dramatic\".  But, it was a big deal in comparison to a normal downturn.  So, it depends on what you mean.\nMedium term, I think it would release a lot of resources (skilled workers, productive capacity, energy) to use on something more productive.  But then, I kind of hoped for that after the GFC, also...",
          "author": "rossdavidh",
          "replies": []
        }
      ]
    },
    {
      "id": "47076978",
      "title": "Ask HN: Can a license make large corporations give back?",
      "link": "https://news.ycombinator.com/item?id=47076978",
      "domain": "news.ycombinator.com",
      "author": "arboles",
      "score": 7,
      "comment_count": 9,
      "created_ts": 1771524794,
      "is_internal": true,
      "post_text": "I&#x27;ve no expectations for this post to be well-received because it looks down on open-source for being too &quot;pure&quot;. Though unless we evolve beyond no-strings-attached open-source, the ecosystem will remain as broken as it is. Why don&#x27;t our overworked, underpaid open-source developers license their software with something to the effect of &quot;If you make more than $1,000,000, pay me.&quot;? JSON designer (&quot;the&quot; JSON) Douglas Crockford had IBM ask for permission to use JSLint, because Douglas had added the note&#x2F;clause&#x2F;term &quot;The Software shall be used for Good, not Evil.&quot;[1]<p>We don&#x27;t know if GPL works in court. It roughly seems like whatever you write in a license is an effective deterrent though. So your repository could take an existing permissive license like MIT, and add a clause like I mentioned. Set a procedure for your terms for others to use your open-source project commercially. An example of this is the Big Time Public License.[2]<p>[1] https:&#x2F;&#x2F;wonko.com&#x2F;post&#x2F;jsmin-isnt-welcome-on-google-code&#x2F;<p>[2] https:&#x2F;&#x2F;bigtimelicense.com&#x2F;versions&#x2F;2.0.2#big-business",
      "is_ask_hn": true,
      "matched_keywords": [],
      "comments": [
        {
          "top": "You can require payment from big companies, but then it’s source-available, not OSI open source. The practical path is dual licensing (AGPL/commercial style). The real bottleneck is enforcement budget and legal stamina when someone violates it.",
          "author": "lyaocean",
          "replies": []
        },
        {
          "top": "To give credit, this a question I'm asking after reading this blog post, but a solution for the stifling unfairness of commercialization in open-source is something I've been thinking about for a good while. The essay \"The Cathedral and the Bizarre\" on \nhttps://marktarver.com\n is also worth reading, despite that I find some of the arguments to be in bad faith.\nhttps://pointless.one/my-next-project-wont-be-floss/",
          "author": "arboles",
          "replies": []
        },
        {
          "top": "> We don't know if GPL works in court.\nIf lacking precedent is your main concern, there are no software licenses that are likely to fill your criterion.",
          "author": "bigyabai",
          "replies": [
            {
              "text": "I'm trying to imagine something other than GPL. The fact that the GPL license is respected in the vast majority of cases, without a precedent being necessary is very exciting.",
              "author": "arboles",
              "depth": 1
            }
          ]
        },
        {
          "top": "> Why don't our overworked, underpaid open-source developers license their software with something to the effect of \"If you make more than $1,000,000, pay me.\nBecause that isn't open source, and is arguably not enforceable anyway.\nHow do you define \"make $1M\"? There are mega corporations with billions in revenue that somehow have a negative tax bill each year, so clearly taxable income isn't a reliable indicator.\nConversely a non profit organisation may have several million in donations/income but spend all of it on their charitable causes.\nSo clearly net revenue isn't a reliable indicator either.\nIf you don't want to release software under a licence without monetary terms, then don't. No one is forcing you to do that.",
          "author": "stephenr",
          "replies": [
            {
              "text": "Do you think it's not enforceable because of that definition? Revenue of $1M alone (not net revenue) should be a rough proxy of organization size. If a company makes that kind of money it should be able organize its expenses to pay a reasonable price for the software they rely on. There could be an exception for non-profits, if it would make more  sense. If companies were rational they would already be paying the reasonable amount for \"normal\" open-source software, since unmaintained software in their supply chain also can also become a problem for them.\nBTPL (I just think BTPL is neat) has these concrete terms:\n>You may use the software for the benefit of your [small business] if it meets all these criteria:\n* had fewer than 20 total individuals working as employees and independent contractors at all times during the last tax year\n* earned less than $1,000,000 total revenue in the last tax year\n* received less than $1,000,000 total debt, equity, and other investment in the last five tax years, counting investment in predecessor companies that reorganized into, merged with, or spun out your company",
              "author": "arboles",
              "depth": 1
            },
            {
              "text": "> Do you think it's not enforceable because of that definition?\nI think companies with millions or billions in revenue pay lawyers a lot to find loopholes in things like this.\n> BTPL\nI have no clue what that is, and I can't even find a reference to it anyway. All I found is a public library somewhere and something about a Pakistani power company or something.\n> * had fewer than 20 total individuals working as employees and independent contractors at all times during the last tax year\nThat's simple to get around, and big companies already do it. Hire an external development agency. They might be sitting in your office but they're neither employees nor independent contractors.\nUltimately though, the point I made earlier is still the most relevant response. If you don't like OSS licences, don't use one. Use whatever you're comfortable with. But don't imagine for a moment that you're better able to identify the needs of every one else who writes software and does use an OSS licence.",
              "author": "stephenr",
              "depth": 2
            },
            {
              "text": "Regarding BTPL, it's a license called Big Time Public License, which I mentioned in my original post. It was written by this guy that has written a bunch of experimental software licenses.[1]\nIf I were to choose a license in an informed way, I would want to really understand other people's choice of using OSS licenses. I almost exclusively use open-source/libre programs in my devices and make code contributions occasionally. I think I'm familiar with the ecosystem \nmore than\n the commercial (proprietary) ecosystem. The freedom bestowed by owning the copy of the source code is very important in my opinion. While OSS is the best model we have right now, I and others see flaws, like dependency-chain failures, maintainer burnout and not-so-good incentives like keeping your system unpolished/hard to use so support can be your income.\nPerhaps only 80% of the monetization will succeed because of loopholes, but suppose you can tack on monetization to an open-source license. It's still better than 0% monetization. In plain terms, my question is, even if it would no longer be real open-source (true), why wouldn't developers want that?\n[1] \nhttps://github.com/berneout",
              "author": "arboles",
              "depth": 3
            },
            {
              "text": "I concur.\n>> Why don't our overworked, underpaid open-source developers license their software\nOf course they absolutely can license their software any way they like. That is their prerogative. Personally I write software for a living and it's all licensed with a commercial license.\nBy definition then I am not an Open Source Programmer. (I work on the odd Open Source project, but that's not the same thing.)\nSo any programmer can license things anyway they like. If their license is Open Source compatible then they're free to call themselves an Open Source programmer.\nYour suggestion is equivalent to asking why an amateur golfer can receive prize money in a professional tournament. They very much can though, but then they're no longer an amateur.",
              "author": "bruce511",
              "depth": 1
            }
          ]
        }
      ]
    },
    {
      "id": "47105086",
      "title": "Ask HN: Programmable Watches with WiFi?",
      "link": "https://news.ycombinator.com/item?id=47105086",
      "domain": "news.ycombinator.com",
      "author": "dakiol",
      "score": 6,
      "comment_count": 3,
      "created_ts": 1771709995,
      "is_internal": true,
      "post_text": "Hi. I&#x27;m looking for a programmable watch with wifi. Ideally I should be able to write custom programs&#x2F;apps for the watch to display whatever I want to on them (e.g., make the watch make an https call to a server, receive json and render accordingly; allow the watch to receive &quot;notifications&quot; from the server)<p>Also, ideally, no requirement of a smartphone to send-receive data (it&#x27;s ok to need a smartphone for the initial setup of the watch, though). I know about Pebble, but it doesn&#x27;t have wifi. I know about some Garmins with wifi but for the kind of apps I want to write, the communication between the watch and the server has to be mediated by a phone. Also, correct me if I&#x27;m wrong, I don&#x27;t want to pay $100&#x2F;year just to be able to use my custom app in apple watches. I usually don&#x27;t trust Google either (e.g., they discontinue everything in a blink of an eye).<p>So, what are my options?",
      "is_ask_hn": true,
      "matched_keywords": [
        "communication"
      ],
      "comments": [
        {
          "top": "I have one of the TTGO T-watches: \nhttps://www.tinytronics.nl/en/development-boards/microcontro...\nFor me it is mainly a decoration of my drawer, but maybe comes close to what you are looking for. :)",
          "author": "oliwary",
          "replies": []
        },
        {
          "top": "If you want truly standalone + WiFi + custom code, check SQFMI Watchy (ESP32). You can flash your own firmware, call HTTPS endpoints, parse JSON, and render custom UI without a phone in the loop.\nMain tradeoff: it’s very DIY (power management, UX polish, tooling). If you want less DIY, Wear OS gives a better SDK, but the platform lock-in is much stronger.",
          "author": "lyaocean",
          "replies": []
        },
        {
          "top": "Is this question in any way related to television?\nI just had to solve this problem recently. I've settled on Google Pixel Watch 4. There are some rabbit holes to go down though before it works reliably.",
          "author": "herczegzsolt",
          "replies": []
        }
      ]
    },
    {
      "id": "47090697",
      "title": "Ask HN: Who Should I Talk To?",
      "link": "https://news.ycombinator.com/item?id=47090697",
      "domain": "news.ycombinator.com",
      "author": "3pt14159",
      "score": 5,
      "comment_count": 2,
      "created_ts": 1771607248,
      "is_internal": true,
      "post_text": "I am in a bit of a sticky situation. I&#x27;m 40 years old and my background is in programming (backend ruby and python, some cybersecurity, some JavaScript, although the JS is dated) and I don&#x27;t like coding anymore. At least not day to day.<p>What I&#x27;m looking for is some sort of position that can leverage my background but do so in some other way. Maybe something in marketing at a company like Digital Ocean.<p>I&#x27;m willing to earn a lot less than I earned before. I know software development pays better than a role in marketing, but I&#x27;m sick of the tooling. I&#x27;m also open to working for an AI company that trains a software agent, which I&#x27;ve done so recently. Does anyone have references to a recruiter or hiring manager that I could talk to?<p>I would really appreciate any help here. Even just an upvote for visibility.",
      "is_ask_hn": true,
      "matched_keywords": [
        "manager",
        "hiring"
      ],
      "comments": [
        {
          "top": "We're all under a bad star right now.  There aren't many options, lots of people underemployed and many more completely unemployed.  Competition is fierce.  I don't have much to say, unfortunately, other than recognizing that it's hard and wishing the best for you.",
          "author": "david927",
          "replies": []
        },
        {
          "top": "The old model is in flux. The comfortable employment wage cycle is breaking down.\nThe most obvious and timeless wisdom is to find those directly who need someone competent to walk them through the business needs of modernizing technology.\n1099 or LLC my friend. It’s a bunch of work you may not like doing, up front anyway, once you have a few businesses or individuals whose problems you solve, or convinced to subscribe to your simplifying service things will be like the good old days, only you will have more power in your own process.\nJust setting up an AI video security system and walking away is a for instance. Everyone will want that now that it’s so cheap, and offlinable, only few can sit down and get a tolerable interface working for the little guy.\nFor instance.\nAdapt, stop trying to cling to the “old way.”",
          "author": "uncanny2",
          "replies": []
        }
      ]
    },
    {
      "id": "47105305",
      "title": "Write Perfect Emails in Seconds",
      "link": "https://news.ycombinator.com/item?id=47105305",
      "domain": "news.ycombinator.com",
      "author": "vinayofc",
      "score": 4,
      "comment_count": 1,
      "created_ts": 1771711429,
      "is_internal": true,
      "post_text": "If you do any cold outreach, you probably know the pain of standard AI output. It’s always overly formal, generic, and screams “a robot wrote this.” While building AI SaaS tools lately, I got so tired of endlessly tweaking prompts just to sound human that I built a solution: Amazing Emails - https:&#x2F;&#x2F;www.amazingemails.xyz<p>Instead of being a general chat tool, it’s wired strictly for direct-response copy using proven frameworks (think Halbert or Ogilvy).<p>Give it a specific goal: Instead of &quot;sell my service,&quot; tell it &quot;get them to reply with a good time for a 5-minute chat.&quot;\n•  Pick your variation: It generates a few different angles and subject lines. Pick the one that fits your actual personality to cure the blank page.\n•  Try it instantly: You get 5 full emails for free right out of the gate—no credit card, no waitlist.<p>I’m still actively improving the output quality and would genuinely love some brutal feedback from this community.",
      "is_ask_hn": false,
      "matched_keywords": [
        "feedback"
      ],
      "comments": [
        {
          "top": "As someone who hates getting unsolicited email, why should I give someone 5 minutes of my time when they couldn’t take 5 minutes to write a real email?",
          "author": "al_borland",
          "replies": []
        }
      ]
    }
  ]
}