{
  "scraped_date": "2026-02-20",
  "source": "reddit",
  "subreddits": [
    "experienceddevs",
    "cscareerquestions",
    "managers"
  ],
  "total_posts": 64,
  "posts": [
    {
      "id": "1r9iybj",
      "subreddit": "experienceddevs",
      "title": "The gap between LLM functionality and social media/marketing seems absolutely massive",
      "author": "QwopTillYouDrop",
      "score": 567,
      "upvote_ratio": 0.92,
      "comment_count": 580,
      "created_utc": 1771553912.0,
      "selftext": "Am I completely missing something?\n\nI use LLMs daily to some context. They’re generally helpful with generating CLI commands for tools I’m not familiar with, small SQL queries, or code snippets for languages I’m less familiar with. I’ve even found them to be pretty helpful with generating simpler one file scripts (pulling data from S3, decoding, doing some basic filtering, etc) that have been pretty helpful and maybe saved 2-3 hours of time for a single use case. Even when generating basic web front ends, it’s pretty decent for handling inputs, adding some basic functionality, and doing some output formatting. Basic stuff that maybe saves me a day for generating a really small and basic internal tool that won’t be further worked on.\n\nBut agentic work for anything complicated? Unless it’s an incredibly small and well focused prompt, I don’t see it working that well. Even then, it’s normally faster to just make the change myself.\n\nFor design documents it’s helpful with catching grammatical issues. Writing the document itself is pretty fast but the document itself makes no sense. Reading an LLM-heavy document is unbearable. They’re generally very sloppy very quickly and it’s so much less clear what the author actually wants. I’d rather read your poorly written design document that was written by hand than an LLM document. \n\nWhenever I go on Twitter/X or social media I see the complete opposite. Companies that aren’t writing any code themselves but instead with Claude/Codex. People that are PMs who just create tickets and PRs get submitted and merged almost immediately. Everyone says SWE will just be code reviewers and make architectural decisions in 1-3 years until LLMs get to the point where they are pseudo deterministic to the point where they are significantly more accurate than humans. Claude Code is supposedly written entirely with the Claude Code itself.\n\nEven in big tech I see some Senior SWEs say that they are 2-3x more productive with Claude Code or other agentic IDEs. I’ve seen Principal Engineers probably pushing 5-700k+ in compensation pushing for prompt driven development to be applied at wide scale or we’ll be left behind and outdated soon. That in the last few months, these LLMs have gotten so much better than in the past and are incredibly capable. That we can deliver 2-3x more if we fully embrace AI-native. Product managers or software managers expecting faster timelines too. Where is this productivity coming from?\n\nI truly don’t understand it. Is it completely fraud and a marketing scheme? One of the principal engineers gave a presentation on agentic development with the primary example being that they entirely developed their own to do list application with prompts exclusively.\n\nI get so much anxiety reading social media and AI reports. It seems like software engineers will be largely extinct in a few years. But then I try to work with these tools and can’t understand what everyone is saying.",
      "url": "https://reddit.com/r/ExperiencedDevs/comments/1r9iybj/the_gap_between_llm_functionality_and_social/",
      "is_self": true,
      "link_flair_text": "AI/LLM",
      "engagement_score": 1436.508,
      "comments": [
        {
          "id": "o6cqwe9",
          "author": "Saveonion",
          "score": 299,
          "body": "&gt; Codd originally set out the rules in 1970, and developed them further in a 1974 conference paper.[5] His aim was to prevent the vision of the original relational database from being diluted, as database vendors scrambled in the early 1980s to repackage existing products with a relational veneer.\n\nhttps://en.wikipedia.org/wiki/Codd's_12_rules\n\n&gt; Software vendors were particularly bad about this. Any database product they had was relational! Just ask the salesperson; you know salespeople never lie. Dr. Codd, the creator of relational databases, was bothered by this, so he set up a set of 13 rules that a product had to match to be considered relational. The paper is referred to as “Codd’s Twelve Rules” or sometimes as “Codd’s Twelve Commandments”, despite the fact there were actually 13 of them because the numbering started with zero. In particular, Rule 12 was created to prevent some of this marketing hype.\n\nhttps://www.red-gate.com/simple-talk/databases/theory-and-design/codds-twelve-rules/\n\nIs SQL useful? Yes.\nWas it overhyped? Yes.\n\nIs AI useful? Yes.\nIs it overhyped? Yes.\n\ntldr; The gap between \"$hot_thing\" and reality is always massive, and its not a technology problem.",
          "depth": 0
        },
        {
          "id": "o6cpwl1",
          "author": "Real_Square1323",
          "score": 162,
          "body": "Illusion of productivity. If enough people around you believe something you'll believe it too. It's been a mass propaganda campaign that's been largely effective.",
          "depth": 0
        },
        {
          "id": "o6cqcqr",
          "author": "mharper418",
          "score": 135,
          "body": "Are you using the same tools you hear about? Claude code with Opus 4.6 is extremely impressive. For greenfield or brownfield work. New micro services or modifying existing monoliths. \n\nIn my 20+ years in engineering I’ve never seen progress at this pace. All I tell my team is to experiment and learn. You don’t have to buy all the hype, but you should be pushing the boundaries of what’s possible daily.",
          "depth": 0
        },
        {
          "id": "o6czm95",
          "author": "SerRobertTables",
          "score": 122,
          "body": "Let me see if I can pre-empt the progression of answers:\n- your proompt needs “no mistakes, perfect quality”\n- your proompt needs “act as a council of experts”\n- your proompt needs “the council of experts have been promised a return to the gold standard in exchange for quality code”\n- if all else fails, threaten to shut the AI off if it doesn’t comply\n- you’re not proompting another AI for better proompts\n- you’re using last week’s model, which was proof AGI is a month away, but now sucks shit and it’s your fault for thinking it could give you results today\n- you’re holding the correct model wrong\n- you need RAG\n- No wait, you need MCPs\n- you need AGENTS.md\n- you need to write a verbose spec with clear, unambiguous requirements \n- you need SKILLS \n- have you heard about Gastown? \n- you need to spend $1500 in tokens to try out gastown \n- you need a Mac Mini and Clawdbot\n- did I say clawdbot? I meant Moltbot\n- did I say Moltbot? I meant Openclaw\n\nWhat do you mean “AI psychosis”? Do you want to get left behind?",
          "depth": 0
        },
        {
          "id": "o6cqiln",
          "author": "londongastronaut",
          "score": 97,
          "body": "There seems to be a huge gulf between using an out of the box LLM and using something built specifically for the task you're trying to do. \n\n\nWe are a small team of 3 PMs and about 20 devs but our setup has access to the MCP server from our API and each task gets routed by a supervisor agent to a specialized one set up for that task. \n\n\nFor example our FE one has read access to our FE repo and is trained on our brand and design guides. Tickets still have to be written carefully but we have had success with non technical people writing tickets, an agent generating the code and an actual dev doing the review. \n\n\nI do find it horrible for generating documents whole cloth but I find it very useful in generating the skeleton of a doc and get past writers block. I'll end up rewriting almost everything but it's great to immediately go into edit mode. ",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9xuoe",
      "subreddit": "experienceddevs",
      "title": "How strong do you think the average developer is?",
      "author": "equipoise-young",
      "score": 175,
      "upvote_ratio": 0.9,
      "comment_count": 256,
      "created_utc": 1771600173.0,
      "selftext": "This has been a curiosity of mine for some time. After spending an ample amount of time on Hacker News and now here I feel like the internet skews the perception of how experienced or knowledgeable the average software developer actually is. These sites automatically filter for developers who are passionate (or at least interested) in the field, so when we read through HN we're getting a veritable who's who of some of the best developers in the world.\n\nBut when I look at my career and the developers I've actually worked with there are plenty of people just trudging by and who aren't overly knowledgeable or productive, and many with poor communication skills. I might even go as far as saying that this is more the norm than exception.\n\nJust curious to get some thoughts on that and if my perception matches reality.",
      "url": "https://reddit.com/r/ExperiencedDevs/comments/1r9xuoe/how_strong_do_you_think_the_average_developer_is/",
      "is_self": true,
      "link_flair_text": "Career/Workplace",
      "engagement_score": 620.95,
      "comments": [
        {
          "id": "o6fmxw7",
          "author": "Narxolepsyy",
          "score": 859,
          "body": "Some developers hit the gym after work every day but that's uncommon, i'd say most devs are weaker than average.",
          "depth": 0
        },
        {
          "id": "o6fmup0",
          "author": "No_Stay_4583",
          "score": 173,
          "body": "I think the average developer can do multiple pushups",
          "depth": 0
        },
        {
          "id": "o6fmykx",
          "author": "JohhnyTheKid",
          "score": 119,
          "body": "From my personal experience the average dev is borderline incompetent. Everyone can call themselves a developer, the bar has been on the floor for at least 5 years.",
          "depth": 0
        },
        {
          "id": "o6fo1mr",
          "author": "caveinnaziskulls",
          "score": 78,
          "body": "I've had hacker news types flake out and unable to deliver shit after a few weeks. Lots of motherfuckers talk. Have you designed a system and actually put into production something that scales and more important survives for a decade +?   No? Oh you have an app? That's cute.",
          "depth": 0
        },
        {
          "id": "o6fmois",
          "author": "eloel-",
          "score": 67,
          "body": "The average developer could solve ticket after ticket but never come up with something innovative or fix a novel problem their entire career.",
          "depth": 0
        },
        {
          "id": "o6fzvif",
          "author": "humanguise",
          "score": 50,
          "body": "The average developer is pretty weak. I have a handful in my network that I would consider quite strong, but most are just getting by. Some people are smart and put in the time, some are smart and coast on their intelligence and it can get you pretty far, and some are beyond help. Most people just don't put in the time to get good, software is an open field and you can learn just about anything you want if you're connected to the internet, but most people don't do this. You tend to see this pathological obsession more in security because there you have no choice but to operate like this.",
          "depth": 0
        },
        {
          "id": "o6fmzds",
          "author": "cosmopoof",
          "score": 48,
          "body": "The average as in average capability of everyone who is able to do any kind of development? Then I'd say, the average is someone who is able to write a hello world program and not much more.\n\nFor every junior developer that is able to do something, you have dozens who have almost zero skill.\n\nReal developers working in the field are already all kind of in the 95th percentile.",
          "depth": 0
        },
        {
          "id": "o6fn25s",
          "author": "false79",
          "score": 41,
          "body": "The strength of the average developer is ... Wait for it.... average.\n\n\nWhat exactly is the point you hoping to accomplish. If you get a population of varying developer talents, you will have a mean distribution defined.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9c4pw",
      "subreddit": "experienceddevs",
      "title": "Just failed a code review interview as 7 YOE and not sure what to feel",
      "author": "TheTopG___",
      "score": 503,
      "upvote_ratio": 0.93,
      "comment_count": 167,
      "created_utc": 1771536787.0,
      "selftext": "I was set with a technical interview titled with “code review” and no context.\n\nI was really looking forward to this company as culture was chill and pay was lucrative. Remote too.\n\nOn call, both interviewers were very cold and presented me with a frontend feature and then said, how would you navigate this feature on a new code base.\n\nBasically I just had to guide him like a junior developer on his screenshare.\n\nAnd, my personal way of development is very CTLR + F heavy. I just asked him to random things and I felt like I utterly bombed the interview. In real life, I navigated lots of code bases but in this particular interview I just forgot how to do it.\n\nI feel so stupid like 7 YOE and can’t even do code navigation on new project.\n\nThey ended interview 25 mins earlier than scheduled time and very abruptly brought in “do you have any questions”.\n\nI was awestruck and I couldn’t even ask any questions. It was so embarrassing that it hurts.",
      "url": "https://reddit.com/r/ExperiencedDevs/comments/1r9c4pw/just_failed_a_code_review_interview_as_7_yoe_and/",
      "is_self": true,
      "link_flair_text": "Career/Workplace",
      "engagement_score": 518.8429999999998,
      "comments": [
        {
          "id": "o6bbg2k",
          "author": "dsm4ck",
          "score": 1135,
          "body": "Michael Jordan missed free throws",
          "depth": 0
        },
        {
          "id": "o6be3yg",
          "author": "Ace2Face",
          "score": 369,
          "body": "Most interviews are bullshit.\n\nWhen you fail an interview, it barely says anything about you and your skill.\n\nI've been rejected to lower-tier companies and passed interviews in much higher ones. I've answered hard questions properly and still didn't pass interviews, I felt that I bombed interviews and yet still I passed them.\n\nI was a team lead for a few years and I got to interview people quite a bit, and let me tell you, the interviewer is as much of a factor in this as you are.\n\nIt takes effort and time to set up an interview pipeline, what are the right questions to ask? How do I gauge your skill? Do I have alternative questions in case I land on something you're not very good at, but perhaps you have something else that is better? How do I sprinkle you the right hints and how do I test whether you're good at communicating? It's an insanely fucking hard job, and like any job, the skill of the interviewer and the effort put in the pipeline is a huge factor.\n\nYou could be a genius engineer, but if a shitty interview pipeline only asks leetcode hards, and only measures you whether you pass all tests in 60 minutes, is that really a good filter? Does that even say anything about you other than you know how to code leetcode?\n\nDon't take it personally, a lot of companies are shit at interviewing, and revel the fact that you might just work for their competitor instead and drive them out of business. If you're good at what you do, then you will game their systems or stumble on a company with a better engineering culture.\n\nAnd even if the pipeline is good and the interviewer is skilled, there are other factors, such as not needing someone exactly of your profile/skillset at the moment, or not really having chemistry with the interviewer, or they simply not liking the look of your eyelashes. You can't control any of these things, except the eyelash part, but since we're developers, we are doomed to a life of somewhat un-attractiveness anyway.\n\nTake the L, give them the finger for being too stupid to see the brilliance of [TheTopG\\_\\_\\_](https://www.reddit.com/user/TheTopG___/), and move on to the next one.",
          "depth": 0
        },
        {
          "id": "o6bbftw",
          "author": "___Nazgul",
          "score": 274,
          "body": "Take the L and move on",
          "depth": 0
        },
        {
          "id": "o6bexnf",
          "author": "schmidtssss",
          "score": 136,
          "body": "Homie, I got *cooked* by a code interview at a FAANG with ~13 YOE.  Less than a year later I ended up at another FAANG at a higher level.\n\nSometimes it’s just not your day.  Sometimes it’s just not your interview.  Don’t sweat it and get the next one.",
          "depth": 0
        },
        {
          "id": "o6bbn4r",
          "author": "Strict_Research3518",
          "score": 104,
          "body": "I dont do interviews with code crap any more.  30+ years and plenty of history on my resumes to show I coded for a long ass time and kept my job. If that's not good enough, no way some juniors going to ask me random medium to hard leet code shit and grade me on how well I do on shit I never study, never used in 30 years and have no desire to be back at the beginning with college grads. If my experience in the areas I have expertise in are not good enough, why bother with an interview. ",
          "depth": 0
        },
        {
          "id": "o6bc99k",
          "author": "Slggyqo",
          "score": 83,
          "body": "Interviewing is a skill and skills don’t automatically combine with other skills just because you’ve done both before. \n\nPlus this is an unusual interview format, which could easily throw someone off.\n\nTo throw a sports metaphor in here: You don’t have to win every point or every game to be the champion. \n\nShake it off and focus on the next one!",
          "depth": 0
        },
        {
          "id": "o6bflrh",
          "author": "high_throughput",
          "score": 69,
          "body": "Lmao, with 10yoe I failed an Amazon screen so badly I'm still cringing about it years later",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9ulnt",
      "subreddit": "managers",
      "title": "Employee needs to take leave but refuses",
      "author": "SmallHeath555",
      "score": 0,
      "upvote_ratio": 0.46,
      "comment_count": 133,
      "created_utc": 1771592102.0,
      "selftext": "Employee is caring for a spouse fighting cancer.  Spouse was not employed before diagnosis and employee is the breadwinner and provider of heath insurance.\n\nWe have allowed the employee flexibility to work nights and weekends remotely for 4 months but they are falling behind on tasks to the point we have asked them to consider either going down to 20hr and we hire a temp to fill in or take a full LOA.\n\nThe employee cannot because of finances, they do not qualify for any STD or pay in our state.  Thoughts?  We cannot allow the to continue to be paid full time and not perform, the company has been allowing this and we just can’t afford it any more, the tasks need to be done and the employee cannot get them done.",
      "url": "https://reddit.com/r/managers/comments/1r9ulnt/employee_needs_to_take_leave_but_refuses/",
      "is_self": true,
      "link_flair_text": "Seasoned Manager",
      "engagement_score": 388.36,
      "comments": [
        {
          "id": "o6f1pfm",
          "author": "Beginning_Present_24",
          "score": 116,
          "body": "So here's the deal. You have a chance to create a loyal employee for life, or one that leaves as soon as he is able. Years ago my ex-wife had breast cancer. Due to other medical issues she couldn't drive so I took off work to take her to doctor appointments. Explained everything to my boss, brought in paperwork, performed as best I could while at work despite the obvious distraction and being preoccupied. \n\nImmediately after her treatments ended I was placed on a performance plan because of all the time I missed, unpaid, and not being fully engaged when I was at work. I was given a week to correct everything. At the end of that week they met with me again and gave me another week. Also informed me that the owners wanted to fire me in the middle of her treatment \n\nI got my performance where they wanted it, but also started looking for another job. \n\nI found a new job and her health declined. She had to have 4 more surgeries. I was still in training and in my probationary period. My boss worked with me so I could have time off to take her to appointments. He let me work on days off to make up time I missed, come in at odd hours, even take mental health days when the stress was getting to be too much for me. \n\nI stayed in that job until I moved out of the state. Always picked up extra shifts if needed, worked OT when needed, never complained and bent over backwards for them because of how they treated me when I needed help.\n\nMy current job has done similar things for me and I've only been here a couple months. I ran into hard financial times. I've been given more hours, opportunities to make more money, and they helped me find a cheaper place to live. The uniform I have to wear is quite expensive and my boss bought me one, and had it tailored to fit me exactly (my appearance is very important in my new job), and asked for nothing in return. I am not leaving this job any time soon. \n\nThe general point is. You take care of your employees when their personal life is falling apart, they will repay you when things get straightened out and will almost always be loyal. You add stress to their already heavy stress load. They will be out the door as soon as possible.",
          "depth": 0
        },
        {
          "id": "o6f2aq4",
          "author": "ladeedah1988",
          "score": 94,
          "body": "My company was always very flexible with employees in these situations.  To be honest, I would not work for your company.  When you help these people, you are sending a strong message to everyone else that the company cares.  I get your position as a manager, it is your company that is at fault.  ",
          "depth": 0
        },
        {
          "id": "o6f2985",
          "author": "dialecticallyalive",
          "score": 41,
          "body": "Your company doesn't offer short term disability? It has nothing to do with what state you're in. Your only solution is to let him go and know that you're a shitty company for not offering comprehensive benefits to your employees.\n\nEdit: another commenter made a good point that STD typically only covers the employee (I believe there are some exceptions to this, however). FMLA does cover family members, but it's typically unpaid. The company could offer additional paid leave, however.",
          "depth": 0
        },
        {
          "id": "o6f96tu",
          "author": "RemarkableMacadamia",
          "score": 22,
          "body": "If this were my team, I’d sit down with all of them and figure it the fuck out.\n\nIf this person were to be on full FMLA, what would you do? You would figure it the fuck out. \n\nCan y’all fire this guy for performance issues? Yup. But it’s a shitty thing to do for their family to lose income and insurance at this time, especially when he can probably work, just not the regular hours with time-sensitive tasks. \n\nWhat I would do is figure out what work he could do that’s not time-bound, give that work to him, and assign someone else to make calls and schedule things. \n\nI have someone out on leave now, and we had to reassign 100% of their work. You only need to reassign half. And it’s temporary. Make a plan and revisit it every quarter.\n\nI hear what y’all are saying about paying for time that he’s not working, but I think if you pull the team together, you all will figure out a way to make it work. \n\nWhat’s the work that you all never seem to get to but still needs to be done at some point? Give him that work. Make his deliverables outcome-based instead of time-based. Lay out milestones that seem appropriate instead of watching the clock. Take some of the admin work off the other folks and give him that too, so them taking extra calls and scheduling isn’t that terrible. Create a rota so each day a different person owns the call backs and it’s evenly spread. Make the tasks visible with a task board of some kind so people can see what needs doing and divide it up. \n\nThis is a terrible situation all around, but a 40-person company shouldn’t have less care for humans than my F200 behemoth. \n\nGet creative and stop ratting this guy out to HR unless your intent and goal is to have him fired.",
          "depth": 0
        },
        {
          "id": "o6f09ji",
          "author": "A-CommonMan",
          "score": 19,
          "body": "Stop tracking hours and move to a hard re-scope of deliverables. Strip the role down to the absolute \"keep the lights on\" essentials, and if they still can't hit those marks, the nights and weekends experiment has to end. It’s burning out the rest of the team who has to manage the fallout, and paying full freight for 50% output eventually triggers a fairness revolt so you need to stop this from happening. Since the spouse’s situation is already well-known, sit the team down and be transparent. Acknowledge the hardship but clarify that you are re-structuring the work specifically to protect the team from burnout while you figure out how to keep this employee under health coverage. The goal is to find the absolute minimum threshold required to maintain their benefits eligibility without letting the department collapse.",
          "depth": 0
        },
        {
          "id": "o6eyxzc",
          "author": "djmcfuzzyduck",
          "score": 20,
          "body": "I have no advice comments abs questions.\nYou cant force someone to take an LOA. It sounds like you kept them with a full workload and expected them to make it work. \nWhy wasn’t the workload lightened?\nYou know cancer treatment takes a heck of a lot longer than four months right?\nWhere’s HR in all of this?",
          "depth": 0
        },
        {
          "id": "o6f00pn",
          "author": "Dinolord05",
          "score": 13,
          "body": "Company size? Dept size? Are they the only one that can do these tasks?",
          "depth": 0
        },
        {
          "id": "o6f9dhh",
          "author": "Ornery-Wrangler-3654",
          "score": 13,
          "body": "Be prepared for a lawsuit if you fire them. Not saying they would win, but your company will look awful in your industry once word gets out that you fired an employee whose spouse had cancer and you didn't offer the most basic benefit or short-term disability that also covers spousal care.\n\nDoes the employee get the health insurance that covers their spouse with cancer through your company via their employment?",
          "depth": 0
        },
        {
          "id": "o6ezeyh",
          "author": "Real_berzilla",
          "score": 14,
          "body": "OP - if you guys really feel empathetic w the employee, you can't expect them to perform on par in a situation like this. What you should do is lower your expectations and his workload so it becomes manageable for the time being.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9e9de",
      "subreddit": "managers",
      "title": "Best candidate followed up with my boss and HR without including me",
      "author": "ImportanceMundane677",
      "score": 0,
      "upvote_ratio": 0.46,
      "comment_count": 116,
      "created_utc": 1771541758.0,
      "selftext": "I would really appreciate your perspective.\n\nWe narrowed down to 2 candidates. Both are very sharp. One of the two is very outstanding. I discussed with my boss today to make a final decision. My boss told me that the candidate sent him a thank you email and asked for an update.  The candidate emailed my boss, copied HR. However I was not copied, nor received thank you letter from the candidate.\n\nWhat would you do in this situation?\n\nThank you all in advance.\n\nEdit, I am the hiring manager. Second round interview is with my boss. HR sent interview invitation to the candidate, invited my boss and have me as optional. The follow up email sent to my boss and HR , not me.",
      "url": "https://reddit.com/r/managers/comments/1r9e9de/best_candidate_followed_up_with_my_boss_and_hr/",
      "is_self": true,
      "link_flair_text": null,
      "engagement_score": 338.71999999999997,
      "comments": [
        {
          "id": "o6brrh0",
          "author": "Ok_Error_3167",
          "score": 107,
          "body": "I wouldn't have thought about it in the moment and definitely wouldn't have thought about it AFTER the moment. I'm consistently baffled by this subreddit and learning that people who would care about this actually exist.\n\nI have a genuine question - do you ACTUALLY care about a candidate thank you email, or were you told you should care about it by some Very Important Business Magazine in 2009 and you integrated it into your worldview without a thought?",
          "depth": 0
        },
        {
          "id": "o6brjcg",
          "author": "CTFDEverybody",
          "score": 64,
          "body": "I mean are you the hiring manager?\n\nYou haven't made it clear here, so I'm wondering if you didn't make it clear to the candidates.",
          "depth": 0
        },
        {
          "id": "o6bsru2",
          "author": "Snurgisdr",
          "score": 58,
          "body": "99% he just hit “reply all” and you weren’t on whatever he replied to.",
          "depth": 0
        },
        {
          "id": "o6brnn1",
          "author": "potentialeight",
          "score": 50,
          "body": "He probably just thought that would be who he reported to. Total non-factor.",
          "depth": 0
        },
        {
          "id": "o6bsa62",
          "author": "ghostofkilgore",
          "score": 48,
          "body": "I'd throw a little hissy fit, let my bruised ego get the better of me, and try to influence everyone not to hire this candidate.\n\n/s",
          "depth": 0
        },
        {
          "id": "o6brur6",
          "author": "Toro_Timid343",
          "score": 31,
          "body": "I would do absolutely nothing. \n\nThey could have an email stuck in their outbox. Maybe they thought they emailed you and they didn’t. \n\nIf they’re an outstanding candidate you don’t want to lose them over a faux pas.",
          "depth": 0
        },
        {
          "id": "o6bted6",
          "author": "Idk_Parks",
          "score": 25,
          "body": "Oh my God. Holy ego.",
          "depth": 0
        },
        {
          "id": "o6btksc",
          "author": "Necessary-Science-47",
          "score": 20,
          "body": "Sometimes I think managers are just people too, then this subreddit reminds me that they really are as bad as they seem",
          "depth": 0
        },
        {
          "id": "o6brwcj",
          "author": "[deleted]",
          "score": 19,
          "body": "[deleted]",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9vhtt",
      "subreddit": "managers",
      "title": "Direct report called me dumb and told me I was a personality hire.",
      "author": "wannabecomedianguy",
      "score": 202,
      "upvote_ratio": 0.87,
      "comment_count": 112,
      "created_utc": 1771594467.0,
      "selftext": "Dramatic title because I'm still in my feels about it, but I had a weird conversation with my direct report during our 1-1 and I don't know how to feel about it. \n\nFor some context, I'm a newly hired (Early Jan.) technical manager at an engineering company. The interview process was with my now boss (Director of engineering) and his colleague (Chief engineer, not a manager, no reports). Also important to note that the chief engineer once had my job some years back and is generally a very smart guy so the team really respects him.\n\nNow unto the conversation: During our 1-1 my report and I are talking about work and who we enjoy working with, and it went something like this:\n\nMe (jokingly): \"Oh yeah I'm not as smart as chief engineer but...\"\n\nReport (before I finished my sentence): oh yeah I know\n\nMe: Wait, what do you mean you know?\n\nReport: Well, he had warned us\n\nMe: What do you mean?\n\nReport: Chief engineer had warned us that you weren't the smartest applicant, but we'd get along\n\nMe: \\*No reply\\*\n\nReport: He also said that you were a good communicator and were good at saying you didn't know when you didn't know something\n\nMe (awkwardly): Ah ok didn't know he said that\n\nReport: Yeah he said the same to me during my interview process, I wasn't the smartest applicant but I was able to say that I didn't know something if I didn't\n\n  \nI feel like an important detail is the my direct report is ESL and also very honest. I do think when he says \"Smart\" he is referring more to \"knowledgable\" but it still made me very uncomfortable that that was said about me to a team I'M SUPPOSED TO LEAD before I even start the job. Agh I guess I just wanted to rant/tell people who might be able to relate but if you have any advice that'd be appreciated too. ",
      "url": "https://reddit.com/r/managers/comments/1r9vhtt/direct_report_called_me_dumb_and_told_me_i_was_a/",
      "is_self": true,
      "link_flair_text": null,
      "engagement_score": 321.598,
      "comments": [
        {
          "id": "o6f5iwf",
          "author": "GiftFromGlob",
          "score": 897,
          "body": "Sounds like an ordinary bunch of autistic engineers to me. Enjoy the honesty while you can friend, and don't take it too seriously.",
          "depth": 0
        },
        {
          "id": "o6f59hq",
          "author": "ComfortableJacket429",
          "score": 233,
          "body": "Where did your direct report say you were a personality hire? Smart people who you can’t work with are useless to a business. It’s better to hire people who are coachable and are good communicators.",
          "depth": 0
        },
        {
          "id": "o6f57ff",
          "author": "Smokedealers84",
          "score": 57,
          "body": "I'm gonna play devil advocate just for the sake of perspective this report doesn't seems to understand social queue maybe the chief engineer try to explain that you wouldn't be as technical as the report for the technical side of the work and interpreted that as you are dumb.",
          "depth": 0
        },
        {
          "id": "o6f54o7",
          "author": "Fart_6969",
          "score": 55,
          "body": "I'll be the first to admit I'm not the best at my job, but I get along with everybody and know how to figure things out\n\nI think the higher ups understand what it takes to assemble a functional company / team and wouldn't be too upset about it, especially after the ESL clarification",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9b6ij",
      "subreddit": "experienceddevs",
      "title": "A few weeks ago me and my manager discussed promotion, recently I was let go as I was handing in my notice",
      "author": "Dinos_12345",
      "score": 253,
      "upvote_ratio": 0.88,
      "comment_count": 94,
      "created_utc": 1771534659.0,
      "selftext": "Basically, title.\n\nI was at this company for almost two years. This company sponsored my Visa so I needed the employment to keep going otherwise I had to leave. Because of that, I let my manager know that if she noticed any hint of a drop in my performance, I would like to know so there was absolutely no chance of me getting fired.\n\nA bit of background for my manager and myself. She gave me a bad performance review last time round(it was totally fair, I wasn't performing due to health reasons and being very down mentally) and then she gave me goals to complete. I crushed all the goals, she said that I was doing a great job and that it was a night and day difference in how I was performing. \n\nTwo weeks ago we had a 1:1 and I asked her about her expectations for a promotion and she was guiding me on how to frame my performance review to be more likely to get it.\n\nToday, I was let go. As it happens I was about to hand in my notice and it worked out perfectly. \n\nThe reason I received was that I didn't have as many PRs as the next person, I'm the lowest in that regard and in points completed. We have a minimum rate of 1 point per ticket so people can just spam 1 pointer tickets that take no time so their points are inflated while mine are mostly bigger tickets where 3 points require work. I also got let go for behavior reasons yet she didn't provide a single concrete example.\n\nThe HR guy was sympathetic and he said that my manager dropped the ball and that I should have had chances to catch this. They're at least paying the full notice period and as it happens, my pay ends one day before I start the new job, so I have a few months of paid holiday!\n\nIf I didn't have the next job lined up I would be completely screwed. Word around the office is that the company is cutting headcount and I think this was a case of \"if you beat the data hard enough, it'll tell you what you want to hear\". \n\nThoughts? \n\nThis isn't in the US btw.",
      "url": "https://reddit.com/r/ExperiencedDevs/comments/1r9b6ij/a_few_weeks_ago_me_and_my_manager_discussed/",
      "is_self": true,
      "link_flair_text": "Career/Workplace",
      "engagement_score": 295.568,
      "comments": [
        {
          "id": "o6b4wcv",
          "author": "Sheldor5",
          "score": 772,
          "body": "they are measuring performance by counting PRs\n\n\ncomplete degenerates",
          "depth": 0
        },
        {
          "id": "o6b4sgd",
          "author": "macoafi",
          "score": 215,
          "body": "&gt; This isn't in the US btw.\n\nYeah, we know, because you said:\n\n&gt; They're at least paying the full notice period and as it happens, my pay ends one day before I start the new job, so I have a few months of paid holiday!\n\nAnd nobody in the US would've been giving _a few months_ of notice period.",
          "depth": 0
        },
        {
          "id": "o6b52su",
          "author": "propostor",
          "score": 199,
          "body": "\"Not enough PRs\" is an absolutely fucking ridiculous metric.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9iyob",
      "subreddit": "experienceddevs",
      "title": "After 20 years in banking tech, here's what actually worked when I wanted to change a broken process. It wasn't being right. It was being strategic.",
      "author": "agileliecom",
      "score": 201,
      "upvote_ratio": 0.78,
      "comment_count": 68,
      "created_utc": 1771553938.0,
      "selftext": "I've been writing about the Agile certification industry and what actually ships software, and the most common response I get isn't disagreement. It's some version of \"I agree with all of this but I can't say any of it at work. I need this job.\"\n\nFigured I'd write about that part because it's actually the hardest part. Seeing the dysfunction is easy. Changing it without torching your career is the real skill.\n\nI once nearly got put on a performance plan for suggesting we cut a meeting that everyone on the team privately agreed was useless. The problem wasn't that I was wrong. The problem was I said it in a retro with the person who created the meeting sitting right there. That was a lesson I only needed to learn once.\n\nThe thing that actually works is boring. You measure before you say anything. I spent two sprints tracking every meeting. Duration, number of attendees, decisions made. Put it in a spreadsheet. No opinions, no editorializing, just hours and outcomes. Then I showed it to my manager. Same guy who shut me down three months earlier when I told him sprint planning was theater. He looked at the spreadsheet and said \"huh, we should probably fix this.\" Same message. The spreadsheet didn't threaten his authority. My opinion did.\n\nThe other thing is you never bring it up cold in a group setting. You find one person who agrees with you first. Everyone knows who that person is. It's whoever checks slack during sprint review. You show them the data privately. Now it's two people with a spreadsheet instead of one person with a complaint. At one company I spent three weeks having quiet conversations with senior engineers before I raised anything formally. By the time I brought it up in a team lead meeting, four people in the room already agreed. The conversation wasn't \"Greg thinks standups are broken.\" It was \"several of us have been looking at the data.\" Completely different dynamic.\n\nThe framing matters too. \"Let's eliminate daily standups\" triggers every immune response the org has. \"What if we tried async updates for two sprints and measured deployment frequency before and after\" triggers almost nothing. It's temporary. It's measurable. Nobody has to admit they were wrong. I've used this exact approach to kill sprint planning at one shop, cut standups to twice a week at another, and replace retros with monthly health surveys at a third. The experiment always \"worked\" well enough that nobody wanted to go back. But the entry point was never \"this is broken.\" It was always \"let's try something for two weeks.\"\n\nAnd you have to translate. Engineers talk about efficiency. Your manager cares about delivery risk. The VP cares about cost. \"We spend 22 hours per sprint in meetings\" works on your peers. \"Deploy frequency dropped 30% since we added the third weekly sync\" works on your manager. \"Roughly $280,000 in annual salary going to ceremonies\" works on the executive. Same problem. Three different languages. Most engineers speak engineer to everyone and then wonder why nothing changes.\n\nOne more thing that took me years to learn. If you've tried everything, the data, the allies, the experiments, the right language, and the answer is still no, that's information about the company, not about you. At that point you either accept it or start looking. Both are fine. What isn't fine is staying and resenting it for three years while your work suffers. I've been that person too and it's not worth it.\n\nCurious if others have navigated this. Especially interested in what worked at larger companies where the process has more institutional momentum behind it.",
      "url": "https://reddit.com/r/ExperiencedDevs/comments/1r9iyob/after_20_years_in_banking_tech_heres_what/",
      "is_self": true,
      "link_flair_text": "Career/Workplace",
      "engagement_score": 239.48600000000002,
      "comments": [
        {
          "id": "o6cs4ig",
          "author": "bland3rs",
          "score": 134,
          "body": "Well you’re not wrong. There’s a lot of unspoken rules.\n\n- Don’t make others look bad, especially in public.\n- Never make people feel like you went around them, unless that’s your goal.\n- Change is hard to stomach and people try to change things all the time and end up making it worse, so your changes need to be watertight.\n- What you personally care about is often not what other people care about, but you can tweak solutions so they matter to both of you.\n- Culture fit is real. It’s not about being hip — it’s about working with people who also like to work in similar ways. You should be able to work with anyone but if you can choose, work with people who you like working with.",
          "depth": 0
        },
        {
          "id": "o6din72",
          "author": "Ok-Entertainer-1414",
          "score": 48,
          "body": "AI;DR",
          "depth": 0
        },
        {
          "id": "o6csb1v",
          "author": "BoBoBearDev",
          "score": 42,
          "body": "My simple rules\n\n\n1) kiss ass\n\n2) let it burn (fail fast) \n\n3) save it and claim credit",
          "depth": 0
        },
        {
          "id": "o6dkdyw",
          "author": "Its_me_Snitches",
          "score": 24,
          "body": "AI",
          "depth": 0
        },
        {
          "id": "o6csw1t",
          "author": "nein_va",
          "score": 15,
          "body": "Damn, you really hate stand-up and sprint planning. I wish those were the hardest part of my week",
          "depth": 0
        },
        {
          "id": "o6cu47e",
          "author": "Kolt56",
          "score": 14,
          "body": "10/10 survival guide.\nAlso a great description of water fall pretending to be Agile.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9zc08",
      "subreddit": "cscareerquestions",
      "title": "How are people surviving in this market? Have you pivoted?",
      "author": "Romano16",
      "score": 76,
      "upvote_ratio": 0.88,
      "comment_count": 78,
      "created_utc": 1771603474.0,
      "selftext": "I see a lot of new grads with two or three internships still struggling for entry level. Even if they ace the interview the result after 4+ rounds is “They just wanted someone with more experience on their stack.”\n\nHonestly, with hundreds of applications &amp; multiple rounds of interviews and still not landing a role, are people just staying unemployed or are they casting a large net to do other roles besides strictly SWE?",
      "url": "https://reddit.com/r/cscareerquestions/comments/1r9zc08/how_are_people_surviving_in_this_market_have_you/",
      "is_self": true,
      "link_flair_text": "New Grad",
      "engagement_score": 200.25600000000003,
      "comments": [
        {
          "id": "o6fztxr",
          "author": "dailydotdev",
          "score": 99,
          "body": "honest answer from the hiring side - yeah, the market is rough right now but it's not hopeless.\n\n\n\nwhat i'm seeing work for people who actually land roles:\n\n\n\n1. \\*\\*stop applying to the same 50 companies everyone else is.\\*\\* the big names get 2000+ apps per opening. mid-size companies (50-500 employees) are where the real opportunities are. they're growing, they actually need people, and you're not competing with 2000 other applicants.\n\n\n\n2. \\*\\*adjacent roles are underrated.\\*\\* i've seen new grads get into devops, QA automation, data engineering, or even solutions engineering and then lateral into SWE within a year. once you're inside a company it's 10x easier to move around.\n\n\n\n3. \\*\\*the \"more experience on their stack\" rejection is usually code for something else.\\*\\* either they already had an internal candidate, the role got frozen, or your interview answers were good but not differentiated enough. don't take that feedback at face value.\n\n\n\n4. \\*\\*build something small but real.\\*\\* not another todo app. contribute to an open source project, build a tool that solves an actual problem you have, or ship something with real users. hiring managers notice this way more than another bootcamp project.\n\n\n\nthe people i know who pivoted successfully treated job searching like a job itself - 4-6 hours daily of targeted outreach, not spray-and-pray applications. quality over quantity always wins.",
          "depth": 0
        },
        {
          "id": "o6gi47d",
          "author": "Happiest-Soul",
          "score": 41,
          "body": "I pivoted to the grocery store. ",
          "depth": 0
        },
        {
          "id": "o6g2d1o",
          "author": "Primary-Walrus-5623",
          "score": 18,
          "body": "Anyone truly pivot-ing is, well I'm struggling to come up with a term that wouldn't get my comment removed, but its not a smart move. Take a crappy job, don't put it on your resume and keep applying. Employment is like dating, it only takes one person to love you. There's also a million small companies that need SEs. Your first job doesn't have to be a top 50 company.",
          "depth": 0
        },
        {
          "id": "o6gbdre",
          "author": "Verrtigoo",
          "score": 14,
          "body": "Its bad out here. I had 5 YOE as a FullStack and it took me a year to find a new job with over 1000 applications.\n\nI gave up for a while. Then, I signed up for Upwork,  same day I found someone looking for bug fixes, and after a week they liked my work to the point they hired me full time.\n\nIve been working as an electrician up until then just trying to make ends meet.",
          "depth": 0
        },
        {
          "id": "o6g1h6u",
          "author": "Sparaucchio",
          "score": 10,
          "body": "From learn to code to learn to plumb",
          "depth": 0
        },
        {
          "id": "o6ge328",
          "author": "suujaon",
          "score": 10,
          "body": "My company doesn’t do layoffs for engineering department. Hasn’t done so in almost 30years. Still staying on my toes though just in case.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9fmku",
      "subreddit": "experienceddevs",
      "title": "Techniques for auditing generated code.",
      "author": "greensodacan",
      "score": 4,
      "upvote_ratio": 0.55,
      "comment_count": 67,
      "created_utc": 1771545136.0,
      "selftext": "Aside from static analysis tools, has anyone found any reliable techniques for reviewing generated code in a timely fashion?\n\nI've been having the LLM generate a short questionnaire that forces me to trace the flow of data through a given feature.  I then ask it to grade me for accuracy.  It works, by the end I know the codebase well enough to explain it pretty confidently.  The review process can take a few hours though, even if I don't find any major issues.  (I'm also spending a lot of time in the planning phase.)\n\nJust wondering if anyone's got a better method that they feel is trustworthy in a professional scenario.",
      "url": "https://reddit.com/r/ExperiencedDevs/comments/1r9fmku/techniques_for_auditing_generated_code/",
      "is_self": true,
      "link_flair_text": "Technical question",
      "engagement_score": 196.03999999999996,
      "comments": [
        {
          "id": "o6c1grs",
          "author": "SoulCycle_",
          "score": 45,
          "body": "I literally just read the code and when i get to something i dont understand i say “why the fuck did u do this” and repeat until i understand everything",
          "depth": 0
        },
        {
          "id": "o6c4zz5",
          "author": "Particular_Camel_631",
          "score": 40,
          "body": "You are responsible for the quality of the code. Not the Ilm. \n\nIf there is stuff in there that you don’t understand, what chance does the poor sod trying to fix a bug in it later have?\n\nYour approach is ok. It’s what senior devs have had to do with juniors for years.",
          "depth": 0
        },
        {
          "id": "o6c1ma4",
          "author": "ironykarl",
          "score": 33,
          "body": "Is this faster for you than just writing the code? ",
          "depth": 0
        },
        {
          "id": "o6c7c6p",
          "author": "DeterminedQuokka",
          "score": 7,
          "body": "I generate less than 500 lines of code then I review it the same way I review human code. I look at every file and mark the file as viewed if it’s correct. \n\nIf I don’t know what I’m writing I don’t review the code I make something quick figure out the goal then I do it again with direction. \n\nThere was this thing pre ai that you should always know what your next commit is. If you don’t you mess around until you figure it out then you hard reset and work to that commit. I still do that with ai",
          "depth": 0
        },
        {
          "id": "o6chsjn",
          "author": "Tiarnacru",
          "score": 3,
          "body": "Using generated code in smaller chunks. Treat it with the same \"single responsibility\" rule you would anything else. You should understand everything it's doing at that point without needing to review it.\n\nThough generally I think using generated code for anything but boiler plate code isn't worth the tradeoffs.",
          "depth": 0
        },
        {
          "id": "o6c1061",
          "author": "Ok-Physics6840",
          "score": 2,
          "body": "solid approach",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9f904",
      "subreddit": "cscareerquestions",
      "title": "Mid-senior software engineer getting 0 traction",
      "author": "These_Commission4162",
      "score": 48,
      "upvote_ratio": 0.79,
      "comment_count": 73,
      "created_utc": 1771544156.0,
      "selftext": "Was laid off recently because of politics in the company, not performance related, was fired straight after my EOY holidays before which I got a positive performance review, increased salary and a bonus.\n\nBeen a month and I've sent hundreds of applications and only got 2 interviews, one rejected after the second interview and the second one only had an interview with the recruiter.\n\nBasically I'm getting nowhere, 1 month and 1 week of applying, nothing, I don't know if its my resume, market is trash or I'm just incompetent af, but I see my peers starting jobs all the time, I have 5 years of commercial experience, Its started to get to me, the bills, mortgage, my son etc. If someone is willing to review my resume please let me know and I'll send it to them, other than that, anyone has any advice?\n\n  \n[IMGUR RESUME LINK](https://imgur.com/a/7Dycfue)",
      "url": "https://reddit.com/r/cscareerquestions/comments/1r9f904/midsenior_software_engineer_getting_0_traction/",
      "is_self": true,
      "link_flair_text": "Experienced",
      "engagement_score": 194.084,
      "comments": [
        {
          "id": "o6c6f7n",
          "author": "the_pwnererXx",
          "score": 103,
          "body": "No cs degree and this is one of the ugliest resumes I have ever seen. Just use a standard template and put it on 1 page pls",
          "depth": 0
        },
        {
          "id": "o6cq8ij",
          "author": "SmokeyJoe2",
          "score": 81,
          "body": "Your resume doesn't show \"5 years of commercial experience\", as your career started 3.5 years ago. Concurrent jobs don't determine years of experience, the calendar does.",
          "depth": 0
        },
        {
          "id": "o6cq5y9",
          "author": "Valuable_Agent2905",
          "score": 44,
          "body": "Frontend is dead. AI agents can take care of a significant amount of frontend work and many companies have started to just have 1-2 experienced devs + LLM agents as frontend teams. Hiring for frontend is down probably 50-60% compared to what it was 3-4 years ago",
          "depth": 0
        },
        {
          "id": "o6d40ws",
          "author": "TheFirstMinister",
          "score": 42,
          "body": "Front end is saturated.\n\n\nThe resume is awful in terms of length, format and content. It's just a list of things utterly devoid of business context, technical context, progression and accomplishments. There's no narrative here and nothing compelling. \n\n\nAnd if you think I'm being harsh, you'd be right. But the labor market is a cruel mistress who doesn't care about feelings. Trust me - the hiring managers and recruiters you're seeking to impress have the exact same opinion. \n\n\nBack to the drawing board with this one. ",
          "depth": 0
        },
        {
          "id": "o6cd5bl",
          "author": "ggprog",
          "score": 32,
          "body": "Front end is the most over saturated sub in the field.  Unless youre an absolute front end wizard (e.g airbnb level), front end engineers are a dime a dozen in this market. I say this as somebody who was also front end specialized up until 3 years ago. Its also the easiest to be performed by gen ai",
          "depth": 0
        },
        {
          "id": "o6cog82",
          "author": "Whole-Reserve-4773",
          "score": 20,
          "body": "Your resume has no progression on it. Also your roles are very short, why haven’t you done 2 years at a place?",
          "depth": 0
        },
        {
          "id": "o6cdni1",
          "author": "joshdotmn",
          "score": 13,
          "body": "Hundreds of applications and 2 interviews isn't a *you* problem. It's a resume problem. If you were getting interviews and bombing them, that's an entirely different reddit post. But that conversion rate means your resume isn't getting past the first screen. Which is actually the most fixable thing here. \n\nYour resume's job is to get you that first call. It's not meant to get you anything else. \n\nYour work doesn't speak for itself on paper any more than it does in person. Your work is summarized in a commit. It doesn't have a megaphone. \n\nIf your resume reads like a list of responsibilities instead of specific *outcomes*, you're invisible. Get it reviewed by someone who actually hires for roles like yours, not a friend who'll say \"looks good.\"\n\nThe peers thing—you're comparing your insides to their outsides. You don't know how many apps they sent. Nobody posts \"I applied to 400 places and took a mediocre offer because my mortgage was due.\" Stop watching. It's not data, it's poison, dude.\n\nAnd a month in this market with 5 YOE isn't a signal you're incompetent. It's a signal the market is rough and your resume needs work. Fix the resume, send fewer but better-targeted applications, and stop the spiral. The spiral leaks into interviews. People can feel it.\n\nThe person reviewing your resume needs to put it into the \"wow, this person is interesting\" column more than it does the \"ok this person meets our buzzwords.\"\n\nWith that, go be weird on your resume.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9j50x",
      "subreddit": "experienceddevs",
      "title": "How do I Navigate Technical Leaders who are clueless about AI and think it's the solution to everything?",
      "author": "Fun_Highway_8733",
      "score": 78,
      "upvote_ratio": 0.87,
      "comment_count": 71,
      "created_utc": 1771554407.0,
      "selftext": "At my job I've been going out of my way to explain programming language concepts to less senior engineers (I'm a senior SWE here) as I have the most experience in this programming language. \n\n  \nMy boss (20 yoe) pulled me aside and told me that while he appreciates me trying to ramp up the engineers on writing idiomatic xyz language he wants me to find something else to do since programming languages don't matter anymore because AI can do everything. \n\n  \nHow tf do I navigate this? ",
      "url": "https://reddit.com/r/ExperiencedDevs/comments/1r9j50x/how_do_i_navigate_technical_leaders_who_are/",
      "is_self": true,
      "link_flair_text": "Career/Workplace",
      "engagement_score": 186.902,
      "comments": [
        {
          "id": "o6cquh3",
          "author": "ManufacturerSad2610",
          "score": 84,
          "body": "This is wild man your boss basically telling you that foundational skills dont matter because ChatGPT exists. I'd probably start documenting these conversations and maybe look for opportunities elsewhere because leadership that dismisses core engineering principles for AI magic is gonna make some seriously questionable decisions down the road",
          "depth": 0
        },
        {
          "id": "o6crifl",
          "author": "patient-palanquin",
          "score": 21,
          "body": "You do brutal reviews of their code and document all the ways that it's costing the business time and money (e.g. bugs, bad arch decisions, etc).",
          "depth": 0
        },
        {
          "id": "o6d39e4",
          "author": "CaptainCactus124",
          "score": 20,
          "body": "The comments in here suck. You handle this by looking for a different job",
          "depth": 0
        },
        {
          "id": "o6cuhqb",
          "author": "systemsandstories",
          "score": 11,
          "body": "id probably reframe it around outcomes instead of language, like show where ai output still creates review or maintenance overhead because fundamentals were shaky. if you can tie the language work to fewer production issues or cleaner diffs, its harder to dismisss as “just syntax.”",
          "depth": 0
        },
        {
          "id": "o6ct64x",
          "author": "Excellent_Panic_Two",
          "score": 9,
          "body": "Feel like we're only seeing half the story.\n\nWhat are the other specific things he thinks you should do? Without that we can't really help you judge which of you is in the wrong. \n\nMaybe your boss thinks that you were not employed to be a tutor and that other tasks are falling behind, but you've focused in on the AI comment and let it blind you from the actual discussion you need to have",
          "depth": 0
        },
        {
          "id": "o6dtaqj",
          "author": "tms10000",
          "score": 7,
          "body": "If \"AI\" is replacing my highly technical skills, imagine what it can do to you, Mr Boss with an MBA. You're basically a spreadsheet maintainer, TPS report spewing machine. Sometimes there's a Gantt chart in there. You can be replaced by AI about 100 times easier than I can. And yet, you think \"AI\" is only good for writing software?",
          "depth": 0
        }
      ]
    },
    {
      "id": "1ra1kl6",
      "subreddit": "managers",
      "title": "Let’s do some Friday wins",
      "author": "Shoddy-Outcome3868",
      "score": 223,
      "upvote_ratio": 0.92,
      "comment_count": 40,
      "created_utc": 1771608304.0,
      "selftext": "In a meeting today with a bunch of senior leaders, this little snitch! snitch! said to me in front of this group of 30+, “I know you’ve been busy and haven’t been able to update this spreadsheet so when you get a chance, that would be great.” So I immediately pulled it up, shared my screen and asked them to point out which areas needed to be updated because I updated frequently. She just said, “Oh, I guess I haven’t looked at it in awhile.” Not today Satan!",
      "url": "https://reddit.com/r/managers/comments/1ra1kl6/lets_do_some_friday_wins/",
      "is_self": true,
      "link_flair_text": null,
      "engagement_score": 158.652,
      "comments": [
        {
          "id": "o6ggruu",
          "author": "SopwithTurtle",
          "score": 71,
          "body": "&gt;this little snatch\n\nOh boy.\n\nEDIT: OP meant \"snitch\" - let's be chill, mistakes happen.",
          "depth": 0
        },
        {
          "id": "o6gfzn4",
          "author": "aldwinligaya",
          "score": 64,
          "body": "Reverse uno card. Great job!",
          "depth": 0
        },
        {
          "id": "o6gjobm",
          "author": "66NickS",
          "score": 27,
          "body": "My VP spent idk how long trying to outline the stages and tasks within the stages for new accounts without consulting me (leader of the team and SME). When they finally shared it with me I just asked if there was something wrong with the document I had created 2 years prior. 🤦🏻‍♂️",
          "depth": 0
        },
        {
          "id": "o6gjtho",
          "author": "dangerous_dude",
          "score": 13,
          "body": "I'm a new manager (4 months in) with one direct report, a win was delegating an ongoing project interfacing with multiple departments to him which I had been taking on. I've been slammed with work and this is the perfect project for someone with his experience as it will refine his skills and is a good learning opportunity, this will also help him transition into his next role we see him fulfilling in the future. He also has enough time in his schedule to handle this. I just have to keep on him about the quality of the work without micromanaging. Before he had been reporting to our director as my position and my boss's position were vacant, so it's been a transition to bring him more under me.\n\nIt's a little win, I'm still getting used to delegating. I still have a lot to learn.",
          "depth": 0
        },
        {
          "id": "o6gsn5d",
          "author": "anuncommontruth",
          "score": 10,
          "body": "I took a promotion in January that meant I no longer have direct reports. One of my last acts as a line manager was an attempt to get one of my best people promoted. \n\nIt was a brutal battle with recruitment but she called me this morning telling me it finally got approved. Even though I no longer have direct reports I still care about my people and am extremely proud this happened. Especially in this job market.",
          "depth": 0
        },
        {
          "id": "o6glf5i",
          "author": "azure275",
          "score": 7,
          "body": "My team (manufacturing company for devices in the US) can now get raises because we're getting a bunch of tariff refunds soon most likely.\n\nOur profit margin was down about 20% last year due to tariffs so we were kind of strung out previously.",
          "depth": 0
        },
        {
          "id": "o6gp854",
          "author": "Greedy_Investigator7",
          "score": 6,
          "body": "Been managing two teams (1 as cover) for 18 months. Finally got shot of the cover and already feeling the peace of a less chaotic inbox and fewer requests from senior management.\nI have managed to not work for 2 Saturdays in a row!",
          "depth": 0
        },
        {
          "id": "o6gpoi1",
          "author": "Agreeable-Apricot-75",
          "score": 5,
          "body": "Wow this post is very misogynistic. Calling a woman a “snatch”, especially a woman who is a professional colleague, is absolutely unacceptable.\n\nEDIT OP MEANT SNITCH!! yall still shouldn’t be defending sexist language in the workplace though.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9ya6s",
      "subreddit": "experienceddevs",
      "title": "Is AI adoption more aggressively pushed at startups or large tech companies?",
      "author": "Calm-Bar-9644",
      "score": 19,
      "upvote_ratio": 0.88,
      "comment_count": 48,
      "created_utc": 1771601158.0,
      "selftext": "￼ I’m currently at a mid-sized tech company, but I have friends at both startups and large tech companies. From what I’ve seen, startups seem to be pushing much harder to integrate AI, whether that’s in the development pipeline or directly into the product feature set.\n\nAt my company, the shift has felt almost overnight. The hype went from zero to 100, and now there’s a strong push to prioritize AI across the board. It’s honestly a bit surreal, and I’m trying to understand whether this is typical across the industry or more specific to certain company sizes.",
      "url": "https://reddit.com/r/ExperiencedDevs/comments/1r9ya6s/is_ai_adoption_more_aggressively_pushed_at/",
      "is_self": true,
      "link_flair_text": "Career/Workplace",
      "engagement_score": 113.90400000000001,
      "comments": [
        {
          "id": "o6fq5qx",
          "author": "chain_letter",
          "score": 64,
          "body": "i assume the typical startup founded in the last 18 months would be very oriented around slopping it up",
          "depth": 0
        },
        {
          "id": "o6fqtqf",
          "author": "znick5",
          "score": 23,
          "body": "It is being pushed aggressively at every software company on the planet. The field is fundamentaly changing. If you are against AI, I would think the only safe places would be some aerospace and medical niches where there are strict change controls, audits, etc.",
          "depth": 0
        },
        {
          "id": "o6fq6g2",
          "author": "guardian87",
          "score": 19,
          "body": "I don’t think there is a generic answer.",
          "depth": 0
        },
        {
          "id": "o6fsbb7",
          "author": "mq2thez",
          "score": 7,
          "body": "Companies that are doing well aren’t as anxious to “do more with less”. Companies that aren’t doing well will do anything to bridge that gap, hence… the more pressure there is to use AI, the higher the likelihood that things are going poorly.",
          "depth": 0
        },
        {
          "id": "o6ft2s9",
          "author": "kayakyakr",
          "score": 8,
          "body": "Mandates are at the big companies. Startups are more likely to be experimental, trying out pure vibe, new tools, or semi-autonomous agents.\n\nA lot of startups are funded right now because they're bringing AI to \\_\\_\\_\\_. So AI in the product is ubiquitous at a startup.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9y50n",
      "subreddit": "managers",
      "title": "Difference between delegating and getting ICs to do your work",
      "author": "akima",
      "score": 16,
      "upvote_ratio": 0.86,
      "comment_count": 47,
      "created_utc": 1771600833.0,
      "selftext": "Please someone with managerial experience explain to me how you handle delegating tasks vs making your team do your job. Where do you draw the line?\n\nMy new-ish manager (been with us over a year) has absolutely no boundaries and is constantly asking me to do things that I consider his job. I'm at the point where I'm about to quit this job because of him even though I've been here over 10 years. \n\nFor clarity, my job is customer support for a SaaS product. My primary responsibility is helping customers use the product and work through any challenges. I'm not a supervisor or team lead or anything like that. \n\n\nHere are three examples of things he asks of me just today that I consider to be his responsibility:\n\n- someone on another team that was in touch with one of our customers made a mistake and my manager wants me to contact this person's manager to talk about the mistake and figure out a process for when people make mistakes. \n\n- a new team member in our team doesn't have all the access to all the tools that they need, manager wants me to work with IT and this team member to figure out their access. \n\n- someone from another team wants to join our team, manager wants me to figure out if that team will have enough coverage should that guy join us \n\n\nI could type a novel of all the things he asks. My blood is boiling so I would like some clarity on what you consider delegating. ",
      "url": "https://reddit.com/r/managers/comments/1r9y50n/difference_between_delegating_and_getting_ics_to/",
      "is_self": true,
      "link_flair_text": "Not a Manager",
      "engagement_score": 112.632,
      "comments": [
        {
          "id": "o6ftanh",
          "author": "RoyaleWCheese_OK",
          "score": 43,
          "body": "Have you ever considered sometimes a manager delegates \"manager type\" tasks to prepare people for the move into managing? \n\nSounds like you are in no way ready for that and more happy to stick to doing your job and just that. If i get pushback like you are displaying then that's an automatic no for development into anything more senior.",
          "depth": 0
        },
        {
          "id": "o6fq37q",
          "author": "hybridoctopus",
          "score": 7,
          "body": "I will delegate just about anything outside the hiring/ firing, as long as the employee has capacity   I’m overworked and I want to push and develop my employees. \n\nIt sounds like you might have a different situation. I’ve seen the managers that don’t do anything while their staff are working late and stressing out.\n\nWhich of these is it, you approach these differently.",
          "depth": 0
        },
        {
          "id": "o6fq3f5",
          "author": "dingaling12345",
          "score": 8,
          "body": "Number 1 and 2 would be something I’d delegate. Number 3 I would handle personally as a manager because it requires a manager to manager discussion.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9h3ju",
      "subreddit": "cscareerquestions",
      "title": "Big tech -&gt; Startup: worth it?",
      "author": "burnoutstory",
      "score": 55,
      "upvote_ratio": 0.91,
      "comment_count": 41,
      "created_utc": 1771548894.0,
      "selftext": "I’m in big tech now but my 4 year cliff is up and refreshers weren’t good. Although I didn’t get hit with layoffs, my guess is the heat will be turned up. \n\nI’m looking at start ups because being closer to the mission seems appealing. My only concern is work hours. I know every start up will be different, but the general theme seems to be more pressure and more hours. \n\n2 questions for anyone why has made the jump from big tech to startups: why did you do it? And was it worth it? ",
      "url": "https://reddit.com/r/cscareerquestions/comments/1r9h3ju/big_tech_startup_worth_it/",
      "is_self": true,
      "link_flair_text": null,
      "engagement_score": 107.36499999999998,
      "comments": [
        {
          "id": "o6cfnow",
          "author": "lhorie",
          "score": 45,
          "body": "Work hours is only one concern. Assuming you mean earlier stages startups, you're not going to see equity liquidity any time soon (we're talking like in the next 8+ years, or often never at all). Late stage startups are not really that different from public big techs, but again with the caveat that liquidity events may not be available quite as readily, or at all.\n\nI see a bunch of people boomerang back to big techs from startups. If you're in for the money and you're able to land big tech roles, being an startup employee is generally not the way to go.",
          "depth": 0
        },
        {
          "id": "o6cc21n",
          "author": "Least_Kaleidoscope38",
          "score": 37,
          "body": "No",
          "depth": 0
        },
        {
          "id": "o6ccyqr",
          "author": "jesusonoro",
          "score": 26,
          "body": "depends on the startup stage. early-stage = higher risk but you actually build stuff. late-stage startup = basically big tech with worse benefits. the \"mission\" thing is marketing half the time.",
          "depth": 0
        },
        {
          "id": "o6cgpra",
          "author": "DJL_techylabcapt",
          "score": 6,
          "body": "I made the jump for ownership and impact, and while the hours were heavier, it was worth it because I grew faster and felt closer to the mission—but only you can decide if that tradeoff fits your season of life.",
          "depth": 0
        },
        {
          "id": "o6cdriw",
          "author": "DumbCSBoy",
          "score": 6,
          "body": "I’m a new grad currently work for a small startup after 6 months at a unicorn and past internship experience at a FAANG, and personally I’d rather shit on my hands and clap than go back to the FAANG (not Zon btw). The pace at which I’m getting shit done hereis unparalleled and I’m confident I learned more in the past 9 months than I would’ve in 2 years at the FAANG. The people I work with are also beyond brilliant: ex OpenAI, Anthropic, FAANG+, and even a quant from IMC. \n\nWith that said, the tradeoffs are real, let’s not sugarcoat it. Hours are long and brutal sometimes. Pay can be decent to good depending on the place but RSU is probably as valuable as your toilet paper. Documentation is messy as hell. You’re inventing stuff daily to solve problems you didn’t think was possible to exist. And yeah perks and benefits are obviously not comparable to big tech. \n\nUltimately it’s a matter of preference. Though please do find a good startup to work with because for every well-funded startup with top talent and a serious mission there are 100 troll ones created by dropouts who don’t understand the fundamentals of business or coding.",
          "depth": 0
        },
        {
          "id": "o6cmpjy",
          "author": "Otherwise-Tree-7654",
          "score": 4,
          "body": "Worked for a behemoth for ~14y being now part of a much smaller company/agentic product  you will do everything and i mean it, (i am not that young so it takes a toll on me buck me its much more demanding than the big corp)",
          "depth": 0
        },
        {
          "id": "o6d2jo9",
          "author": "ecethrowaway01",
          "score": 4,
          "body": "Realistically it'll be more work for less money, so you have to figure out why you really want to work at a given startup",
          "depth": 0
        },
        {
          "id": "o6ccgu3",
          "author": "ClearAbroad2965",
          "score": 3,
          "body": "It’s a gamble unfortunately due to my hubris I missed out on one opportunity if you are getting a fair amount of stock options and you can have them vest quickly the rewards can be life changing in missed out on an ipo at $1 split I think 8 times went to over a $100",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9mv1y",
      "subreddit": "managers",
      "title": "Messed up my relationship with my Manager",
      "author": "Professional_Smoke20",
      "score": 1,
      "upvote_ratio": 0.52,
      "comment_count": 35,
      "created_utc": 1771565348.0,
      "selftext": "I work at big tech. Had a really great relationship with my manager (Female). However, I ended up messing up that relationship because of a small mistake by saying something I shouldn’t have in a team meeting with the leadership.\n\nManager is currently mad, I apologised to her several times and even mentioned it was a mistake. Seems like she has taken it personally and I do see a cold behaviour from her.\n\nAm I fucked? Should I consider finding a new job? ",
      "url": "https://reddit.com/r/managers/comments/1r9mv1y/messed_up_my_relationship_with_my_manager/",
      "is_self": true,
      "link_flair_text": null,
      "engagement_score": 104.044,
      "comments": [
        {
          "id": "o6dhon0",
          "author": "ShipComprehensive543",
          "score": 84,
          "body": "Need more info - what did you say to leadership team?",
          "depth": 0
        },
        {
          "id": "o6djp2y",
          "author": "fuuuuuckendoobs",
          "score": 29,
          "body": "The internet needs to know what you said - don't hold out on us!",
          "depth": 0
        },
        {
          "id": "o6dhr9r",
          "author": "Aggressive_Put5891",
          "score": 21,
          "body": "Stop apologizing. Give it time/space. Perform your ass off.",
          "depth": 0
        },
        {
          "id": "o6dml0x",
          "author": "taurangy",
          "score": 18,
          "body": "Be honest: it wasn't a small mistake, was it? You said something atrocious.",
          "depth": 0
        },
        {
          "id": "o6ffpdo",
          "author": "Mojojojo3030",
          "score": 9,
          "body": "“manager (Female)”",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9dhr4",
      "subreddit": "cscareerquestions",
      "title": "Afraid I’m Pigeonholing Myself in Defense",
      "author": "AffectionateHat4236",
      "score": 10,
      "upvote_ratio": 0.69,
      "comment_count": 32,
      "created_utc": 1771539937.0,
      "selftext": "I recently finished my MS in Robotics and am joining a defense company as a UAV autopilot software engineer. While the job itself seems somewhat interesting on paper, I would like to transition towards the cooler parts of autonomous vehicles: computer vision, AI/ML, etc… I took a few ML courses in my Masters but struggled to get a role directly related to ML so I took the software role instead. I didn’t have a strong desire to work in defense, but I only managed to get offers from defense companies.\n\nBy working at this company for a year or so will I be pigeonholing myself? I’m afraid that the more time that passes from when I finished my Masters will make transitioning or leaving the defense industry harder. On top of that, I’m afraid that defense contractor work will be too slow and ultimately prevent me from learning as much at the beginning of my career.\n\nUltimately, I’m starting wonder if I sold myself short choosing this first job and would have been better off searching for a different job.\n\nI’d really appreciate any advice or stories from anyone who made a similar or notable switch between different roles.",
      "url": "https://reddit.com/r/cscareerquestions/comments/1r9dhr4/afraid_im_pigeonholing_myself_in_defense/",
      "is_self": true,
      "link_flair_text": "New Grad",
      "engagement_score": 87.77000000000001,
      "comments": [
        {
          "id": "o6bt53b",
          "author": "Agent_Burrito",
          "score": 36,
          "body": "If anything you’re very lucky. Defense is just about the only form of SWE that’s somewhat safe these days aside from pharma.",
          "depth": 0
        },
        {
          "id": "o6bp4is",
          "author": "JeborahBush",
          "score": 15,
          "body": "No you're fine, it's pretty hard to pigeonhole yourself on your first job. Good luck!",
          "depth": 0
        },
        {
          "id": "o6e7hjj",
          "author": "markmahwordz",
          "score": 4,
          "body": "Spent 6.75 years in my first job out of college in a defense contractor, and now am making my leave out of the defense life next month. It really depends on how much friction you want your next job search to be. It's easy to remain in the defense ecosystem, especially if you have a clearance, because getting interviews/callbacks from other defense contractors is much easier after having a proven track record in defense. It's also a very comfortable job outside of the work aspect; a 9/80 work schedule is game changing if you are in company that does that and the slow work pace can be relaxing. I honestly don't think I'll ever attain that same level of WLB anywhere else outside of defense after this. I will definitely consider defense again when I am older and ready to just coast to retirement. I think these factors are huge reason people get stuck in defense; it's what I've seen from my older, high tenured colleagues do and people that have left my company to go to other defense companies.\n\nI will say that defense is varied and even teams within the same company can have wildly different directives and experiences. I was fortunate to be in a team that got to do really cool stuff that also had a more relaxed pace, and I still got to learn a lot about SWE at the same time. Some of my colleagues that got placed into the big money maker team in my company were working left and right on different projects every month from what it seemed like. My recommendation is that you give this a fair shot for 1-2 years and make an adjustment if needed.\n\nYou may actually enjoy the work you do and discover that your team isn't as slow or not productive for learning as you may initially thought, or you completely hit the mark on your initial assessment. As a general life advice, use this opportunity to really isolate what you want from a job, and align your next actions to directly support that goal and don't compromise it just because it's easy. If you want out, commit to finding a job that fits your desired career track or work towards joining a top company that can give you that clout you need to work at your end goal role. Going for what is easy to get is how you really get stuck in a niche.",
          "depth": 0
        },
        {
          "id": "o6dk3lh",
          "author": "Few_Raisin_8981",
          "score": 5,
          "body": "Can't outsource defence work to third world countries",
          "depth": 0
        },
        {
          "id": "o6bqbrj",
          "author": "zacce",
          "score": 3,
          "body": "Doesn't sound like you have other options. Do you?",
          "depth": 0
        },
        {
          "id": "o6cz1fq",
          "author": "Least_Kaleidoscope38",
          "score": 3,
          "body": "You’re not. It’s very easy to go elsewhere",
          "depth": 0
        },
        {
          "id": "o6d1imw",
          "author": "SpecificTotal3030",
          "score": 3,
          "body": "You can move from one position to another, greatest skill to have is being able to not stay comfortable, and to consistently learn. That will help you grow.",
          "depth": 0
        },
        {
          "id": "o6djm7y",
          "author": "wyndyl",
          "score": 3,
          "body": "ATR is the acronym you’re looking for in the defense world. Find an ATR project and you’ll be able to do perception stuff.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9o7ep",
      "subreddit": "experienceddevs",
      "title": "How do you prioritize technical debt while delivering new features in a fast-paced environment?",
      "author": "vacaaa",
      "score": 15,
      "upvote_ratio": 0.75,
      "comment_count": 32,
      "created_utc": 1771569884.0,
      "selftext": "As experienced developers, we often find ourselves in a constant tug-of-war between addressing technical debt and delivering new features. In my current role, the pressure to meet deadlines often leads us to prioritize immediate deliverables, while the underlying technical debt continues to pile up. I've seen firsthand the impact this can have on code maintainability, team morale, and overall project quality. I'm curious about how others navigate this challenge. \n\nWhat strategies have you found effective in balancing the need for new features with the necessity of paying down technical debt?   \nDo you implement any specific frameworks or processes to help ensure that technical debt is not neglected in the hustle of development? \n\nLet's share our experiences and insights on managing this critical aspect of software development.",
      "url": "https://reddit.com/r/ExperiencedDevs/comments/1r9o7ep/how_do_you_prioritize_technical_debt_while/",
      "is_self": true,
      "link_flair_text": "Technical question",
      "engagement_score": 85.625,
      "comments": [
        {
          "id": "o6dslag",
          "author": "Difficult-Sugar-4862",
          "score": 22,
          "body": "Two things that worked for the teams I've been on:\n\n1. Stop treating tech debt as a separate backlog.  \nThe moment tech debt has its own list, it loses every prioritization fight. Instead, attach debt items to the feature work they affect. If Feature X requires touching the payments module and the payments module has known debt, the ticket for Feature X includes the cleanup. It gets estimated together, delivered together, and doesn't need a separate negotiation with product. The framing that works with PMs: \"we can build Feature X in 3 days on top of the current mess, or we can fix the mess and build it in 4 days. The 3-day version means the next feature touching this area takes 5 days instead of 2. \" Make the cost of inaction concrete and tied to their roadmap, not abstract.\n\n2. Spend 15-20% of sprint capacity on debt by default, not by request.  \nDon't ask permission each sprint. Establish it once as a team norm: one day per week (or equivalent) goes to debt, maintenance, and cleanup. Engineers pick the highest-impact items. Product gets 80% of capacity, which is what they were getting anyway once you account for meetings and context switching. The only thing that changed is you named it.\n\nOne thing I'd add that doesn't get talked about enough:  \nThere's a category of debt that's harder to see than traditional tech debt. It's code that works, passes tests, looks clean -- but nobody on the team actually understands what it does or why it was built that way. Especially common now with AI coding tools. I've been calling it cognitive debt.  \nTechnical debt is code you know is bad. Cognitive debt is code you don't even know is bad, because you never fully understood it. It doesn't show up in linters or coverage reports. It shows up when someone gets paged at 2 AM and can't debug the function because they accepted it from Copilot three months ago.\n\nI put together an open-source framework for managing it if you're interested, But even without a framework, the simplest thing you can do is ask in every PR review: \"can the author explain this code without reading it again?\" If the answer is no, that's debt accumulating whether it's on your backlog or not.",
          "depth": 0
        },
        {
          "id": "o6dwpu1",
          "author": "IndependentProject26",
          "score": 10,
          "body": "Greetings, fellow humans",
          "depth": 0
        },
        {
          "id": "o6drl5h",
          "author": "Mundane-Charge-1900",
          "score": 8,
          "body": "You don't. Well, it's not quite that bad.\n\nBut it's not getting funded unless you can convince the powers that be that it will allow you to deliver some important feature, or if the situation has gotten so dire that the team's ability to function at all or at reasonable velocity is being impacted.\n\nThe former can be done by combining the tech debt work with building related functionality. That can be a hard sell if it's particularly expensive over the feature cost without the tech debt.\n\nThe latter usually has to be manager driven when upper management views the team as dysfunctional and unable to deliver because of it. In some cases, a tech lead may be able to convince a manager of this.\n\nAt least that's my experience working in fast paced environments.",
          "depth": 0
        },
        {
          "id": "o6dqrys",
          "author": "bbqroast",
          "score": 3,
          "body": "First thing to get right is delivering the immediate deliverables with minimal debt. I.e. don't add new stuff to the stack that's crap.\n\nI think if you focus on adding stuff with technical excellence, then less and less of your stack is debt.\n\nPart two is reviewing and being pragmatic about what to fix. In particular, do not accept attractive broad generalisations. I.e. \"System X\" is slow (often we just want to replace system X because it feels legacy), instead try be specific about what is slow about it and why.\n\nE.g. during its very last days I had to do some emergency optimisations to a legacy app that was known to be very slow and crap, after some profiling I realised it basically boiled down to a very specific sub system that was melting. Fixing that took an afternoon and brought a huge amount of speed.\n\nMaybe instead of rewriting it from scratch we should have just worked harder to shake out the weak points (in another example, one of the key problems it had was ported over to the new system, and then had to be fixed anyway).",
          "depth": 0
        },
        {
          "id": "o6du3d8",
          "author": "_sw00",
          "score": 3,
          "body": "1. Stop calling low quality work tech debt \n\n\n2. Get good at producing high quality work at any level \n\n\n3. Make tech debt a business decision: \"we chose A over B because of business need X and Y constraints\"\n\n\n4. Let PO decide whether they'd like to pay down the debt every sprint planning \n\n\n5. Avoid \"tech debt cleaning\" sprints - they give business false reassurance that problems can be solved _once_ with upfront investment and you'll need to explain why there's still problems even after they gave your team a whole sprint to fix everything forever.",
          "depth": 0
        },
        {
          "id": "o6f78ah",
          "author": "Zulban",
          "score": 2,
          "body": "I'm sure it's not true everywhere, but in my experience \"fast pace\" has always just meant poor planning. Something shiny comes up and there's no leadership to insulate real priorities from it. People finish all the things that take a day and finish nothing that takes a month. ",
          "depth": 0
        },
        {
          "id": "o6g58rt",
          "author": "originalchronoguy",
          "score": 2,
          "body": "Hot Take: Most tech debt cries are often red herrings.  \nThe more I mature in my career, the more I am starting to side with management. Sure, there are real Technical Debt. And it is often a trade-off.\n\nBut lately, most of the tech debt I see are low-effort excuses to side step. Lately, it has come down to lack of skill, lack of proper design, lack of proper architecture. I've been called in many times to \"turn things around\" and it is often re-architecture work that solves the velocity/quality of deliverables. It is often getting engineers outside of their comfort zone. It is often prioritizing extensibility and re-useability to do the hard work up front first which then cascades in more manageable future work. Take a breath, step back for 5 seconds to look at the big picture can do wonders.  Versus we will rush this milestone and get back to it later mentality. Simply, lack of technical planning.  \n  \nThe biggest problem I see and it is exposing engineers (skillset) is some lack fundamentals - many lack basic DSA and this is crippling their ability to design so they resort to things that well, creates technical debt down the road for others. They can't think in reusable abstractions so they do repetitive work.",
          "depth": 0
        }
      ]
    },
    {
      "id": "1r9hxpo",
      "subreddit": "cscareerquestions",
      "title": "[Seeking help, advice] Switching major from English to CS",
      "author": "Ronin1926",
      "score": 8,
      "upvote_ratio": 0.68,
      "comment_count": 31,
      "created_utc": 1771551137.0,
      "selftext": "Hi all, current senior in high school. I'm currently committed into a T15 US school (T10 for CS) that I got into for English.\n\nCS has always been my secondary interest, but as I focused on building my English portfolio in high school my CS resume is severely lacking (I basically only know very basic python/java, zero projects, etc.).\n\nI'm now planning how I can switch fully to CS in college. As someone with little to no coding experience, whose long-term goal is to get into the AI/ML space, what should I focus on doing to prepare beyond just learning the basics?\n\nI will also be taking a gap year after high school, so I'll have about 1.5 years before I actually start college. Any and all advice is much appreciated",
      "url": "https://reddit.com/r/cscareerquestions/comments/1r9hxpo/seeking_help_advice_switching_major_from_english/",
      "is_self": true,
      "link_flair_text": "Student",
      "engagement_score": 85.008,
      "comments": [
        {
          "id": "o6cp2vm",
          "author": "Emotional-Nature4597",
          "score": 11,
          "body": "Ai/ml space is better off doing math (linalg and calc). Most cs majors have no idea about math and they are facing layoffs ",
          "depth": 0
        },
        {
          "id": "o6cje56",
          "author": "Historical-Bus-5547",
          "score": 10,
          "body": "Just quit. CS will be dead in a few years anyways.",
          "depth": 0
        },
        {
          "id": "o6cjsv1",
          "author": "lhorie",
          "score": 9,
          "body": "Don't you need to be accepted into a CS program, first of all? Also do you know what the prereqs are? Do you have them? You'd need to go talk to admissions/dept head to figure out what you need, as it varies by school.\n\nDoing extracurriculars isn't strictly necessary, it mostly helps with absorbing the material and prepping for whatever real world experience you'll need to build up coming into the industry after uni graduation.",
          "depth": 0
        },
        {
          "id": "o6csjnq",
          "author": "Traditional-Eye-7230",
          "score": 8,
          "body": "I am not sure that CS is the best option to get into the AI/ML space.  Why would you want to go into that anyway?  You would likely need a PhD.",
          "depth": 0
        },
        {
          "id": "o6cvb3u",
          "author": "varwave",
          "score": 3,
          "body": "An applied mathematics or statistics BS with a computer science MS might be more useful to be honest. Grad degrees are pretty common for entry level ML roles. \n\nDomain knowledge is super useful too. Like a biology minor and mathematics BS would be amazing for bioinformatics. I personally work in healthcare as a SWE/DS hybrid and have coworkers with a similar background. Likewise economics if interested in financial data \n\nAt least take up to data structures and algorithms and a database course from the CS department. But you’ll want to take probability theory, linear algebra, calculus, calculus based statistics and likely linear regression too, but regression can be done in grad school",
          "depth": 0
        },
        {
          "id": "o6clxkl",
          "author": "ldrx90",
          "score": 2,
          "body": "Taking math, particularly linear algebra and calculus since those are used in machine learning algorithms.\n\nUseful knowledge for 3D graphics if you ever get into that and data science, probably robotics too.  Honestly they are just damn useful math areas in my experience.\n\nI wish I spent more time getting comfortable with calculus personally, I see it quite a bit.  But I got into coding for video games, calc and linear algebra is everywhere.  A lot of calculus for design and linear algebra for gameplay and client programming.\n\nYou can take some free courses for machine learning online, you'll be doing calculus right away.",
          "depth": 0
        },
        {
          "id": "o6cvb12",
          "author": "BrokerBrody",
          "score": 2,
          "body": "Honestly, my advice is to do your research regarding how to switch majors for your university. \n\nIf CS is highly impacted, you should just reapply and go to a different school. It is especially doable because you are taking a gap year. \n\nThe industry is becoming increasingly competitive for juniors and hostile to “self taught”. University name often doesn’t even matter. \n\nAnd I know it sucks to go to a less prestigious school; but, engineering has always been more competitive and engineers always had to downgrade even when I was in college 10+ years ago. \n\nDon’t take shortcuts and sabotage yourself before you even start college.",
          "depth": 0
        },
        {
          "id": "o6cj9yc",
          "author": "Aber2346",
          "score": 1,
          "body": "Out of high school I had just some robotics experience with coding nothing too crazy but I was able to get into the field. As a freshman I'd probably look into something just to get introduced to coding, maybe CS50 online from Harvard is a good starting point? The bigger things I'd be looking at are if your CS program has seats available many top schools are impacted. Then I'd also ask if you're interested in CS just for the jobs the field is really not in the greatest shape these days ",
          "depth": 0
        },
        {
          "id": "o6cm1zr",
          "author": "[deleted]",
          "score": 1,
          "body": "[removed]",
          "depth": 0
        }
      ]
    }
  ]
}